Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_jpeg.h
// HUFFMIN0_2 Configuration

#define JPEG_HUFFMIN0_2_DATA0           (0xFFFFFFFFu<<0)
#define JPEG_HUFFMIN0_2_DATA0_0         (0x1u<<0)

// HUFFMIN0_3 Configuration

#define JPEG_HUFFMIN0_3_DATA0           (0xFu<<0)
#define JPEG_HUFFMIN0_3_DATA0_0         (0x1u<<0)

// HUFFMIN1_0 Configuration

#define JPEG_HUFFMIN1_0_DATA1           (0xFFFFFFFFu<<0)
#define JPEG_HUFFMIN1_0_DATA1_0         (0x1u<<0)

// HUFFMIN1_1 Configuration

#define JPEG_HUFFMIN1_1_DATA1           (0xFFFFFFFFu<<0)
#define JPEG_HUFFMIN1_1_DATA1_0         (0x1u<<0)

// HUFFMIN1_2 Configuration

#define JPEG_HUFFMIN1_2_DATA1           (0xFFFFFFFFu<<0)
#define JPEG_HUFFMIN1_2_DATA1_0         (0x1u<<0)

// HUFFMIN1_3 Configuration

#define JPEG_HUFFMIN1_3_DATA1           (0xFu<<0)
#define JPEG_HUFFMIN1_3_DATA1_0         (0x1u<<0)

// HUFFMIN2_0 Configuration

#define JPEG_HUFFMIN2_0_DATA2           (0xFFFFFFFFu<<0)
#define JPEG_HUFFMIN2_0_DATA2_0         (0x1u<<0)

// HUFFMIN2_1 Configuration

#define JPEG_HUFFMIN2_1_DATA2           (0xFFFFFFFFu<<0)
#define JPEG_HUFFMIN2_1_DATA2_0         (0x1u<<0)

// HUFFMIN2_2 Configuration

#define JPEG_HUFFMIN2_2_DATA2           (0xFFFFFFFFu<<0)
#define JPEG_HUFFMIN2_2_DATA2_0         (0x1u<<0)

// HUFFMIN2_3 Configuration

#define JPEG_HUFFMIN2_3_DATA2           (0xFu<<0)
#define JPEG_HUFFMIN2_3_DATA2_0         (0x1u<<0)

// HUFFMIN3_0 Configuration

#define JPEG_HUFFMIN3_0_DATA3           (0xFFFFFFFFu<<0)
#define JPEG_HUFFMIN3_0_DATA3_0         (0x1u<<0)

// HUFFMIN3_1 Configuration

#define JPEG_HUFFMIN3_1_DATA3           (0xFFFFFFFFu<<0)
#define JPEG_HUFFMIN3_1_DATA3_0         (0x1u<<0)

// HUFFMIN3_2 Configuration

#define JPEG_HUFFMIN3_2_DATA3           (0xFFFFFFFFu<<0)
#define JPEG_HUFFMIN3_2_DATA3_0         (0x1u<<0)

// HUFFMIN3_3 Configuration

#define JPEG_HUFFMIN3_3_DATA3           (0xFu<<0)
#define JPEG_HUFFMIN3_3_DATA3_0         (0x1u<<0)

// HUFFBASE0 Configuration

#define JPEG_HUFFBASE0_DATA1            (0x1FFu<<16)
#define JPEG_HUFFBASE0_DATA1_0          (0x1u<<16)
#define JPEG_HUFFBASE0_DATA0            (0x1FFu<<0)
#define JPEG_HUFFBASE0_DATA0_0          (0x1u<<0)

// HUFFBASE1 Configuration

#define JPEG_HUFFBASE1_DATA3            (0x1FFu<<16)
#define JPEG_HUFFBASE1_DATA3_0          (0x1u<<16)
#define JPEG_HUFFBASE1_DATA2            (0x1FFu<<0)
#define JPEG_HUFFBASE1_DATA2_0          (0x1u<<0)

// HUFFBASE2 Configuration

#define JPEG_HUFFBASE2_DATA5            (0x1FFu<<16)
#define JPEG_HUFFBASE2_DATA5_0          (0x1u<<16)
#define JPEG_HUFFBASE2_DATA4            (0x1FFu<<0)
#define JPEG_HUFFBASE2_DATA4_0          (0x1u<<0)

// HUFFBASE3 Configuration

#define JPEG_HUFFBASE3_DATA7            (0x1FFu<<16)
#define JPEG_HUFFBASE3_DATA7_0          (0x1u<<16)
#define JPEG_HUFFBASE3_DATA6            (0x1FFu<<0)
#define JPEG_HUFFBASE3_DATA6_0          (0x1u<<0)

// HUFFBASE4 Configuration

#define JPEG_HUFFBASE4_DATA9            (0x1FFu<<16)
#define JPEG_HUFFBASE4_DATA9_0          (0x1u<<16)
#define JPEG_HUFFBASE4_DATA8            (0x1FFu<<0)
#define JPEG_HUFFBASE4_DATA8_0          (0x1u<<0)

// HUFFBASE5 Configuration

#define JPEG_HUFFBASE5_DATA11           (0x1FFu<<16)
#define JPEG_HUFFBASE5_DATA11_0         (0x1u<<16)
#define JPEG_HUFFBASE5_DATA10           (0x1FFu<<0)
#define JPEG_HUFFBASE5_DATA10_0         (0x1u<<0)

// HUFFBASE6 Configuration

#define JPEG_HUFFBASE6_DATA13           (0x1FFu<<16)
#define JPEG_HUFFBASE6_DATA13_0         (0x1u<<16)
#define JPEG_HUFFBASE6_DATA12           (0x1FFu<<0)
#define JPEG_HUFFBASE6_DATA12_0         (0x1u<<0)

// HUFFBASE7 Configuration

#define JPEG_HUFFBASE7_DATA15           (0x1FFu<<16)
#define JPEG_HUFFBASE7_DATA15_0         (0x1u<<16)
#define JPEG_HUFFBASE7_DATA14           (0x1FFu<<0)
#define JPEG_HUFFBASE7_DATA14_0         (0x1u<<0)

// HUFFBASE8 Configuration

#define JPEG_HUFFBASE8_DATA17           (0x1FFu<<16)
#define JPEG_HUFFBASE8_DATA17_0         (0x1u<<16)
#define JPEG_HUFFBASE8_DATA16           (0x1FFu<<0)
#define JPEG_HUFFBASE8_DATA16_0         (0x1u<<0)

// HUFFBASE9 Configuration

#define JPEG_HUFFBASE9_DATA19           (0x1FFu<<16)
#define JPEG_HUFFBASE9_DATA19_0         (0x1u<<16)
#define JPEG_HUFFBASE9_DATA18           (0x1FFu<<0)
#define JPEG_HUFFBASE9_DATA18_0         (0x1u<<0)

// HUFFBASE10 Configuration

#define JPEG_HUFFBASE10_DATA21          (0x1FFu<<16)
#define JPEG_HUFFBASE10_DATA21_0        (0x1u<<16)
#define JPEG_HUFFBASE10_DATA20          (0x1FFu<<0)
#define JPEG_HUFFBASE10_DATA20_0        (0x1u<<0)

// HUFFBASE11 Configuration

#define JPEG_HUFFBASE11_DATA23          (0x1FFu<<16)
#define JPEG_HUFFBASE11_DATA23_0        (0x1u<<16)
#define JPEG_HUFFBASE11_DATA22          (0x1FFu<<0)
#define JPEG_HUFFBASE11_DATA22_0        (0x1u<<0)

// HUFFBASE12 Configuration

#define JPEG_HUFFBASE12_DATA25          (0x1FFu<<16)
#define JPEG_HUFFBASE12_DATA25_0        (0x1u<<16)
#define JPEG_HUFFBASE12_DATA24          (0x1FFu<<0)
#define JPEG_HUFFBASE12_DATA24_0        (0x1u<<0)

// HUFFBASE13 Configuration

#define JPEG_HUFFBASE13_DATA27          (0x1FFu<<16)
#define JPEG_HUFFBASE13_DATA27_0        (0x1u<<16)
#define JPEG_HUFFBASE13_DATA26          (0x1FFu<<0)
#define JPEG_HUFFBASE13_DATA26_0        (0x1u<<0)

// HUFFBASE14 Configuration

#define JPEG_HUFFBASE14_DATA29          (0x1FFu<<16)
#define JPEG_HUFFBASE14_DATA29_0        (0x1u<<16)
#define JPEG_HUFFBASE14_DATA28          (0x1FFu<<0)
#define JPEG_HUFFBASE14_DATA28_0        (0x1u<<0)

// HUFFBASE15 Configuration

#define JPEG_HUFFBASE15_DATA31          (0x1FFu<<16)
#define JPEG_HUFFBASE15_DATA31_0        (0x1u<<16)
#define JPEG_HUFFBASE15_DATA30          (0x1FFu<<0)
#define JPEG_HUFFBASE15_DATA30_0        (0x1u<<0)

// HUFFBASE16 Configuration

#define JPEG_HUFFBASE16_DATA33          (0x1FFu<<16)
#define JPEG_HUFFBASE16_DATA33_0        (0x1u<<16)
#define JPEG_HUFFBASE16_DATA32          (0x1FFu<<0)
#define JPEG_HUFFBASE16_DATA32_0        (0x1u<<0)

// HUFFBASE17 Configuration

#define JPEG_HUFFBASE17_DATA35          (0x1FFu<<16)
#define JPEG_HUFFBASE17_DATA35_0        (0x1u<<16)
#define JPEG_HUFFBASE17_DATA34          (0x1FFu<<0)
#define JPEG_HUFFBASE17_DATA34_0        (0x1u<<0)

// HUFFBASE18 Configuration

#define JPEG_HUFFBASE18_DATA37          (0x1FFu<<16)
#define JPEG_HUFFBASE18_DATA37_0        (0x1u<<16)
#define JPEG_HUFFBASE18_DATA36          (0x1FFu<<0)
#define JPEG_HUFFBASE18_DATA36_0        (0x1u<<0)

// HUFFBASE19 Configuration

#define JPEG_HUFFBASE19_DATA39          (0x1FFu<<16)
#define JPEG_HUFFBASE19_DATA39_0        (0x1u<<16)
#define JPEG_HUFFBASE19_DATA38          (0x1FFu<<0)
#define JPEG_HUFFBASE19_DATA38_0        (0x1u<<0)

// HUFFBASE20 Configuration

#define JPEG_HUFFBASE20_DATA41          (0x1FFu<<16)
#define JPEG_HUFFBASE20_DATA41_0        (0x1u<<16)
#define JPEG_HUFFBASE20_DATA40          (0x1FFu<<0)
#define JPEG_HUFFBASE20_DATA40_0        (0x1u<<0)

// HUFFBASE21 Configuration

#define JPEG_HUFFBASE21_DATA43          (0x1FFu<<16)
#define JPEG_HUFFBASE21_DATA43_0        (0x1u<<16)
#define JPEG_HUFFBASE21_DATA42          (0x1FFu<<0)
#define JPEG_HUFFBASE21_DATA42_0        (0x1u<<0)

// HUFFBASE22 Configuration

#define JPEG_HUFFBASE22_DATA45          (0x1FFu<<16)
#define JPEG_HUFFBASE22_DATA45_0        (0x1u<<16)
#define JPEG_HUFFBASE22_DATA44          (0x1FFu<<0)
#define JPEG_HUFFBASE22_DATA44_0        (0x1u<<0)

// HUFFBASE23 Configuration

