Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_jpeg.h
#define JPEG_HUFFBASE23_DATA47          (0x1FFu<<16)
#define JPEG_HUFFBASE23_DATA47_0        (0x1u<<16)
#define JPEG_HUFFBASE23_DATA46          (0x1FFu<<0)
#define JPEG_HUFFBASE23_DATA46_0        (0x1u<<0)

// HUFFBASE24 Configuration

#define JPEG_HUFFBASE24_DATA49          (0x1FFu<<16)
#define JPEG_HUFFBASE24_DATA49_0        (0x1u<<16)
#define JPEG_HUFFBASE24_DATA48          (0x1FFu<<0)
#define JPEG_HUFFBASE24_DATA48_0        (0x1u<<0)

// HUFFBASE25 Configuration

#define JPEG_HUFFBASE25_DATA51          (0x1FFu<<16)
#define JPEG_HUFFBASE25_DATA51_0        (0x1u<<16)
#define JPEG_HUFFBASE25_DATA50          (0x1FFu<<0)
#define JPEG_HUFFBASE25_DATA50_0        (0x1u<<0)

// HUFFBASE26 Configuration

#define JPEG_HUFFBASE26_DATA53          (0x1FFu<<16)
#define JPEG_HUFFBASE26_DATA53_0        (0x1u<<16)
#define JPEG_HUFFBASE26_DATA52          (0x1FFu<<0)
#define JPEG_HUFFBASE26_DATA52_0        (0x1u<<0)

// HUFFBASE27 Configuration

#define JPEG_HUFFBASE27_DATA55          (0x1FFu<<16)
#define JPEG_HUFFBASE27_DATA55_0        (0x1u<<16)
#define JPEG_HUFFBASE27_DATA54          (0x1FFu<<0)
#define JPEG_HUFFBASE27_DATA54_0        (0x1u<<0)

// HUFFBASE28 Configuration

#define JPEG_HUFFBASE28_DATA57          (0x1FFu<<16)
#define JPEG_HUFFBASE28_DATA57_0        (0x1u<<16)
#define JPEG_HUFFBASE28_DATA56          (0x1FFu<<0)
#define JPEG_HUFFBASE28_DATA56_0        (0x1u<<0)

// HUFFBASE29 Configuration

#define JPEG_HUFFBASE29_DATA59          (0x1FFu<<16)
#define JPEG_HUFFBASE29_DATA59_0        (0x1u<<16)
#define JPEG_HUFFBASE29_DATA58          (0x1FFu<<0)
#define JPEG_HUFFBASE29_DATA58_0        (0x1u<<0)

// HUFFBASE30 Configuration

#define JPEG_HUFFBASE30_DATA61          (0x1FFu<<16)
#define JPEG_HUFFBASE30_DATA61_0        (0x1u<<16)
#define JPEG_HUFFBASE30_DATA60          (0x1FFu<<0)
#define JPEG_HUFFBASE30_DATA60_0        (0x1u<<0)

// HUFFBASE31 Configuration

#define JPEG_HUFFBASE31_DATA63          (0x1FFu<<16)
#define JPEG_HUFFBASE31_DATA63_0        (0x1u<<16)
#define JPEG_HUFFBASE31_DATA62          (0x1FFu<<0)
#define JPEG_HUFFBASE31_DATA62_0        (0x1u<<0)

// HUFFSYMB0 Configuration

#define JPEG_HUFFSYMB0_DATA3            (0xFFu<<24)
#define JPEG_HUFFSYMB0_DATA3_0          (0x1u<<24)
#define JPEG_HUFFSYMB0_DATA2            (0xFFu<<16)
#define JPEG_HUFFSYMB0_DATA2_0          (0x1u<<16)
#define JPEG_HUFFSYMB0_DATA1            (0xFFu<<8)
#define JPEG_HUFFSYMB0_DATA1_0          (0x1u<<8)
#define JPEG_HUFFSYMB0_DATA0            (0xFFu<<0)
#define JPEG_HUFFSYMB0_DATA0_0          (0x1u<<0)

// HUFFSYMB1 Configuration

#define JPEG_HUFFSYMB1_DATA7            (0xFFu<<24)
#define JPEG_HUFFSYMB1_DATA7_0          (0x1u<<24)
#define JPEG_HUFFSYMB1_DATA6            (0xFFu<<16)
#define JPEG_HUFFSYMB1_DATA6_0          (0x1u<<16)
#define JPEG_HUFFSYMB1_DATA5            (0xFFu<<8)
#define JPEG_HUFFSYMB1_DATA5_0          (0x1u<<8)
#define JPEG_HUFFSYMB1_DATA4            (0xFFu<<0)
#define JPEG_HUFFSYMB1_DATA4_0          (0x1u<<0)

// HUFFSYMB2 Configuration

#define JPEG_HUFFSYMB2_DATA11           (0xFFu<<24)
#define JPEG_HUFFSYMB2_DATA11_0         (0x1u<<24)
#define JPEG_HUFFSYMB2_DATA10           (0xFFu<<16)
#define JPEG_HUFFSYMB2_DATA10_0         (0x1u<<16)
#define JPEG_HUFFSYMB2_DATA9            (0xFFu<<8)
#define JPEG_HUFFSYMB2_DATA9_0          (0x1u<<8)
#define JPEG_HUFFSYMB2_DATA8            (0xFFu<<0)
#define JPEG_HUFFSYMB2_DATA8_0          (0x1u<<0)

// HUFFSYMB3 Configuration

#define JPEG_HUFFSYMB3_DATA15           (0xFFu<<24)
#define JPEG_HUFFSYMB3_DATA15_0         (0x1u<<24)
#define JPEG_HUFFSYMB3_DATA14           (0xFFu<<16)
#define JPEG_HUFFSYMB3_DATA14_0         (0x1u<<16)
#define JPEG_HUFFSYMB3_DATA13           (0xFFu<<8)
#define JPEG_HUFFSYMB3_DATA13_0         (0x1u<<8)
#define JPEG_HUFFSYMB3_DATA12           (0xFFu<<0)
#define JPEG_HUFFSYMB3_DATA12_0         (0x1u<<0)

// HUFFSYMB4 Configuration

#define JPEG_HUFFSYMB4_DATA19           (0xFFu<<24)
#define JPEG_HUFFSYMB4_DATA19_0         (0x1u<<24)
#define JPEG_HUFFSYMB4_DATA18           (0xFFu<<16)
#define JPEG_HUFFSYMB4_DATA18_0         (0x1u<<16)
#define JPEG_HUFFSYMB4_DATA17           (0xFFu<<8)
#define JPEG_HUFFSYMB4_DATA17_0         (0x1u<<8)
#define JPEG_HUFFSYMB4_DATA16           (0xFFu<<0)
#define JPEG_HUFFSYMB4_DATA16_0         (0x1u<<0)

// HUFFSYMB5 Configuration

#define JPEG_HUFFSYMB5_DATA23           (0xFFu<<24)
#define JPEG_HUFFSYMB5_DATA23_0         (0x1u<<24)
#define JPEG_HUFFSYMB5_DATA22           (0xFFu<<16)
#define JPEG_HUFFSYMB5_DATA22_0         (0x1u<<16)
#define JPEG_HUFFSYMB5_DATA21           (0xFFu<<8)
#define JPEG_HUFFSYMB5_DATA21_0         (0x1u<<8)
#define JPEG_HUFFSYMB5_DATA20           (0xFFu<<0)
#define JPEG_HUFFSYMB5_DATA20_0         (0x1u<<0)

// HUFFSYMB6 Configuration

#define JPEG_HUFFSYMB6_DATA27           (0xFFu<<24)
#define JPEG_HUFFSYMB6_DATA27_0         (0x1u<<24)
#define JPEG_HUFFSYMB6_DATA26           (0xFFu<<16)
#define JPEG_HUFFSYMB6_DATA26_0         (0x1u<<16)
#define JPEG_HUFFSYMB6_DATA25           (0xFFu<<8)
#define JPEG_HUFFSYMB6_DATA25_0         (0x1u<<8)
#define JPEG_HUFFSYMB6_DATA24           (0xFFu<<0)
#define JPEG_HUFFSYMB6_DATA24_0         (0x1u<<0)

// HUFFSYMB7 Configuration

#define JPEG_HUFFSYMB7_DATA31           (0xFFu<<24)
#define JPEG_HUFFSYMB7_DATA31_0         (0x1u<<24)
#define JPEG_HUFFSYMB7_DATA30           (0xFFu<<16)
#define JPEG_HUFFSYMB7_DATA30_0         (0x1u<<16)
#define JPEG_HUFFSYMB7_DATA29           (0xFFu<<8)
#define JPEG_HUFFSYMB7_DATA29_0         (0x1u<<8)
#define JPEG_HUFFSYMB7_DATA28           (0xFFu<<0)
#define JPEG_HUFFSYMB7_DATA28_0         (0x1u<<0)

// HUFFSYMB8 Configuration

#define JPEG_HUFFSYMB8_DATA35           (0xFFu<<24)
#define JPEG_HUFFSYMB8_DATA35_0         (0x1u<<24)
#define JPEG_HUFFSYMB8_DATA34           (0xFFu<<16)
#define JPEG_HUFFSYMB8_DATA34_0         (0x1u<<16)
#define JPEG_HUFFSYMB8_DATA33           (0xFFu<<8)
#define JPEG_HUFFSYMB8_DATA33_0         (0x1u<<8)
#define JPEG_HUFFSYMB8_DATA32           (0xFFu<<0)
#define JPEG_HUFFSYMB8_DATA32_0         (0x1u<<0)

// HUFFSYMB9 Configuration

#define JPEG_HUFFSYMB9_DATA39           (0xFFu<<24)
#define JPEG_HUFFSYMB9_DATA39_0         (0x1u<<24)
#define JPEG_HUFFSYMB9_DATA38           (0xFFu<<16)
#define JPEG_HUFFSYMB9_DATA38_0         (0x1u<<16)
#define JPEG_HUFFSYMB9_DATA37           (0xFFu<<8)
#define JPEG_HUFFSYMB9_DATA37_0         (0x1u<<8)
#define JPEG_HUFFSYMB9_DATA36           (0xFFu<<0)
#define JPEG_HUFFSYMB9_DATA36_0         (0x1u<<0)

// HUFFSYMB10 Configuration

