Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_jpeg.h
#define JPEG_HUFFSYMB10_DATA43          (0xFFu<<24)
#define JPEG_HUFFSYMB10_DATA43_0        (0x1u<<24)
#define JPEG_HUFFSYMB10_DATA42          (0xFFu<<16)
#define JPEG_HUFFSYMB10_DATA42_0        (0x1u<<16)
#define JPEG_HUFFSYMB10_DATA41          (0xFFu<<8)
#define JPEG_HUFFSYMB10_DATA41_0        (0x1u<<8)
#define JPEG_HUFFSYMB10_DATA40          (0xFFu<<0)
#define JPEG_HUFFSYMB10_DATA40_0        (0x1u<<0)

// HUFFSYMB11 Configuration

#define JPEG_HUFFSYMB11_DATA47          (0xFFu<<24)
#define JPEG_HUFFSYMB11_DATA47_0        (0x1u<<24)
#define JPEG_HUFFSYMB11_DATA46          (0xFFu<<16)
#define JPEG_HUFFSYMB11_DATA46_0        (0x1u<<16)
#define JPEG_HUFFSYMB11_DATA45          (0xFFu<<8)
#define JPEG_HUFFSYMB11_DATA45_0        (0x1u<<8)
#define JPEG_HUFFSYMB11_DATA44          (0xFFu<<0)
#define JPEG_HUFFSYMB11_DATA44_0        (0x1u<<0)

// HUFFSYMB12 Configuration

#define JPEG_HUFFSYMB12_DATA51          (0xFFu<<24)
#define JPEG_HUFFSYMB12_DATA51_0        (0x1u<<24)
#define JPEG_HUFFSYMB12_DATA50          (0xFFu<<16)
#define JPEG_HUFFSYMB12_DATA50_0        (0x1u<<16)
#define JPEG_HUFFSYMB12_DATA49          (0xFFu<<8)
#define JPEG_HUFFSYMB12_DATA49_0        (0x1u<<8)
#define JPEG_HUFFSYMB12_DATA48          (0xFFu<<0)
#define JPEG_HUFFSYMB12_DATA48_0        (0x1u<<0)

// HUFFSYMB13 Configuration

#define JPEG_HUFFSYMB13_DATA55          (0xFFu<<24)
#define JPEG_HUFFSYMB13_DATA55_0        (0x1u<<24)
#define JPEG_HUFFSYMB13_DATA54          (0xFFu<<16)
#define JPEG_HUFFSYMB13_DATA54_0        (0x1u<<16)
#define JPEG_HUFFSYMB13_DATA53          (0xFFu<<8)
#define JPEG_HUFFSYMB13_DATA53_0        (0x1u<<8)
#define JPEG_HUFFSYMB13_DATA52          (0xFFu<<0)
#define JPEG_HUFFSYMB13_DATA52_0        (0x1u<<0)

// HUFFSYMB14 Configuration

#define JPEG_HUFFSYMB14_DATA59          (0xFFu<<24)
#define JPEG_HUFFSYMB14_DATA59_0        (0x1u<<24)
#define JPEG_HUFFSYMB14_DATA58          (0xFFu<<16)
#define JPEG_HUFFSYMB14_DATA58_0        (0x1u<<16)
#define JPEG_HUFFSYMB14_DATA57          (0xFFu<<8)
#define JPEG_HUFFSYMB14_DATA57_0        (0x1u<<8)
#define JPEG_HUFFSYMB14_DATA56          (0xFFu<<0)
#define JPEG_HUFFSYMB14_DATA56_0        (0x1u<<0)

// HUFFSYMB15 Configuration

#define JPEG_HUFFSYMB15_DATA63          (0xFFu<<24)
#define JPEG_HUFFSYMB15_DATA63_0        (0x1u<<24)
#define JPEG_HUFFSYMB15_DATA62          (0xFFu<<16)
#define JPEG_HUFFSYMB15_DATA62_0        (0x1u<<16)
#define JPEG_HUFFSYMB15_DATA61          (0xFFu<<8)
#define JPEG_HUFFSYMB15_DATA61_0        (0x1u<<8)
#define JPEG_HUFFSYMB15_DATA60          (0xFFu<<0)
#define JPEG_HUFFSYMB15_DATA60_0        (0x1u<<0)

// HUFFSYMB16 Configuration

#define JPEG_HUFFSYMB16_DATA67          (0xFFu<<24)
#define JPEG_HUFFSYMB16_DATA67_0        (0x1u<<24)
#define JPEG_HUFFSYMB16_DATA66          (0xFFu<<16)
#define JPEG_HUFFSYMB16_DATA66_0        (0x1u<<16)
#define JPEG_HUFFSYMB16_DATA65          (0xFFu<<8)
#define JPEG_HUFFSYMB16_DATA65_0        (0x1u<<8)
#define JPEG_HUFFSYMB16_DATA64          (0xFFu<<0)
#define JPEG_HUFFSYMB16_DATA64_0        (0x1u<<0)

// HUFFSYMB17 Configuration

#define JPEG_HUFFSYMB17_DATA71          (0xFFu<<24)
#define JPEG_HUFFSYMB17_DATA71_0        (0x1u<<24)
#define JPEG_HUFFSYMB17_DATA70          (0xFFu<<16)
#define JPEG_HUFFSYMB17_DATA70_0        (0x1u<<16)
#define JPEG_HUFFSYMB17_DATA69          (0xFFu<<8)
#define JPEG_HUFFSYMB17_DATA69_0        (0x1u<<8)
#define JPEG_HUFFSYMB17_DATA68          (0xFFu<<0)
#define JPEG_HUFFSYMB17_DATA68_0        (0x1u<<0)

// HUFFSYMB18 Configuration

#define JPEG_HUFFSYMB18_DATA75          (0xFFu<<24)
#define JPEG_HUFFSYMB18_DATA75_0        (0x1u<<24)
#define JPEG_HUFFSYMB18_DATA74          (0xFFu<<16)
#define JPEG_HUFFSYMB18_DATA74_0        (0x1u<<16)
#define JPEG_HUFFSYMB18_DATA73          (0xFFu<<8)
#define JPEG_HUFFSYMB18_DATA73_0        (0x1u<<8)
#define JPEG_HUFFSYMB18_DATA72          (0xFFu<<0)
#define JPEG_HUFFSYMB18_DATA72_0        (0x1u<<0)

// HUFFSYMB19 Configuration

#define JPEG_HUFFSYMB19_DATA79          (0xFFu<<24)
#define JPEG_HUFFSYMB19_DATA79_0        (0x1u<<24)
#define JPEG_HUFFSYMB19_DATA78          (0xFFu<<16)
#define JPEG_HUFFSYMB19_DATA78_0        (0x1u<<16)
#define JPEG_HUFFSYMB19_DATA77          (0xFFu<<8)
#define JPEG_HUFFSYMB19_DATA77_0        (0x1u<<8)
#define JPEG_HUFFSYMB19_DATA76          (0xFFu<<0)
#define JPEG_HUFFSYMB19_DATA76_0        (0x1u<<0)

// HUFFSYMB20 Configuration

#define JPEG_HUFFSYMB20_DATA83          (0xFFu<<24)
#define JPEG_HUFFSYMB20_DATA83_0        (0x1u<<24)
#define JPEG_HUFFSYMB20_DATA82          (0xFFu<<16)
#define JPEG_HUFFSYMB20_DATA82_0        (0x1u<<16)
#define JPEG_HUFFSYMB20_DATA81          (0xFFu<<8)
#define JPEG_HUFFSYMB20_DATA81_0        (0x1u<<8)
#define JPEG_HUFFSYMB20_DATA80          (0xFFu<<0)
#define JPEG_HUFFSYMB20_DATA80_0        (0x1u<<0)

// HUFFSYMB21 Configuration

#define JPEG_HUFFSYMB21_DATA87          (0xFFu<<24)
#define JPEG_HUFFSYMB21_DATA87_0        (0x1u<<24)
#define JPEG_HUFFSYMB21_DATA86          (0xFFu<<16)
#define JPEG_HUFFSYMB21_DATA86_0        (0x1u<<16)
#define JPEG_HUFFSYMB21_DATA85          (0xFFu<<8)
#define JPEG_HUFFSYMB21_DATA85_0        (0x1u<<8)
#define JPEG_HUFFSYMB21_DATA84          (0xFFu<<0)
#define JPEG_HUFFSYMB21_DATA84_0        (0x1u<<0)

// HUFFSYMB22 Configuration

#define JPEG_HUFFSYMB22_DATA91          (0xFFu<<24)
#define JPEG_HUFFSYMB22_DATA91_0        (0x1u<<24)
#define JPEG_HUFFSYMB22_DATA90          (0xFFu<<16)
#define JPEG_HUFFSYMB22_DATA90_0        (0x1u<<16)
#define JPEG_HUFFSYMB22_DATA89          (0xFFu<<8)
#define JPEG_HUFFSYMB22_DATA89_0        (0x1u<<8)
#define JPEG_HUFFSYMB22_DATA88          (0xFFu<<0)
#define JPEG_HUFFSYMB22_DATA88_0        (0x1u<<0)

// HUFFSYMB23 Configuration

#define JPEG_HUFFSYMB23_DATA95          (0xFFu<<24)
#define JPEG_HUFFSYMB23_DATA95_0        (0x1u<<24)
#define JPEG_HUFFSYMB23_DATA94          (0xFFu<<16)
#define JPEG_HUFFSYMB23_DATA94_0        (0x1u<<16)
#define JPEG_HUFFSYMB23_DATA93          (0xFFu<<8)
#define JPEG_HUFFSYMB23_DATA93_0        (0x1u<<8)
#define JPEG_HUFFSYMB23_DATA92          (0xFFu<<0)
#define JPEG_HUFFSYMB23_DATA92_0        (0x1u<<0)

// HUFFSYMB24 Configuration

