Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_jpeg.h
#define JPEG_HUFFSYMB24_DATA99          (0xFFu<<24)
#define JPEG_HUFFSYMB24_DATA99_0        (0x1u<<24)
#define JPEG_HUFFSYMB24_DATA98          (0xFFu<<16)
#define JPEG_HUFFSYMB24_DATA98_0        (0x1u<<16)
#define JPEG_HUFFSYMB24_DATA97          (0xFFu<<8)
#define JPEG_HUFFSYMB24_DATA97_0        (0x1u<<8)
#define JPEG_HUFFSYMB24_DATA96          (0xFFu<<0)
#define JPEG_HUFFSYMB24_DATA96_0        (0x1u<<0)

// HUFFSYMB25 Configuration

#define JPEG_HUFFSYMB25_DATA103         (0xFFu<<24)
#define JPEG_HUFFSYMB25_DATA103_0       (0x1u<<24)
#define JPEG_HUFFSYMB25_DATA102         (0xFFu<<16)
#define JPEG_HUFFSYMB25_DATA102_0       (0x1u<<16)
#define JPEG_HUFFSYMB25_DATA101         (0xFFu<<8)
#define JPEG_HUFFSYMB25_DATA101_0       (0x1u<<8)
#define JPEG_HUFFSYMB25_DATA100         (0xFFu<<0)
#define JPEG_HUFFSYMB25_DATA100_0       (0x1u<<0)

// HUFFSYMB26 Configuration

#define JPEG_HUFFSYMB26_DATA107         (0xFFu<<24)
#define JPEG_HUFFSYMB26_DATA107_0       (0x1u<<24)
#define JPEG_HUFFSYMB26_DATA106         (0xFFu<<16)
#define JPEG_HUFFSYMB26_DATA106_0       (0x1u<<16)
#define JPEG_HUFFSYMB26_DATA105         (0xFFu<<8)
#define JPEG_HUFFSYMB26_DATA105_0       (0x1u<<8)
#define JPEG_HUFFSYMB26_DATA104         (0xFFu<<0)
#define JPEG_HUFFSYMB26_DATA104_0       (0x1u<<0)

// HUFFSYMB27 Configuration

#define JPEG_HUFFSYMB27_DATA111         (0xFFu<<24)
#define JPEG_HUFFSYMB27_DATA111_0       (0x1u<<24)
#define JPEG_HUFFSYMB27_DATA110         (0xFFu<<16)
#define JPEG_HUFFSYMB27_DATA110_0       (0x1u<<16)
#define JPEG_HUFFSYMB27_DATA109         (0xFFu<<8)
#define JPEG_HUFFSYMB27_DATA109_0       (0x1u<<8)
#define JPEG_HUFFSYMB27_DATA108         (0xFFu<<0)
#define JPEG_HUFFSYMB27_DATA108_0       (0x1u<<0)

// HUFFSYMB28 Configuration

#define JPEG_HUFFSYMB28_DATA115         (0xFFu<<24)
#define JPEG_HUFFSYMB28_DATA115_0       (0x1u<<24)
#define JPEG_HUFFSYMB28_DATA114         (0xFFu<<16)
#define JPEG_HUFFSYMB28_DATA114_0       (0x1u<<16)
#define JPEG_HUFFSYMB28_DATA113         (0xFFu<<8)
#define JPEG_HUFFSYMB28_DATA113_0       (0x1u<<8)
#define JPEG_HUFFSYMB28_DATA112         (0xFFu<<0)
#define JPEG_HUFFSYMB28_DATA112_0       (0x1u<<0)

// HUFFSYMB29 Configuration

#define JPEG_HUFFSYMB29_DATA119         (0xFFu<<24)
#define JPEG_HUFFSYMB29_DATA119_0       (0x1u<<24)
#define JPEG_HUFFSYMB29_DATA118         (0xFFu<<16)
#define JPEG_HUFFSYMB29_DATA118_0       (0x1u<<16)
#define JPEG_HUFFSYMB29_DATA117         (0xFFu<<8)
#define JPEG_HUFFSYMB29_DATA117_0       (0x1u<<8)
#define JPEG_HUFFSYMB29_DATA116         (0xFFu<<0)
#define JPEG_HUFFSYMB29_DATA116_0       (0x1u<<0)

// HUFFSYMB30 Configuration

#define JPEG_HUFFSYMB30_DATA123         (0xFFu<<24)
#define JPEG_HUFFSYMB30_DATA123_0       (0x1u<<24)
#define JPEG_HUFFSYMB30_DATA122         (0xFFu<<16)
#define JPEG_HUFFSYMB30_DATA122_0       (0x1u<<16)
#define JPEG_HUFFSYMB30_DATA121         (0xFFu<<8)
#define JPEG_HUFFSYMB30_DATA121_0       (0x1u<<8)
#define JPEG_HUFFSYMB30_DATA120         (0xFFu<<0)
#define JPEG_HUFFSYMB30_DATA120_0       (0x1u<<0)

// HUFFSYMB31 Configuration

#define JPEG_HUFFSYMB31_DATA127         (0xFFu<<24)
#define JPEG_HUFFSYMB31_DATA127_0       (0x1u<<24)
#define JPEG_HUFFSYMB31_DATA126         (0xFFu<<16)
#define JPEG_HUFFSYMB31_DATA126_0       (0x1u<<16)
#define JPEG_HUFFSYMB31_DATA125         (0xFFu<<8)
#define JPEG_HUFFSYMB31_DATA125_0       (0x1u<<8)
#define JPEG_HUFFSYMB31_DATA124         (0xFFu<<0)
#define JPEG_HUFFSYMB31_DATA124_0       (0x1u<<0)

// HUFFSYMB32 Configuration

#define JPEG_HUFFSYMB32_DATA131         (0xFFu<<24)
#define JPEG_HUFFSYMB32_DATA131_0       (0x1u<<24)
#define JPEG_HUFFSYMB32_DATA130         (0xFFu<<16)
#define JPEG_HUFFSYMB32_DATA130_0       (0x1u<<16)
#define JPEG_HUFFSYMB32_DATA129         (0xFFu<<8)
#define JPEG_HUFFSYMB32_DATA129_0       (0x1u<<8)
#define JPEG_HUFFSYMB32_DATA128         (0xFFu<<0)
#define JPEG_HUFFSYMB32_DATA128_0       (0x1u<<0)

// HUFFSYMB33 Configuration

#define JPEG_HUFFSYMB33_DATA135         (0xFFu<<24)
#define JPEG_HUFFSYMB33_DATA135_0       (0x1u<<24)
#define JPEG_HUFFSYMB33_DATA134         (0xFFu<<16)
#define JPEG_HUFFSYMB33_DATA134_0       (0x1u<<16)
#define JPEG_HUFFSYMB33_DATA133         (0xFFu<<8)
#define JPEG_HUFFSYMB33_DATA133_0       (0x1u<<8)
#define JPEG_HUFFSYMB33_DATA132         (0xFFu<<0)
#define JPEG_HUFFSYMB33_DATA132_0       (0x1u<<0)

// HUFFSYMB34 Configuration

#define JPEG_HUFFSYMB34_DATA139         (0xFFu<<24)
#define JPEG_HUFFSYMB34_DATA139_0       (0x1u<<24)
#define JPEG_HUFFSYMB34_DATA138         (0xFFu<<16)
#define JPEG_HUFFSYMB34_DATA138_0       (0x1u<<16)
#define JPEG_HUFFSYMB34_DATA137         (0xFFu<<8)
#define JPEG_HUFFSYMB34_DATA137_0       (0x1u<<8)
#define JPEG_HUFFSYMB34_DATA136         (0xFFu<<0)
#define JPEG_HUFFSYMB34_DATA136_0       (0x1u<<0)

// HUFFSYMB35 Configuration

#define JPEG_HUFFSYMB35_DATA143         (0xFFu<<24)
#define JPEG_HUFFSYMB35_DATA143_0       (0x1u<<24)
#define JPEG_HUFFSYMB35_DATA142         (0xFFu<<16)
#define JPEG_HUFFSYMB35_DATA142_0       (0x1u<<16)
#define JPEG_HUFFSYMB35_DATA141         (0xFFu<<8)
#define JPEG_HUFFSYMB35_DATA141_0       (0x1u<<8)
#define JPEG_HUFFSYMB35_DATA140         (0xFFu<<0)
#define JPEG_HUFFSYMB35_DATA140_0       (0x1u<<0)

// HUFFSYMB36 Configuration

#define JPEG_HUFFSYMB36_DATA147         (0xFFu<<24)
#define JPEG_HUFFSYMB36_DATA147_0       (0x1u<<24)
#define JPEG_HUFFSYMB36_DATA146         (0xFFu<<16)
#define JPEG_HUFFSYMB36_DATA146_0       (0x1u<<16)
#define JPEG_HUFFSYMB36_DATA145         (0xFFu<<8)
#define JPEG_HUFFSYMB36_DATA145_0       (0x1u<<8)
#define JPEG_HUFFSYMB36_DATA144         (0xFFu<<0)
#define JPEG_HUFFSYMB36_DATA144_0       (0x1u<<0)

// HUFFSYMB37 Configuration

#define JPEG_HUFFSYMB37_DATA151         (0xFFu<<24)
#define JPEG_HUFFSYMB37_DATA151_0       (0x1u<<24)
#define JPEG_HUFFSYMB37_DATA150         (0xFFu<<16)
#define JPEG_HUFFSYMB37_DATA150_0       (0x1u<<16)
#define JPEG_HUFFSYMB37_DATA149         (0xFFu<<8)
#define JPEG_HUFFSYMB37_DATA149_0       (0x1u<<8)
#define JPEG_HUFFSYMB37_DATA148         (0xFFu<<0)
#define JPEG_HUFFSYMB37_DATA148_0       (0x1u<<0)

// HUFFSYMB38 Configuration

