Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_jpeg.h
#define JPEG_HUFFSYMB38_DATA155         (0xFFu<<24)
#define JPEG_HUFFSYMB38_DATA155_0       (0x1u<<24)
#define JPEG_HUFFSYMB38_DATA154         (0xFFu<<16)
#define JPEG_HUFFSYMB38_DATA154_0       (0x1u<<16)
#define JPEG_HUFFSYMB38_DATA153         (0xFFu<<8)
#define JPEG_HUFFSYMB38_DATA153_0       (0x1u<<8)
#define JPEG_HUFFSYMB38_DATA152         (0xFFu<<0)
#define JPEG_HUFFSYMB38_DATA152_0       (0x1u<<0)

// HUFFSYMB39 Configuration

#define JPEG_HUFFSYMB39_DATA159         (0xFFu<<24)
#define JPEG_HUFFSYMB39_DATA159_0       (0x1u<<24)
#define JPEG_HUFFSYMB39_DATA158         (0xFFu<<16)
#define JPEG_HUFFSYMB39_DATA158_0       (0x1u<<16)
#define JPEG_HUFFSYMB39_DATA157         (0xFFu<<8)
#define JPEG_HUFFSYMB39_DATA157_0       (0x1u<<8)
#define JPEG_HUFFSYMB39_DATA156         (0xFFu<<0)
#define JPEG_HUFFSYMB39_DATA156_0       (0x1u<<0)

// HUFFSYMB40 Configuration

#define JPEG_HUFFSYMB40_DATA163         (0xFFu<<24)
#define JPEG_HUFFSYMB40_DATA163_0       (0x1u<<24)
#define JPEG_HUFFSYMB40_DATA162         (0xFFu<<16)
#define JPEG_HUFFSYMB40_DATA162_0       (0x1u<<16)
#define JPEG_HUFFSYMB40_DATA161         (0xFFu<<8)
#define JPEG_HUFFSYMB40_DATA161_0       (0x1u<<8)
#define JPEG_HUFFSYMB40_DATA160         (0xFFu<<0)
#define JPEG_HUFFSYMB40_DATA160_0       (0x1u<<0)

// HUFFSYMB41 Configuration

#define JPEG_HUFFSYMB41_DATA167         (0xFFu<<24)
#define JPEG_HUFFSYMB41_DATA167_0       (0x1u<<24)
#define JPEG_HUFFSYMB41_DATA166         (0xFFu<<16)
#define JPEG_HUFFSYMB41_DATA166_0       (0x1u<<16)
#define JPEG_HUFFSYMB41_DATA165         (0xFFu<<8)
#define JPEG_HUFFSYMB41_DATA165_0       (0x1u<<8)
#define JPEG_HUFFSYMB41_DATA164         (0xFFu<<0)
#define JPEG_HUFFSYMB41_DATA164_0       (0x1u<<0)

// HUFFSYMB42 Configuration

#define JPEG_HUFFSYMB42_DATA171         (0xFFu<<24)
#define JPEG_HUFFSYMB42_DATA171_0       (0x1u<<24)
#define JPEG_HUFFSYMB42_DATA170         (0xFFu<<16)
#define JPEG_HUFFSYMB42_DATA170_0       (0x1u<<16)
#define JPEG_HUFFSYMB42_DATA169         (0xFFu<<8)
#define JPEG_HUFFSYMB42_DATA169_0       (0x1u<<8)
#define JPEG_HUFFSYMB42_DATA168         (0xFFu<<0)
#define JPEG_HUFFSYMB42_DATA168_0       (0x1u<<0)

// HUFFSYMB43 Configuration

#define JPEG_HUFFSYMB43_DATA175         (0xFFu<<24)
#define JPEG_HUFFSYMB43_DATA175_0       (0x1u<<24)
#define JPEG_HUFFSYMB43_DATA174         (0xFFu<<16)
#define JPEG_HUFFSYMB43_DATA174_0       (0x1u<<16)
#define JPEG_HUFFSYMB43_DATA173         (0xFFu<<8)
#define JPEG_HUFFSYMB43_DATA173_0       (0x1u<<8)
#define JPEG_HUFFSYMB43_DATA172         (0xFFu<<0)
#define JPEG_HUFFSYMB43_DATA172_0       (0x1u<<0)

// HUFFSYMB44 Configuration

#define JPEG_HUFFSYMB44_DATA179         (0xFFu<<24)
#define JPEG_HUFFSYMB44_DATA179_0       (0x1u<<24)
#define JPEG_HUFFSYMB44_DATA178         (0xFFu<<16)
#define JPEG_HUFFSYMB44_DATA178_0       (0x1u<<16)
#define JPEG_HUFFSYMB44_DATA177         (0xFFu<<8)
#define JPEG_HUFFSYMB44_DATA177_0       (0x1u<<8)
#define JPEG_HUFFSYMB44_DATA176         (0xFFu<<0)
#define JPEG_HUFFSYMB44_DATA176_0       (0x1u<<0)

// HUFFSYMB45 Configuration

#define JPEG_HUFFSYMB45_DATA183         (0xFFu<<24)
#define JPEG_HUFFSYMB45_DATA183_0       (0x1u<<24)
#define JPEG_HUFFSYMB45_DATA182         (0xFFu<<16)
#define JPEG_HUFFSYMB45_DATA182_0       (0x1u<<16)
#define JPEG_HUFFSYMB45_DATA181         (0xFFu<<8)
#define JPEG_HUFFSYMB45_DATA181_0       (0x1u<<8)
#define JPEG_HUFFSYMB45_DATA180         (0xFFu<<0)
#define JPEG_HUFFSYMB45_DATA180_0       (0x1u<<0)

// HUFFSYMB46 Configuration

#define JPEG_HUFFSYMB46_DATA187         (0xFFu<<24)
#define JPEG_HUFFSYMB46_DATA187_0       (0x1u<<24)
#define JPEG_HUFFSYMB46_DATA186         (0xFFu<<16)
#define JPEG_HUFFSYMB46_DATA186_0       (0x1u<<16)
#define JPEG_HUFFSYMB46_DATA185         (0xFFu<<8)
#define JPEG_HUFFSYMB46_DATA185_0       (0x1u<<8)
#define JPEG_HUFFSYMB46_DATA184         (0xFFu<<0)
#define JPEG_HUFFSYMB46_DATA184_0       (0x1u<<0)

// HUFFSYMB47 Configuration

#define JPEG_HUFFSYMB47_DATA191         (0xFFu<<24)
#define JPEG_HUFFSYMB47_DATA191_0       (0x1u<<24)
#define JPEG_HUFFSYMB47_DATA190         (0xFFu<<16)
#define JPEG_HUFFSYMB47_DATA190_0       (0x1u<<16)
#define JPEG_HUFFSYMB47_DATA189         (0xFFu<<8)
#define JPEG_HUFFSYMB47_DATA189_0       (0x1u<<8)
#define JPEG_HUFFSYMB47_DATA188         (0xFFu<<0)
#define JPEG_HUFFSYMB47_DATA188_0       (0x1u<<0)

// HUFFSYMB48 Configuration

#define JPEG_HUFFSYMB48_DATA195         (0xFFu<<24)
#define JPEG_HUFFSYMB48_DATA195_0       (0x1u<<24)
#define JPEG_HUFFSYMB48_DATA194         (0xFFu<<16)
#define JPEG_HUFFSYMB48_DATA194_0       (0x1u<<16)
#define JPEG_HUFFSYMB48_DATA193         (0xFFu<<8)
#define JPEG_HUFFSYMB48_DATA193_0       (0x1u<<8)
#define JPEG_HUFFSYMB48_DATA192         (0xFFu<<0)
#define JPEG_HUFFSYMB48_DATA192_0       (0x1u<<0)

// HUFFSYMB49 Configuration

#define JPEG_HUFFSYMB49_DATA199         (0xFFu<<24)
#define JPEG_HUFFSYMB49_DATA199_0       (0x1u<<24)
#define JPEG_HUFFSYMB49_DATA198         (0xFFu<<16)
#define JPEG_HUFFSYMB49_DATA198_0       (0x1u<<16)
#define JPEG_HUFFSYMB49_DATA197         (0xFFu<<8)
#define JPEG_HUFFSYMB49_DATA197_0       (0x1u<<8)
#define JPEG_HUFFSYMB49_DATA196         (0xFFu<<0)
#define JPEG_HUFFSYMB49_DATA196_0       (0x1u<<0)

// HUFFSYMB50 Configuration

#define JPEG_HUFFSYMB50_DATA203         (0xFFu<<24)
#define JPEG_HUFFSYMB50_DATA203_0       (0x1u<<24)
#define JPEG_HUFFSYMB50_DATA202         (0xFFu<<16)
#define JPEG_HUFFSYMB50_DATA202_0       (0x1u<<16)
#define JPEG_HUFFSYMB50_DATA201         (0xFFu<<8)
#define JPEG_HUFFSYMB50_DATA201_0       (0x1u<<8)
#define JPEG_HUFFSYMB50_DATA200         (0xFFu<<0)
#define JPEG_HUFFSYMB50_DATA200_0       (0x1u<<0)

// HUFFSYMB51 Configuration

#define JPEG_HUFFSYMB51_DATA207         (0xFFu<<24)
#define JPEG_HUFFSYMB51_DATA207_0       (0x1u<<24)
#define JPEG_HUFFSYMB51_DATA206         (0xFFu<<16)
#define JPEG_HUFFSYMB51_DATA206_0       (0x1u<<16)
#define JPEG_HUFFSYMB51_DATA205         (0xFFu<<8)
#define JPEG_HUFFSYMB51_DATA205_0       (0x1u<<8)
#define JPEG_HUFFSYMB51_DATA204         (0xFFu<<0)
#define JPEG_HUFFSYMB51_DATA204_0       (0x1u<<0)

// HUFFSYMB52 Configuration

