Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_jpeg.h
#define JPEG_HUFFSYMB52_DATA211         (0xFFu<<24)
#define JPEG_HUFFSYMB52_DATA211_0       (0x1u<<24)
#define JPEG_HUFFSYMB52_DATA210         (0xFFu<<16)
#define JPEG_HUFFSYMB52_DATA210_0       (0x1u<<16)
#define JPEG_HUFFSYMB52_DATA209         (0xFFu<<8)
#define JPEG_HUFFSYMB52_DATA209_0       (0x1u<<8)
#define JPEG_HUFFSYMB52_DATA208         (0xFFu<<0)
#define JPEG_HUFFSYMB52_DATA208_0       (0x1u<<0)

// HUFFSYMB53 Configuration

#define JPEG_HUFFSYMB53_DATA215         (0xFFu<<24)
#define JPEG_HUFFSYMB53_DATA215_0       (0x1u<<24)
#define JPEG_HUFFSYMB53_DATA214         (0xFFu<<16)
#define JPEG_HUFFSYMB53_DATA214_0       (0x1u<<16)
#define JPEG_HUFFSYMB53_DATA213         (0xFFu<<8)
#define JPEG_HUFFSYMB53_DATA213_0       (0x1u<<8)
#define JPEG_HUFFSYMB53_DATA212         (0xFFu<<0)
#define JPEG_HUFFSYMB53_DATA212_0       (0x1u<<0)

// HUFFSYMB54 Configuration

#define JPEG_HUFFSYMB54_DATA219         (0xFFu<<24)
#define JPEG_HUFFSYMB54_DATA219_0       (0x1u<<24)
#define JPEG_HUFFSYMB54_DATA218         (0xFFu<<16)
#define JPEG_HUFFSYMB54_DATA218_0       (0x1u<<16)
#define JPEG_HUFFSYMB54_DATA217         (0xFFu<<8)
#define JPEG_HUFFSYMB54_DATA217_0       (0x1u<<8)
#define JPEG_HUFFSYMB54_DATA216         (0xFFu<<0)
#define JPEG_HUFFSYMB54_DATA216_0       (0x1u<<0)

// HUFFSYMB55 Configuration

#define JPEG_HUFFSYMB55_DATA223         (0xFFu<<24)
#define JPEG_HUFFSYMB55_DATA223_0       (0x1u<<24)
#define JPEG_HUFFSYMB55_DATA222         (0xFFu<<16)
#define JPEG_HUFFSYMB55_DATA222_0       (0x1u<<16)
#define JPEG_HUFFSYMB55_DATA221         (0xFFu<<8)
#define JPEG_HUFFSYMB55_DATA221_0       (0x1u<<8)
#define JPEG_HUFFSYMB55_DATA220         (0xFFu<<0)
#define JPEG_HUFFSYMB55_DATA220_0       (0x1u<<0)

// HUFFSYMB56 Configuration

#define JPEG_HUFFSYMB56_DATA227         (0xFFu<<24)
#define JPEG_HUFFSYMB56_DATA227_0       (0x1u<<24)
#define JPEG_HUFFSYMB56_DATA226         (0xFFu<<16)
#define JPEG_HUFFSYMB56_DATA226_0       (0x1u<<16)
#define JPEG_HUFFSYMB56_DATA225         (0xFFu<<8)
#define JPEG_HUFFSYMB56_DATA225_0       (0x1u<<8)
#define JPEG_HUFFSYMB56_DATA224         (0xFFu<<0)
#define JPEG_HUFFSYMB56_DATA224_0       (0x1u<<0)

// HUFFSYMB57 Configuration

#define JPEG_HUFFSYMB57_DATA231         (0xFFu<<24)
#define JPEG_HUFFSYMB57_DATA231_0       (0x1u<<24)
#define JPEG_HUFFSYMB57_DATA230         (0xFFu<<16)
#define JPEG_HUFFSYMB57_DATA230_0       (0x1u<<16)
#define JPEG_HUFFSYMB57_DATA229         (0xFFu<<8)
#define JPEG_HUFFSYMB57_DATA229_0       (0x1u<<8)
#define JPEG_HUFFSYMB57_DATA228         (0xFFu<<0)
#define JPEG_HUFFSYMB57_DATA228_0       (0x1u<<0)

// HUFFSYMB58 Configuration

#define JPEG_HUFFSYMB58_DATA235         (0xFFu<<24)
#define JPEG_HUFFSYMB58_DATA235_0       (0x1u<<24)
#define JPEG_HUFFSYMB58_DATA234         (0xFFu<<16)
#define JPEG_HUFFSYMB58_DATA234_0       (0x1u<<16)
#define JPEG_HUFFSYMB58_DATA233         (0xFFu<<8)
#define JPEG_HUFFSYMB58_DATA233_0       (0x1u<<8)
#define JPEG_HUFFSYMB58_DATA232         (0xFFu<<0)
#define JPEG_HUFFSYMB58_DATA232_0       (0x1u<<0)

// HUFFSYMB59 Configuration

#define JPEG_HUFFSYMB59_DATA239         (0xFFu<<24)
#define JPEG_HUFFSYMB59_DATA239_0       (0x1u<<24)
#define JPEG_HUFFSYMB59_DATA238         (0xFFu<<16)
#define JPEG_HUFFSYMB59_DATA238_0       (0x1u<<16)
#define JPEG_HUFFSYMB59_DATA237         (0xFFu<<8)
#define JPEG_HUFFSYMB59_DATA237_0       (0x1u<<8)
#define JPEG_HUFFSYMB59_DATA236         (0xFFu<<0)
#define JPEG_HUFFSYMB59_DATA236_0       (0x1u<<0)

// HUFFSYMB60 Configuration

#define JPEG_HUFFSYMB60_DATA243         (0xFFu<<24)
#define JPEG_HUFFSYMB60_DATA243_0       (0x1u<<24)
#define JPEG_HUFFSYMB60_DATA242         (0xFFu<<16)
#define JPEG_HUFFSYMB60_DATA242_0       (0x1u<<16)
#define JPEG_HUFFSYMB60_DATA241         (0xFFu<<8)
#define JPEG_HUFFSYMB60_DATA241_0       (0x1u<<8)
#define JPEG_HUFFSYMB60_DATA240         (0xFFu<<0)
#define JPEG_HUFFSYMB60_DATA240_0       (0x1u<<0)

// HUFFSYMB61 Configuration

#define JPEG_HUFFSYMB61_DATA247         (0xFFu<<24)
#define JPEG_HUFFSYMB61_DATA247_0       (0x1u<<24)
#define JPEG_HUFFSYMB61_DATA246         (0xFFu<<16)
#define JPEG_HUFFSYMB61_DATA246_0       (0x1u<<16)
#define JPEG_HUFFSYMB61_DATA245         (0xFFu<<8)
#define JPEG_HUFFSYMB61_DATA245_0       (0x1u<<8)
#define JPEG_HUFFSYMB61_DATA244         (0xFFu<<0)
#define JPEG_HUFFSYMB61_DATA244_0       (0x1u<<0)

// HUFFSYMB62 Configuration

#define JPEG_HUFFSYMB62_DATA251         (0xFFu<<24)
#define JPEG_HUFFSYMB62_DATA251_0       (0x1u<<24)
#define JPEG_HUFFSYMB62_DATA250         (0xFFu<<16)
#define JPEG_HUFFSYMB62_DATA250_0       (0x1u<<16)
#define JPEG_HUFFSYMB62_DATA249         (0xFFu<<8)
#define JPEG_HUFFSYMB62_DATA249_0       (0x1u<<8)
#define JPEG_HUFFSYMB62_DATA248         (0xFFu<<0)
#define JPEG_HUFFSYMB62_DATA248_0       (0x1u<<0)

// HUFFSYMB63 Configuration

#define JPEG_HUFFSYMB63_DATA255         (0xFFu<<24)
#define JPEG_HUFFSYMB63_DATA255_0       (0x1u<<24)
#define JPEG_HUFFSYMB63_DATA254         (0xFFu<<16)
#define JPEG_HUFFSYMB63_DATA254_0       (0x1u<<16)
#define JPEG_HUFFSYMB63_DATA253         (0xFFu<<8)
#define JPEG_HUFFSYMB63_DATA253_0       (0x1u<<8)
#define JPEG_HUFFSYMB63_DATA252         (0xFFu<<0)
#define JPEG_HUFFSYMB63_DATA252_0       (0x1u<<0)

// HUFFSYMB64 Configuration

#define JPEG_HUFFSYMB64_DATA259         (0xFFu<<24)
#define JPEG_HUFFSYMB64_DATA259_0       (0x1u<<24)
#define JPEG_HUFFSYMB64_DATA258         (0xFFu<<16)
#define JPEG_HUFFSYMB64_DATA258_0       (0x1u<<16)
#define JPEG_HUFFSYMB64_DATA257         (0xFFu<<8)
#define JPEG_HUFFSYMB64_DATA257_0       (0x1u<<8)
#define JPEG_HUFFSYMB64_DATA256         (0xFFu<<0)
#define JPEG_HUFFSYMB64_DATA256_0       (0x1u<<0)

// HUFFSYMB65 Configuration

#define JPEG_HUFFSYMB65_DATA263         (0xFFu<<24)
#define JPEG_HUFFSYMB65_DATA263_0       (0x1u<<24)
#define JPEG_HUFFSYMB65_DATA262         (0xFFu<<16)
#define JPEG_HUFFSYMB65_DATA262_0       (0x1u<<16)
#define JPEG_HUFFSYMB65_DATA261         (0xFFu<<8)
#define JPEG_HUFFSYMB65_DATA261_0       (0x1u<<8)
#define JPEG_HUFFSYMB65_DATA260         (0xFFu<<0)
#define JPEG_HUFFSYMB65_DATA260_0       (0x1u<<0)

