Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_jpeg.h
// HUFFSYMB66 Configuration

#define JPEG_HUFFSYMB66_DATA267         (0xFFu<<24)
#define JPEG_HUFFSYMB66_DATA267_0       (0x1u<<24)
#define JPEG_HUFFSYMB66_DATA266         (0xFFu<<16)
#define JPEG_HUFFSYMB66_DATA266_0       (0x1u<<16)
#define JPEG_HUFFSYMB66_DATA265         (0xFFu<<8)
#define JPEG_HUFFSYMB66_DATA265_0       (0x1u<<8)
#define JPEG_HUFFSYMB66_DATA264         (0xFFu<<0)
#define JPEG_HUFFSYMB66_DATA264_0       (0x1u<<0)

// HUFFSYMB67 Configuration

#define JPEG_HUFFSYMB67_DATA271         (0xFFu<<24)
#define JPEG_HUFFSYMB67_DATA271_0       (0x1u<<24)
#define JPEG_HUFFSYMB67_DATA270         (0xFFu<<16)
#define JPEG_HUFFSYMB67_DATA270_0       (0x1u<<16)
#define JPEG_HUFFSYMB67_DATA269         (0xFFu<<8)
#define JPEG_HUFFSYMB67_DATA269_0       (0x1u<<8)
#define JPEG_HUFFSYMB67_DATA268         (0xFFu<<0)
#define JPEG_HUFFSYMB67_DATA268_0       (0x1u<<0)

// HUFFSYMB68 Configuration

#define JPEG_HUFFSYMB68_DATA275         (0xFFu<<24)
#define JPEG_HUFFSYMB68_DATA275_0       (0x1u<<24)
#define JPEG_HUFFSYMB68_DATA274         (0xFFu<<16)
#define JPEG_HUFFSYMB68_DATA274_0       (0x1u<<16)
#define JPEG_HUFFSYMB68_DATA273         (0xFFu<<8)
#define JPEG_HUFFSYMB68_DATA273_0       (0x1u<<8)
#define JPEG_HUFFSYMB68_DATA272         (0xFFu<<0)
#define JPEG_HUFFSYMB68_DATA272_0       (0x1u<<0)

// HUFFSYMB69 Configuration

#define JPEG_HUFFSYMB69_DATA279         (0xFFu<<24)
#define JPEG_HUFFSYMB69_DATA279_0       (0x1u<<24)
#define JPEG_HUFFSYMB69_DATA278         (0xFFu<<16)
#define JPEG_HUFFSYMB69_DATA278_0       (0x1u<<16)
#define JPEG_HUFFSYMB69_DATA277         (0xFFu<<8)
#define JPEG_HUFFSYMB69_DATA277_0       (0x1u<<8)
#define JPEG_HUFFSYMB69_DATA276         (0xFFu<<0)
#define JPEG_HUFFSYMB69_DATA276_0       (0x1u<<0)

// HUFFSYMB70 Configuration

#define JPEG_HUFFSYMB70_DATA283         (0xFFu<<24)
#define JPEG_HUFFSYMB70_DATA283_0       (0x1u<<24)
#define JPEG_HUFFSYMB70_DATA282         (0xFFu<<16)
#define JPEG_HUFFSYMB70_DATA282_0       (0x1u<<16)
#define JPEG_HUFFSYMB70_DATA281         (0xFFu<<8)
#define JPEG_HUFFSYMB70_DATA281_0       (0x1u<<8)
#define JPEG_HUFFSYMB70_DATA280         (0xFFu<<0)
#define JPEG_HUFFSYMB70_DATA280_0       (0x1u<<0)

// HUFFSYMB71 Configuration

#define JPEG_HUFFSYMB71_DATA287         (0xFFu<<24)
#define JPEG_HUFFSYMB71_DATA287_0       (0x1u<<24)
#define JPEG_HUFFSYMB71_DATA286         (0xFFu<<16)
#define JPEG_HUFFSYMB71_DATA286_0       (0x1u<<16)
#define JPEG_HUFFSYMB71_DATA285         (0xFFu<<8)
#define JPEG_HUFFSYMB71_DATA285_0       (0x1u<<8)
#define JPEG_HUFFSYMB71_DATA284         (0xFFu<<0)
#define JPEG_HUFFSYMB71_DATA284_0       (0x1u<<0)

// HUFFSYMB72 Configuration

#define JPEG_HUFFSYMB72_DATA291         (0xFFu<<24)
#define JPEG_HUFFSYMB72_DATA291_0       (0x1u<<24)
#define JPEG_HUFFSYMB72_DATA290         (0xFFu<<16)
#define JPEG_HUFFSYMB72_DATA290_0       (0x1u<<16)
#define JPEG_HUFFSYMB72_DATA289         (0xFFu<<8)
#define JPEG_HUFFSYMB72_DATA289_0       (0x1u<<8)
#define JPEG_HUFFSYMB72_DATA288         (0xFFu<<0)
#define JPEG_HUFFSYMB72_DATA288_0       (0x1u<<0)

// HUFFSYMB73 Configuration

#define JPEG_HUFFSYMB73_DATA295         (0xFFu<<24)
#define JPEG_HUFFSYMB73_DATA295_0       (0x1u<<24)
#define JPEG_HUFFSYMB73_DATA294         (0xFFu<<16)
#define JPEG_HUFFSYMB73_DATA294_0       (0x1u<<16)
#define JPEG_HUFFSYMB73_DATA293         (0xFFu<<8)
#define JPEG_HUFFSYMB73_DATA293_0       (0x1u<<8)
#define JPEG_HUFFSYMB73_DATA292         (0xFFu<<0)
#define JPEG_HUFFSYMB73_DATA292_0       (0x1u<<0)

// HUFFSYMB74 Configuration

#define JPEG_HUFFSYMB74_DATA299         (0xFFu<<24)
#define JPEG_HUFFSYMB74_DATA299_0       (0x1u<<24)
#define JPEG_HUFFSYMB74_DATA298         (0xFFu<<16)
#define JPEG_HUFFSYMB74_DATA298_0       (0x1u<<16)
#define JPEG_HUFFSYMB74_DATA297         (0xFFu<<8)
#define JPEG_HUFFSYMB74_DATA297_0       (0x1u<<8)
#define JPEG_HUFFSYMB74_DATA296         (0xFFu<<0)
#define JPEG_HUFFSYMB74_DATA296_0       (0x1u<<0)

// HUFFSYMB75 Configuration

#define JPEG_HUFFSYMB75_DATA303         (0xFFu<<24)
#define JPEG_HUFFSYMB75_DATA303_0       (0x1u<<24)
#define JPEG_HUFFSYMB75_DATA302         (0xFFu<<16)
#define JPEG_HUFFSYMB75_DATA302_0       (0x1u<<16)
#define JPEG_HUFFSYMB75_DATA301         (0xFFu<<8)
#define JPEG_HUFFSYMB75_DATA301_0       (0x1u<<8)
#define JPEG_HUFFSYMB75_DATA300         (0xFFu<<0)
#define JPEG_HUFFSYMB75_DATA300_0       (0x1u<<0)

// HUFFSYMB76 Configuration

#define JPEG_HUFFSYMB76_DATA307         (0xFFu<<24)
#define JPEG_HUFFSYMB76_DATA307_0       (0x1u<<24)
#define JPEG_HUFFSYMB76_DATA306         (0xFFu<<16)
#define JPEG_HUFFSYMB76_DATA306_0       (0x1u<<16)
#define JPEG_HUFFSYMB76_DATA305         (0xFFu<<8)
#define JPEG_HUFFSYMB76_DATA305_0       (0x1u<<8)
#define JPEG_HUFFSYMB76_DATA304         (0xFFu<<0)
#define JPEG_HUFFSYMB76_DATA304_0       (0x1u<<0)

// HUFFSYMB77 Configuration

#define JPEG_HUFFSYMB77_DATA311         (0xFFu<<24)
#define JPEG_HUFFSYMB77_DATA311_0       (0x1u<<24)
#define JPEG_HUFFSYMB77_DATA310         (0xFFu<<16)
#define JPEG_HUFFSYMB77_DATA310_0       (0x1u<<16)
#define JPEG_HUFFSYMB77_DATA309         (0xFFu<<8)
#define JPEG_HUFFSYMB77_DATA309_0       (0x1u<<8)
#define JPEG_HUFFSYMB77_DATA308         (0xFFu<<0)
#define JPEG_HUFFSYMB77_DATA308_0       (0x1u<<0)

// HUFFSYMB78 Configuration

#define JPEG_HUFFSYMB78_DATA315         (0xFFu<<24)
#define JPEG_HUFFSYMB78_DATA315_0       (0x1u<<24)
#define JPEG_HUFFSYMB78_DATA314         (0xFFu<<16)
#define JPEG_HUFFSYMB78_DATA314_0       (0x1u<<16)
#define JPEG_HUFFSYMB78_DATA313         (0xFFu<<8)
#define JPEG_HUFFSYMB78_DATA313_0       (0x1u<<8)
#define JPEG_HUFFSYMB78_DATA312         (0xFFu<<0)
#define JPEG_HUFFSYMB78_DATA312_0       (0x1u<<0)

// HUFFSYMB79 Configuration

#define JPEG_HUFFSYMB79_DATA319         (0xFFu<<24)
#define JPEG_HUFFSYMB79_DATA319_0       (0x1u<<24)
#define JPEG_HUFFSYMB79_DATA318         (0xFFu<<16)
#define JPEG_HUFFSYMB79_DATA318_0       (0x1u<<16)
#define JPEG_HUFFSYMB79_DATA317         (0xFFu<<8)
#define JPEG_HUFFSYMB79_DATA317_0       (0x1u<<8)
#define JPEG_HUFFSYMB79_DATA316         (0xFFu<<0)
#define JPEG_HUFFSYMB79_DATA316_0       (0x1u<<0)

// HUFFSYMB80 Configuration

