Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_jpeg.h
#define JPEG_HUFFSYMB80_DATA323         (0xFFu<<24)
#define JPEG_HUFFSYMB80_DATA323_0       (0x1u<<24)
#define JPEG_HUFFSYMB80_DATA322         (0xFFu<<16)
#define JPEG_HUFFSYMB80_DATA322_0       (0x1u<<16)
#define JPEG_HUFFSYMB80_DATA321         (0xFFu<<8)
#define JPEG_HUFFSYMB80_DATA321_0       (0x1u<<8)
#define JPEG_HUFFSYMB80_DATA320         (0xFFu<<0)
#define JPEG_HUFFSYMB80_DATA320_0       (0x1u<<0)

// HUFFSYMB81 Configuration

#define JPEG_HUFFSYMB81_DATA327         (0xFFu<<24)
#define JPEG_HUFFSYMB81_DATA327_0       (0x1u<<24)
#define JPEG_HUFFSYMB81_DATA326         (0xFFu<<16)
#define JPEG_HUFFSYMB81_DATA326_0       (0x1u<<16)
#define JPEG_HUFFSYMB81_DATA325         (0xFFu<<8)
#define JPEG_HUFFSYMB81_DATA325_0       (0x1u<<8)
#define JPEG_HUFFSYMB81_DATA324         (0xFFu<<0)
#define JPEG_HUFFSYMB81_DATA324_0       (0x1u<<0)

// HUFFSYMB82 Configuration

#define JPEG_HUFFSYMB82_DATA331         (0xFFu<<24)
#define JPEG_HUFFSYMB82_DATA331_0       (0x1u<<24)
#define JPEG_HUFFSYMB82_DATA330         (0xFFu<<16)
#define JPEG_HUFFSYMB82_DATA330_0       (0x1u<<16)
#define JPEG_HUFFSYMB82_DATA329         (0xFFu<<8)
#define JPEG_HUFFSYMB82_DATA329_0       (0x1u<<8)
#define JPEG_HUFFSYMB82_DATA328         (0xFFu<<0)
#define JPEG_HUFFSYMB82_DATA328_0       (0x1u<<0)

// HUFFSYMB83 Configuration

#define JPEG_HUFFSYMB83_DATA335         (0xFFu<<24)
#define JPEG_HUFFSYMB83_DATA335_0       (0x1u<<24)
#define JPEG_HUFFSYMB83_DATA334         (0xFFu<<16)
#define JPEG_HUFFSYMB83_DATA334_0       (0x1u<<16)
#define JPEG_HUFFSYMB83_DATA333         (0xFFu<<8)
#define JPEG_HUFFSYMB83_DATA333_0       (0x1u<<8)
#define JPEG_HUFFSYMB83_DATA332         (0xFFu<<0)
#define JPEG_HUFFSYMB83_DATA332_0       (0x1u<<0)

// DHTMEM0 Configuration

#define JPEG_DHTMEM0_DATA3              (0xFFu<<24)
#define JPEG_DHTMEM0_DATA3_0            (0x1u<<24)
#define JPEG_DHTMEM0_DATA2              (0xFFu<<16)
#define JPEG_DHTMEM0_DATA2_0            (0x1u<<16)
#define JPEG_DHTMEM0_DATA1              (0xFFu<<8)
#define JPEG_DHTMEM0_DATA1_0            (0x1u<<8)
#define JPEG_DHTMEM0_DATA0              (0xFFu<<0)
#define JPEG_DHTMEM0_DATA0_0            (0x1u<<0)

// DHTMEM1 Configuration

#define JPEG_DHTMEM1_DATA7              (0xFFu<<24)
#define JPEG_DHTMEM1_DATA7_0            (0x1u<<24)
#define JPEG_DHTMEM1_DATA6              (0xFFu<<16)
#define JPEG_DHTMEM1_DATA6_0            (0x1u<<16)
#define JPEG_DHTMEM1_DATA5              (0xFFu<<8)
#define JPEG_DHTMEM1_DATA5_0            (0x1u<<8)
#define JPEG_DHTMEM1_DATA4              (0xFFu<<0)
#define JPEG_DHTMEM1_DATA4_0            (0x1u<<0)

// DHTMEM2 Configuration

#define JPEG_DHTMEM2_DATA11             (0xFFu<<24)
#define JPEG_DHTMEM2_DATA11_0           (0x1u<<24)
#define JPEG_DHTMEM2_DATA10             (0xFFu<<16)
#define JPEG_DHTMEM2_DATA10_0           (0x1u<<16)
#define JPEG_DHTMEM2_DATA9              (0xFFu<<8)
#define JPEG_DHTMEM2_DATA9_0            (0x1u<<8)
#define JPEG_DHTMEM2_DATA8              (0xFFu<<0)
#define JPEG_DHTMEM2_DATA8_0            (0x1u<<0)

// DHTMEM3 Configuration

#define JPEG_DHTMEM3_DATA15             (0xFFu<<24)
#define JPEG_DHTMEM3_DATA15_0           (0x1u<<24)
#define JPEG_DHTMEM3_DATA14             (0xFFu<<16)
#define JPEG_DHTMEM3_DATA14_0           (0x1u<<16)
#define JPEG_DHTMEM3_DATA13             (0xFFu<<8)
#define JPEG_DHTMEM3_DATA13_0           (0x1u<<8)
#define JPEG_DHTMEM3_DATA12             (0xFFu<<0)
#define JPEG_DHTMEM3_DATA12_0           (0x1u<<0)

// DHTMEM4 Configuration

#define JPEG_DHTMEM4_DATA19             (0xFFu<<24)
#define JPEG_DHTMEM4_DATA19_0           (0x1u<<24)
#define JPEG_DHTMEM4_DATA18             (0xFFu<<16)
#define JPEG_DHTMEM4_DATA18_0           (0x1u<<16)
#define JPEG_DHTMEM4_DATA17             (0xFFu<<8)
#define JPEG_DHTMEM4_DATA17_0           (0x1u<<8)
#define JPEG_DHTMEM4_DATA16             (0xFFu<<0)
#define JPEG_DHTMEM4_DATA16_0           (0x1u<<0)

// DHTMEM5 Configuration

#define JPEG_DHTMEM5_DATA23             (0xFFu<<24)
#define JPEG_DHTMEM5_DATA23_0           (0x1u<<24)
#define JPEG_DHTMEM5_DATA22             (0xFFu<<16)
#define JPEG_DHTMEM5_DATA22_0           (0x1u<<16)
#define JPEG_DHTMEM5_DATA21             (0xFFu<<8)
#define JPEG_DHTMEM5_DATA21_0           (0x1u<<8)
#define JPEG_DHTMEM5_DATA20             (0xFFu<<0)
#define JPEG_DHTMEM5_DATA20_0           (0x1u<<0)

// DHTMEM6 Configuration

#define JPEG_DHTMEM6_DATA27             (0xFFu<<24)
#define JPEG_DHTMEM6_DATA27_0           (0x1u<<24)
#define JPEG_DHTMEM6_DATA26             (0xFFu<<16)
#define JPEG_DHTMEM6_DATA26_0           (0x1u<<16)
#define JPEG_DHTMEM6_DATA25             (0xFFu<<8)
#define JPEG_DHTMEM6_DATA25_0           (0x1u<<8)
#define JPEG_DHTMEM6_DATA24             (0xFFu<<0)
#define JPEG_DHTMEM6_DATA24_0           (0x1u<<0)

// DHTMEM7 Configuration

#define JPEG_DHTMEM7_DATA31             (0xFFu<<24)
#define JPEG_DHTMEM7_DATA31_0           (0x1u<<24)
#define JPEG_DHTMEM7_DATA30             (0xFFu<<16)
#define JPEG_DHTMEM7_DATA30_0           (0x1u<<16)
#define JPEG_DHTMEM7_DATA29             (0xFFu<<8)
#define JPEG_DHTMEM7_DATA29_0           (0x1u<<8)
#define JPEG_DHTMEM7_DATA28             (0xFFu<<0)
#define JPEG_DHTMEM7_DATA28_0           (0x1u<<0)

// DHTMEM8 Configuration

#define JPEG_DHTMEM8_DATA35             (0xFFu<<24)
#define JPEG_DHTMEM8_DATA35_0           (0x1u<<24)
#define JPEG_DHTMEM8_DATA34             (0xFFu<<16)
#define JPEG_DHTMEM8_DATA34_0           (0x1u<<16)
#define JPEG_DHTMEM8_DATA33             (0xFFu<<8)
#define JPEG_DHTMEM8_DATA33_0           (0x1u<<8)
#define JPEG_DHTMEM8_DATA32             (0xFFu<<0)
#define JPEG_DHTMEM8_DATA32_0           (0x1u<<0)

// DHTMEM9 Configuration

#define JPEG_DHTMEM9_DATA39             (0xFFu<<24)
#define JPEG_DHTMEM9_DATA39_0           (0x1u<<24)
#define JPEG_DHTMEM9_DATA38             (0xFFu<<16)
#define JPEG_DHTMEM9_DATA38_0           (0x1u<<16)
#define JPEG_DHTMEM9_DATA37             (0xFFu<<8)
#define JPEG_DHTMEM9_DATA37_0           (0x1u<<8)
#define JPEG_DHTMEM9_DATA36             (0xFFu<<0)
#define JPEG_DHTMEM9_DATA36_0           (0x1u<<0)

