Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_jpeg.h
// DHTMEM10 Configuration

#define JPEG_DHTMEM10_DATA43            (0xFFu<<24)
#define JPEG_DHTMEM10_DATA43_0          (0x1u<<24)
#define JPEG_DHTMEM10_DATA42            (0xFFu<<16)
#define JPEG_DHTMEM10_DATA42_0          (0x1u<<16)
#define JPEG_DHTMEM10_DATA41            (0xFFu<<8)
#define JPEG_DHTMEM10_DATA41_0          (0x1u<<8)
#define JPEG_DHTMEM10_DATA40            (0xFFu<<0)
#define JPEG_DHTMEM10_DATA40_0          (0x1u<<0)

// DHTMEM11 Configuration

#define JPEG_DHTMEM11_DATA47            (0xFFu<<24)
#define JPEG_DHTMEM11_DATA47_0          (0x1u<<24)
#define JPEG_DHTMEM11_DATA46            (0xFFu<<16)
#define JPEG_DHTMEM11_DATA46_0          (0x1u<<16)
#define JPEG_DHTMEM11_DATA45            (0xFFu<<8)
#define JPEG_DHTMEM11_DATA45_0          (0x1u<<8)
#define JPEG_DHTMEM11_DATA44            (0xFFu<<0)
#define JPEG_DHTMEM11_DATA44_0          (0x1u<<0)

// DHTMEM12 Configuration

#define JPEG_DHTMEM12_DATA51            (0xFFu<<24)
#define JPEG_DHTMEM12_DATA51_0          (0x1u<<24)
#define JPEG_DHTMEM12_DATA50            (0xFFu<<16)
#define JPEG_DHTMEM12_DATA50_0          (0x1u<<16)
#define JPEG_DHTMEM12_DATA49            (0xFFu<<8)
#define JPEG_DHTMEM12_DATA49_0          (0x1u<<8)
#define JPEG_DHTMEM12_DATA48            (0xFFu<<0)
#define JPEG_DHTMEM12_DATA48_0          (0x1u<<0)

// DHTMEM13 Configuration

#define JPEG_DHTMEM13_DATA55            (0xFFu<<24)
#define JPEG_DHTMEM13_DATA55_0          (0x1u<<24)
#define JPEG_DHTMEM13_DATA54            (0xFFu<<16)
#define JPEG_DHTMEM13_DATA54_0          (0x1u<<16)
#define JPEG_DHTMEM13_DATA53            (0xFFu<<8)
#define JPEG_DHTMEM13_DATA53_0          (0x1u<<8)
#define JPEG_DHTMEM13_DATA52            (0xFFu<<0)
#define JPEG_DHTMEM13_DATA52_0          (0x1u<<0)

// DHTMEM14 Configuration

#define JPEG_DHTMEM14_DATA59            (0xFFu<<24)
#define JPEG_DHTMEM14_DATA59_0          (0x1u<<24)
#define JPEG_DHTMEM14_DATA58            (0xFFu<<16)
#define JPEG_DHTMEM14_DATA58_0          (0x1u<<16)
#define JPEG_DHTMEM14_DATA57            (0xFFu<<8)
#define JPEG_DHTMEM14_DATA57_0          (0x1u<<8)
#define JPEG_DHTMEM14_DATA56            (0xFFu<<0)
#define JPEG_DHTMEM14_DATA56_0          (0x1u<<0)

// DHTMEM15 Configuration

#define JPEG_DHTMEM15_DATA63            (0xFFu<<24)
#define JPEG_DHTMEM15_DATA63_0          (0x1u<<24)
#define JPEG_DHTMEM15_DATA62            (0xFFu<<16)
#define JPEG_DHTMEM15_DATA62_0          (0x1u<<16)
#define JPEG_DHTMEM15_DATA61            (0xFFu<<8)
#define JPEG_DHTMEM15_DATA61_0          (0x1u<<8)
#define JPEG_DHTMEM15_DATA60            (0xFFu<<0)
#define JPEG_DHTMEM15_DATA60_0          (0x1u<<0)

// DHTMEM16 Configuration

#define JPEG_DHTMEM16_DATA67            (0xFFu<<24)
#define JPEG_DHTMEM16_DATA67_0          (0x1u<<24)
#define JPEG_DHTMEM16_DATA66            (0xFFu<<16)
#define JPEG_DHTMEM16_DATA66_0          (0x1u<<16)
#define JPEG_DHTMEM16_DATA65            (0xFFu<<8)
#define JPEG_DHTMEM16_DATA65_0          (0x1u<<8)
#define JPEG_DHTMEM16_DATA64            (0xFFu<<0)
#define JPEG_DHTMEM16_DATA64_0          (0x1u<<0)

// DHTMEM17 Configuration

#define JPEG_DHTMEM17_DATA71            (0xFFu<<24)
#define JPEG_DHTMEM17_DATA71_0          (0x1u<<24)
#define JPEG_DHTMEM17_DATA70            (0xFFu<<16)
#define JPEG_DHTMEM17_DATA70_0          (0x1u<<16)
#define JPEG_DHTMEM17_DATA69            (0xFFu<<8)
#define JPEG_DHTMEM17_DATA69_0          (0x1u<<8)
#define JPEG_DHTMEM17_DATA68            (0xFFu<<0)
#define JPEG_DHTMEM17_DATA68_0          (0x1u<<0)

// DHTMEM18 Configuration

#define JPEG_DHTMEM18_DATA75            (0xFFu<<24)
#define JPEG_DHTMEM18_DATA75_0          (0x1u<<24)
#define JPEG_DHTMEM18_DATA74            (0xFFu<<16)
#define JPEG_DHTMEM18_DATA74_0          (0x1u<<16)
#define JPEG_DHTMEM18_DATA73            (0xFFu<<8)
#define JPEG_DHTMEM18_DATA73_0          (0x1u<<8)
#define JPEG_DHTMEM18_DATA72            (0xFFu<<0)
#define JPEG_DHTMEM18_DATA72_0          (0x1u<<0)

// DHTMEM19 Configuration

#define JPEG_DHTMEM19_DATA79            (0xFFu<<24)
#define JPEG_DHTMEM19_DATA79_0          (0x1u<<24)
#define JPEG_DHTMEM19_DATA78            (0xFFu<<16)
#define JPEG_DHTMEM19_DATA78_0          (0x1u<<16)
#define JPEG_DHTMEM19_DATA77            (0xFFu<<8)
#define JPEG_DHTMEM19_DATA77_0          (0x1u<<8)
#define JPEG_DHTMEM19_DATA76            (0xFFu<<0)
#define JPEG_DHTMEM19_DATA76_0          (0x1u<<0)

// DHTMEM20 Configuration

#define JPEG_DHTMEM20_DATA83            (0xFFu<<24)
#define JPEG_DHTMEM20_DATA83_0          (0x1u<<24)
#define JPEG_DHTMEM20_DATA82            (0xFFu<<16)
#define JPEG_DHTMEM20_DATA82_0          (0x1u<<16)
#define JPEG_DHTMEM20_DATA81            (0xFFu<<8)
#define JPEG_DHTMEM20_DATA81_0          (0x1u<<8)
#define JPEG_DHTMEM20_DATA80            (0xFFu<<0)
#define JPEG_DHTMEM20_DATA80_0          (0x1u<<0)

// DHTMEM21 Configuration

#define JPEG_DHTMEM21_DATA87            (0xFFu<<24)
#define JPEG_DHTMEM21_DATA87_0          (0x1u<<24)
#define JPEG_DHTMEM21_DATA86            (0xFFu<<16)
#define JPEG_DHTMEM21_DATA86_0          (0x1u<<16)
#define JPEG_DHTMEM21_DATA85            (0xFFu<<8)
#define JPEG_DHTMEM21_DATA85_0          (0x1u<<8)
#define JPEG_DHTMEM21_DATA84            (0xFFu<<0)
#define JPEG_DHTMEM21_DATA84_0          (0x1u<<0)

// DHTMEM22 Configuration

#define JPEG_DHTMEM22_DATA91            (0xFFu<<24)
#define JPEG_DHTMEM22_DATA91_0          (0x1u<<24)
#define JPEG_DHTMEM22_DATA90            (0xFFu<<16)
#define JPEG_DHTMEM22_DATA90_0          (0x1u<<16)
#define JPEG_DHTMEM22_DATA89            (0xFFu<<8)
#define JPEG_DHTMEM22_DATA89_0          (0x1u<<8)
#define JPEG_DHTMEM22_DATA88            (0xFFu<<0)
#define JPEG_DHTMEM22_DATA88_0          (0x1u<<0)

// DHTMEM23 Configuration

#define JPEG_DHTMEM23_DATA95            (0xFFu<<24)
#define JPEG_DHTMEM23_DATA95_0          (0x1u<<24)
#define JPEG_DHTMEM23_DATA94            (0xFFu<<16)
#define JPEG_DHTMEM23_DATA94_0          (0x1u<<16)
#define JPEG_DHTMEM23_DATA93            (0xFFu<<8)
#define JPEG_DHTMEM23_DATA93_0          (0x1u<<8)
#define JPEG_DHTMEM23_DATA92            (0xFFu<<0)
#define JPEG_DHTMEM23_DATA92_0          (0x1u<<0)

// DHTMEM24 Configuration

#define JPEG_DHTMEM24_DATA99            (0xFFu<<24)
#define JPEG_DHTMEM24_DATA99_0          (0x1u<<24)
#define JPEG_DHTMEM24_DATA98            (0xFFu<<16)
#define JPEG_DHTMEM24_DATA98_0          (0x1u<<16)
#define JPEG_DHTMEM24_DATA97            (0xFFu<<8)
#define JPEG_DHTMEM24_DATA97_0          (0x1u<<8)
#define JPEG_DHTMEM24_DATA96            (0xFFu<<0)
#define JPEG_DHTMEM24_DATA96_0          (0x1u<<0)

// DHTMEM25 Configuration

#define JPEG_DHTMEM25_DATA103           (0xFFu<<24)
#define JPEG_DHTMEM25_DATA103_0         (0x1u<<24)
#define JPEG_DHTMEM25_DATA102           (0xFFu<<16)
#define JPEG_DHTMEM25_DATA102_0         (0x1u<<16)
#define JPEG_DHTMEM25_DATA101           (0xFFu<<8)
#define JPEG_DHTMEM25_DATA101_0         (0x1u<<8)
#define JPEG_DHTMEM25_DATA100           (0xFFu<<0)
#define JPEG_DHTMEM25_DATA100_0         (0x1u<<0)

