Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_jpeg.h
// DHTMEM26 Configuration

#define JPEG_DHTMEM26_DATA107           (0xFFu<<24)
#define JPEG_DHTMEM26_DATA107_0         (0x1u<<24)
#define JPEG_DHTMEM26_DATA106           (0xFFu<<16)
#define JPEG_DHTMEM26_DATA106_0         (0x1u<<16)
#define JPEG_DHTMEM26_DATA105           (0xFFu<<8)
#define JPEG_DHTMEM26_DATA105_0         (0x1u<<8)
#define JPEG_DHTMEM26_DATA104           (0xFFu<<0)
#define JPEG_DHTMEM26_DATA104_0         (0x1u<<0)

// DHTMEM27 Configuration

#define JPEG_DHTMEM27_DATA111           (0xFFu<<24)
#define JPEG_DHTMEM27_DATA111_0         (0x1u<<24)
#define JPEG_DHTMEM27_DATA110           (0xFFu<<16)
#define JPEG_DHTMEM27_DATA110_0         (0x1u<<16)
#define JPEG_DHTMEM27_DATA109           (0xFFu<<8)
#define JPEG_DHTMEM27_DATA109_0         (0x1u<<8)
#define JPEG_DHTMEM27_DATA108           (0xFFu<<0)
#define JPEG_DHTMEM27_DATA108_0         (0x1u<<0)

// DHTMEM28 Configuration

#define JPEG_DHTMEM28_DATA115           (0xFFu<<24)
#define JPEG_DHTMEM28_DATA115_0         (0x1u<<24)
#define JPEG_DHTMEM28_DATA114           (0xFFu<<16)
#define JPEG_DHTMEM28_DATA114_0         (0x1u<<16)
#define JPEG_DHTMEM28_DATA113           (0xFFu<<8)
#define JPEG_DHTMEM28_DATA113_0         (0x1u<<8)
#define JPEG_DHTMEM28_DATA112           (0xFFu<<0)
#define JPEG_DHTMEM28_DATA112_0         (0x1u<<0)

// DHTMEM29 Configuration

#define JPEG_DHTMEM29_DATA119           (0xFFu<<24)
#define JPEG_DHTMEM29_DATA119_0         (0x1u<<24)
#define JPEG_DHTMEM29_DATA118           (0xFFu<<16)
#define JPEG_DHTMEM29_DATA118_0         (0x1u<<16)
#define JPEG_DHTMEM29_DATA117           (0xFFu<<8)
#define JPEG_DHTMEM29_DATA117_0         (0x1u<<8)
#define JPEG_DHTMEM29_DATA116           (0xFFu<<0)
#define JPEG_DHTMEM29_DATA116_0         (0x1u<<0)

// DHTMEM30 Configuration

#define JPEG_DHTMEM30_DATA123           (0xFFu<<24)
#define JPEG_DHTMEM30_DATA123_0         (0x1u<<24)
#define JPEG_DHTMEM30_DATA122           (0xFFu<<16)
#define JPEG_DHTMEM30_DATA122_0         (0x1u<<16)
#define JPEG_DHTMEM30_DATA121           (0xFFu<<8)
#define JPEG_DHTMEM30_DATA121_0         (0x1u<<8)
#define JPEG_DHTMEM30_DATA120           (0xFFu<<0)
#define JPEG_DHTMEM30_DATA120_0         (0x1u<<0)

// DHTMEM31 Configuration

#define JPEG_DHTMEM31_DATA127           (0xFFu<<24)
#define JPEG_DHTMEM31_DATA127_0         (0x1u<<24)
#define JPEG_DHTMEM31_DATA126           (0xFFu<<16)
#define JPEG_DHTMEM31_DATA126_0         (0x1u<<16)
#define JPEG_DHTMEM31_DATA125           (0xFFu<<8)
#define JPEG_DHTMEM31_DATA125_0         (0x1u<<8)
#define JPEG_DHTMEM31_DATA124           (0xFFu<<0)
#define JPEG_DHTMEM31_DATA124_0         (0x1u<<0)

// DHTMEM32 Configuration

#define JPEG_DHTMEM32_DATA131           (0xFFu<<24)
#define JPEG_DHTMEM32_DATA131_0         (0x1u<<24)
#define JPEG_DHTMEM32_DATA130           (0xFFu<<16)
#define JPEG_DHTMEM32_DATA130_0         (0x1u<<16)
#define JPEG_DHTMEM32_DATA129           (0xFFu<<8)
#define JPEG_DHTMEM32_DATA129_0         (0x1u<<8)
#define JPEG_DHTMEM32_DATA128           (0xFFu<<0)
#define JPEG_DHTMEM32_DATA128_0         (0x1u<<0)

// DHTMEM33 Configuration

#define JPEG_DHTMEM33_DATA135           (0xFFu<<24)
#define JPEG_DHTMEM33_DATA135_0         (0x1u<<24)
#define JPEG_DHTMEM33_DATA134           (0xFFu<<16)
#define JPEG_DHTMEM33_DATA134_0         (0x1u<<16)
#define JPEG_DHTMEM33_DATA133           (0xFFu<<8)
#define JPEG_DHTMEM33_DATA133_0         (0x1u<<8)
#define JPEG_DHTMEM33_DATA132           (0xFFu<<0)
#define JPEG_DHTMEM33_DATA132_0         (0x1u<<0)

// DHTMEM34 Configuration

#define JPEG_DHTMEM34_DATA139           (0xFFu<<24)
#define JPEG_DHTMEM34_DATA139_0         (0x1u<<24)
#define JPEG_DHTMEM34_DATA138           (0xFFu<<16)
#define JPEG_DHTMEM34_DATA138_0         (0x1u<<16)
#define JPEG_DHTMEM34_DATA137           (0xFFu<<8)
#define JPEG_DHTMEM34_DATA137_0         (0x1u<<8)
#define JPEG_DHTMEM34_DATA136           (0xFFu<<0)
#define JPEG_DHTMEM34_DATA136_0         (0x1u<<0)

// DHTMEM35 Configuration

#define JPEG_DHTMEM35_DATA143           (0xFFu<<24)
#define JPEG_DHTMEM35_DATA143_0         (0x1u<<24)
#define JPEG_DHTMEM35_DATA142           (0xFFu<<16)
#define JPEG_DHTMEM35_DATA142_0         (0x1u<<16)
#define JPEG_DHTMEM35_DATA141           (0xFFu<<8)
#define JPEG_DHTMEM35_DATA141_0         (0x1u<<8)
#define JPEG_DHTMEM35_DATA140           (0xFFu<<0)
#define JPEG_DHTMEM35_DATA140_0         (0x1u<<0)

// DHTMEM36 Configuration

#define JPEG_DHTMEM36_DATA147           (0xFFu<<24)
#define JPEG_DHTMEM36_DATA147_0         (0x1u<<24)
#define JPEG_DHTMEM36_DATA146           (0xFFu<<16)
#define JPEG_DHTMEM36_DATA146_0         (0x1u<<16)
#define JPEG_DHTMEM36_DATA145           (0xFFu<<8)
#define JPEG_DHTMEM36_DATA145_0         (0x1u<<8)
#define JPEG_DHTMEM36_DATA144           (0xFFu<<0)
#define JPEG_DHTMEM36_DATA144_0         (0x1u<<0)

// DHTMEM37 Configuration

#define JPEG_DHTMEM37_DATA151           (0xFFu<<24)
#define JPEG_DHTMEM37_DATA151_0         (0x1u<<24)
#define JPEG_DHTMEM37_DATA150           (0xFFu<<16)
#define JPEG_DHTMEM37_DATA150_0         (0x1u<<16)
#define JPEG_DHTMEM37_DATA149           (0xFFu<<8)
#define JPEG_DHTMEM37_DATA149_0         (0x1u<<8)
#define JPEG_DHTMEM37_DATA148           (0xFFu<<0)
#define JPEG_DHTMEM37_DATA148_0         (0x1u<<0)

// DHTMEM38 Configuration

#define JPEG_DHTMEM38_DATA155           (0xFFu<<24)
#define JPEG_DHTMEM38_DATA155_0         (0x1u<<24)
#define JPEG_DHTMEM38_DATA154           (0xFFu<<16)
#define JPEG_DHTMEM38_DATA154_0         (0x1u<<16)
#define JPEG_DHTMEM38_DATA153           (0xFFu<<8)
#define JPEG_DHTMEM38_DATA153_0         (0x1u<<8)
#define JPEG_DHTMEM38_DATA152           (0xFFu<<0)
#define JPEG_DHTMEM38_DATA152_0         (0x1u<<0)

// DHTMEM39 Configuration

#define JPEG_DHTMEM39_DATA159           (0xFFu<<24)
#define JPEG_DHTMEM39_DATA159_0         (0x1u<<24)
#define JPEG_DHTMEM39_DATA158           (0xFFu<<16)
#define JPEG_DHTMEM39_DATA158_0         (0x1u<<16)
#define JPEG_DHTMEM39_DATA157           (0xFFu<<8)
#define JPEG_DHTMEM39_DATA157_0         (0x1u<<8)
#define JPEG_DHTMEM39_DATA156           (0xFFu<<0)
#define JPEG_DHTMEM39_DATA156_0         (0x1u<<0)

// DHTMEM40 Configuration

#define JPEG_DHTMEM40_DATA163           (0xFFu<<24)
#define JPEG_DHTMEM40_DATA163_0         (0x1u<<24)
#define JPEG_DHTMEM40_DATA162           (0xFFu<<16)
#define JPEG_DHTMEM40_DATA162_0         (0x1u<<16)
#define JPEG_DHTMEM40_DATA161           (0xFFu<<8)
#define JPEG_DHTMEM40_DATA161_0         (0x1u<<8)
#define JPEG_DHTMEM40_DATA160           (0xFFu<<0)
#define JPEG_DHTMEM40_DATA160_0         (0x1u<<0)

// DHTMEM41 Configuration

#define JPEG_DHTMEM41_DATA167           (0xFFu<<24)
#define JPEG_DHTMEM41_DATA167_0         (0x1u<<24)
#define JPEG_DHTMEM41_DATA166           (0xFFu<<16)
#define JPEG_DHTMEM41_DATA166_0         (0x1u<<16)
#define JPEG_DHTMEM41_DATA165           (0xFFu<<8)
#define JPEG_DHTMEM41_DATA165_0         (0x1u<<8)
#define JPEG_DHTMEM41_DATA164           (0xFFu<<0)
#define JPEG_DHTMEM41_DATA164_0         (0x1u<<0)

// DHTMEM42 Configuration

#define JPEG_DHTMEM42_DATA171           (0xFFu<<24)
#define JPEG_DHTMEM42_DATA171_0         (0x1u<<24)
#define JPEG_DHTMEM42_DATA170           (0xFFu<<16)
#define JPEG_DHTMEM42_DATA170_0         (0x1u<<16)
#define JPEG_DHTMEM42_DATA169           (0xFFu<<8)
#define JPEG_DHTMEM42_DATA169_0         (0x1u<<8)
#define JPEG_DHTMEM42_DATA168           (0xFFu<<0)
#define JPEG_DHTMEM42_DATA168_0         (0x1u<<0)

// DHTMEM43 Configuration

#define JPEG_DHTMEM43_DATA175           (0xFFu<<24)
#define JPEG_DHTMEM43_DATA175_0         (0x1u<<24)
#define JPEG_DHTMEM43_DATA174           (0xFFu<<16)
#define JPEG_DHTMEM43_DATA174_0         (0x1u<<16)
#define JPEG_DHTMEM43_DATA173           (0xFFu<<8)
#define JPEG_DHTMEM43_DATA173_0         (0x1u<<8)
#define JPEG_DHTMEM43_DATA172           (0xFFu<<0)
#define JPEG_DHTMEM43_DATA172_0         (0x1u<<0)

// DHTMEM44 Configuration

#define JPEG_DHTMEM44_DATA179           (0xFFu<<24)
#define JPEG_DHTMEM44_DATA179_0         (0x1u<<24)
#define JPEG_DHTMEM44_DATA178           (0xFFu<<16)
#define JPEG_DHTMEM44_DATA178_0         (0x1u<<16)
#define JPEG_DHTMEM44_DATA177           (0xFFu<<8)
#define JPEG_DHTMEM44_DATA177_0         (0x1u<<8)
#define JPEG_DHTMEM44_DATA176           (0xFFu<<0)
#define JPEG_DHTMEM44_DATA176_0         (0x1u<<0)

// DHTMEM45 Configuration

#define JPEG_DHTMEM45_DATA183           (0xFFu<<24)
#define JPEG_DHTMEM45_DATA183_0         (0x1u<<24)
#define JPEG_DHTMEM45_DATA182           (0xFFu<<16)
#define JPEG_DHTMEM45_DATA182_0         (0x1u<<16)
#define JPEG_DHTMEM45_DATA181           (0xFFu<<8)
#define JPEG_DHTMEM45_DATA181_0         (0x1u<<8)
#define JPEG_DHTMEM45_DATA180           (0xFFu<<0)
#define JPEG_DHTMEM45_DATA180_0         (0x1u<<0)

