Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_jpeg.h
// DHTMEM46 Configuration

#define JPEG_DHTMEM46_DATA187           (0xFFu<<24)
#define JPEG_DHTMEM46_DATA187_0         (0x1u<<24)
#define JPEG_DHTMEM46_DATA186           (0xFFu<<16)
#define JPEG_DHTMEM46_DATA186_0         (0x1u<<16)
#define JPEG_DHTMEM46_DATA185           (0xFFu<<8)
#define JPEG_DHTMEM46_DATA185_0         (0x1u<<8)
#define JPEG_DHTMEM46_DATA184           (0xFFu<<0)
#define JPEG_DHTMEM46_DATA184_0         (0x1u<<0)

// DHTMEM47 Configuration

#define JPEG_DHTMEM47_DATA191           (0xFFu<<24)
#define JPEG_DHTMEM47_DATA191_0         (0x1u<<24)
#define JPEG_DHTMEM47_DATA190           (0xFFu<<16)
#define JPEG_DHTMEM47_DATA190_0         (0x1u<<16)
#define JPEG_DHTMEM47_DATA189           (0xFFu<<8)
#define JPEG_DHTMEM47_DATA189_0         (0x1u<<8)
#define JPEG_DHTMEM47_DATA188           (0xFFu<<0)
#define JPEG_DHTMEM47_DATA188_0         (0x1u<<0)

// DHTMEM48 Configuration

#define JPEG_DHTMEM48_DATA195           (0xFFu<<24)
#define JPEG_DHTMEM48_DATA195_0         (0x1u<<24)
#define JPEG_DHTMEM48_DATA194           (0xFFu<<16)
#define JPEG_DHTMEM48_DATA194_0         (0x1u<<16)
#define JPEG_DHTMEM48_DATA193           (0xFFu<<8)
#define JPEG_DHTMEM48_DATA193_0         (0x1u<<8)
#define JPEG_DHTMEM48_DATA192           (0xFFu<<0)
#define JPEG_DHTMEM48_DATA192_0         (0x1u<<0)

// DHTMEM49 Configuration

#define JPEG_DHTMEM49_DATA199           (0xFFu<<24)
#define JPEG_DHTMEM49_DATA199_0         (0x1u<<24)
#define JPEG_DHTMEM49_DATA198           (0xFFu<<16)
#define JPEG_DHTMEM49_DATA198_0         (0x1u<<16)
#define JPEG_DHTMEM49_DATA197           (0xFFu<<8)
#define JPEG_DHTMEM49_DATA197_0         (0x1u<<8)
#define JPEG_DHTMEM49_DATA196           (0xFFu<<0)
#define JPEG_DHTMEM49_DATA196_0         (0x1u<<0)

// DHTMEM50 Configuration

#define JPEG_DHTMEM50_DATA203           (0xFFu<<24)
#define JPEG_DHTMEM50_DATA203_0         (0x1u<<24)
#define JPEG_DHTMEM50_DATA202           (0xFFu<<16)
#define JPEG_DHTMEM50_DATA202_0         (0x1u<<16)
#define JPEG_DHTMEM50_DATA201           (0xFFu<<8)
#define JPEG_DHTMEM50_DATA201_0         (0x1u<<8)
#define JPEG_DHTMEM50_DATA200           (0xFFu<<0)
#define JPEG_DHTMEM50_DATA200_0         (0x1u<<0)

// DHTMEM51 Configuration

#define JPEG_DHTMEM51_DATA207           (0xFFu<<24)
#define JPEG_DHTMEM51_DATA207_0         (0x1u<<24)
#define JPEG_DHTMEM51_DATA206           (0xFFu<<16)
#define JPEG_DHTMEM51_DATA206_0         (0x1u<<16)
#define JPEG_DHTMEM51_DATA205           (0xFFu<<8)
#define JPEG_DHTMEM51_DATA205_0         (0x1u<<8)
#define JPEG_DHTMEM51_DATA204           (0xFFu<<0)
#define JPEG_DHTMEM51_DATA204_0         (0x1u<<0)

// DHTMEM52 Configuration

#define JPEG_DHTMEM52_DATA211           (0xFFu<<24)
#define JPEG_DHTMEM52_DATA211_0         (0x1u<<24)
#define JPEG_DHTMEM52_DATA210           (0xFFu<<16)
#define JPEG_DHTMEM52_DATA210_0         (0x1u<<16)
#define JPEG_DHTMEM52_DATA209           (0xFFu<<8)
#define JPEG_DHTMEM52_DATA209_0         (0x1u<<8)
#define JPEG_DHTMEM52_DATA208           (0xFFu<<0)
#define JPEG_DHTMEM52_DATA208_0         (0x1u<<0)

// DHTMEM53 Configuration

#define JPEG_DHTMEM53_DATA215           (0xFFu<<24)
#define JPEG_DHTMEM53_DATA215_0         (0x1u<<24)
#define JPEG_DHTMEM53_DATA214           (0xFFu<<16)
#define JPEG_DHTMEM53_DATA214_0         (0x1u<<16)
#define JPEG_DHTMEM53_DATA213           (0xFFu<<8)
#define JPEG_DHTMEM53_DATA213_0         (0x1u<<8)
#define JPEG_DHTMEM53_DATA212           (0xFFu<<0)
#define JPEG_DHTMEM53_DATA212_0         (0x1u<<0)

// DHTMEM54 Configuration

#define JPEG_DHTMEM54_DATA219           (0xFFu<<24)
#define JPEG_DHTMEM54_DATA219_0         (0x1u<<24)
#define JPEG_DHTMEM54_DATA218           (0xFFu<<16)
#define JPEG_DHTMEM54_DATA218_0         (0x1u<<16)
#define JPEG_DHTMEM54_DATA217           (0xFFu<<8)
#define JPEG_DHTMEM54_DATA217_0         (0x1u<<8)
#define JPEG_DHTMEM54_DATA216           (0xFFu<<0)
#define JPEG_DHTMEM54_DATA216_0         (0x1u<<0)

// DHTMEM55 Configuration

#define JPEG_DHTMEM55_DATA223           (0xFFu<<24)
#define JPEG_DHTMEM55_DATA223_0         (0x1u<<24)
#define JPEG_DHTMEM55_DATA222           (0xFFu<<16)
#define JPEG_DHTMEM55_DATA222_0         (0x1u<<16)
#define JPEG_DHTMEM55_DATA221           (0xFFu<<8)
#define JPEG_DHTMEM55_DATA221_0         (0x1u<<8)
#define JPEG_DHTMEM55_DATA220           (0xFFu<<0)
#define JPEG_DHTMEM55_DATA220_0         (0x1u<<0)

// DHTMEM56 Configuration

#define JPEG_DHTMEM56_DATA227           (0xFFu<<24)
#define JPEG_DHTMEM56_DATA227_0         (0x1u<<24)
#define JPEG_DHTMEM56_DATA226           (0xFFu<<16)
#define JPEG_DHTMEM56_DATA226_0         (0x1u<<16)
#define JPEG_DHTMEM56_DATA225           (0xFFu<<8)
#define JPEG_DHTMEM56_DATA225_0         (0x1u<<8)
#define JPEG_DHTMEM56_DATA224           (0xFFu<<0)
#define JPEG_DHTMEM56_DATA224_0         (0x1u<<0)

// DHTMEM57 Configuration

#define JPEG_DHTMEM57_DATA231           (0xFFu<<24)
#define JPEG_DHTMEM57_DATA231_0         (0x1u<<24)
#define JPEG_DHTMEM57_DATA230           (0xFFu<<16)
#define JPEG_DHTMEM57_DATA230_0         (0x1u<<16)
#define JPEG_DHTMEM57_DATA229           (0xFFu<<8)
#define JPEG_DHTMEM57_DATA229_0         (0x1u<<8)
#define JPEG_DHTMEM57_DATA228           (0xFFu<<0)
#define JPEG_DHTMEM57_DATA228_0         (0x1u<<0)

// DHTMEM58 Configuration

#define JPEG_DHTMEM58_DATA235           (0xFFu<<24)
#define JPEG_DHTMEM58_DATA235_0         (0x1u<<24)
#define JPEG_DHTMEM58_DATA234           (0xFFu<<16)
#define JPEG_DHTMEM58_DATA234_0         (0x1u<<16)
#define JPEG_DHTMEM58_DATA233           (0xFFu<<8)
#define JPEG_DHTMEM58_DATA233_0         (0x1u<<8)
#define JPEG_DHTMEM58_DATA232           (0xFFu<<0)
#define JPEG_DHTMEM58_DATA232_0         (0x1u<<0)

// DHTMEM59 Configuration

#define JPEG_DHTMEM59_DATA239           (0xFFu<<24)
#define JPEG_DHTMEM59_DATA239_0         (0x1u<<24)
#define JPEG_DHTMEM59_DATA238           (0xFFu<<16)
#define JPEG_DHTMEM59_DATA238_0         (0x1u<<16)
#define JPEG_DHTMEM59_DATA237           (0xFFu<<8)
#define JPEG_DHTMEM59_DATA237_0         (0x1u<<8)
#define JPEG_DHTMEM59_DATA236           (0xFFu<<0)
#define JPEG_DHTMEM59_DATA236_0         (0x1u<<0)

// DHTMEM60 Configuration

