Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_jpeg.h
#define JPEG_DHTMEM60_DATA243           (0xFFu<<24)
#define JPEG_DHTMEM60_DATA243_0         (0x1u<<24)
#define JPEG_DHTMEM60_DATA242           (0xFFu<<16)
#define JPEG_DHTMEM60_DATA242_0         (0x1u<<16)
#define JPEG_DHTMEM60_DATA241           (0xFFu<<8)
#define JPEG_DHTMEM60_DATA241_0         (0x1u<<8)
#define JPEG_DHTMEM60_DATA240           (0xFFu<<0)
#define JPEG_DHTMEM60_DATA240_0         (0x1u<<0)

// DHTMEM61 Configuration

#define JPEG_DHTMEM61_DATA247           (0xFFu<<24)
#define JPEG_DHTMEM61_DATA247_0         (0x1u<<24)
#define JPEG_DHTMEM61_DATA246           (0xFFu<<16)
#define JPEG_DHTMEM61_DATA246_0         (0x1u<<16)
#define JPEG_DHTMEM61_DATA245           (0xFFu<<8)
#define JPEG_DHTMEM61_DATA245_0         (0x1u<<8)
#define JPEG_DHTMEM61_DATA244           (0xFFu<<0)
#define JPEG_DHTMEM61_DATA244_0         (0x1u<<0)

// DHTMEM62 Configuration

#define JPEG_DHTMEM62_DATA251           (0xFFu<<24)
#define JPEG_DHTMEM62_DATA251_0         (0x1u<<24)
#define JPEG_DHTMEM62_DATA250           (0xFFu<<16)
#define JPEG_DHTMEM62_DATA250_0         (0x1u<<16)
#define JPEG_DHTMEM62_DATA249           (0xFFu<<8)
#define JPEG_DHTMEM62_DATA249_0         (0x1u<<8)
#define JPEG_DHTMEM62_DATA248           (0xFFu<<0)
#define JPEG_DHTMEM62_DATA248_0         (0x1u<<0)

// DHTMEM63 Configuration

#define JPEG_DHTMEM63_DATA255           (0xFFu<<24)
#define JPEG_DHTMEM63_DATA255_0         (0x1u<<24)
#define JPEG_DHTMEM63_DATA254           (0xFFu<<16)
#define JPEG_DHTMEM63_DATA254_0         (0x1u<<16)
#define JPEG_DHTMEM63_DATA253           (0xFFu<<8)
#define JPEG_DHTMEM63_DATA253_0         (0x1u<<8)
#define JPEG_DHTMEM63_DATA252           (0xFFu<<0)
#define JPEG_DHTMEM63_DATA252_0         (0x1u<<0)

// DHTMEM64 Configuration

#define JPEG_DHTMEM64_DATA259           (0xFFu<<24)
#define JPEG_DHTMEM64_DATA259_0         (0x1u<<24)
#define JPEG_DHTMEM64_DATA258           (0xFFu<<16)
#define JPEG_DHTMEM64_DATA258_0         (0x1u<<16)
#define JPEG_DHTMEM64_DATA257           (0xFFu<<8)
#define JPEG_DHTMEM64_DATA257_0         (0x1u<<8)
#define JPEG_DHTMEM64_DATA256           (0xFFu<<0)
#define JPEG_DHTMEM64_DATA256_0         (0x1u<<0)

// DHTMEM65 Configuration

#define JPEG_DHTMEM65_DATA263           (0xFFu<<24)
#define JPEG_DHTMEM65_DATA263_0         (0x1u<<24)
#define JPEG_DHTMEM65_DATA262           (0xFFu<<16)
#define JPEG_DHTMEM65_DATA262_0         (0x1u<<16)
#define JPEG_DHTMEM65_DATA261           (0xFFu<<8)
#define JPEG_DHTMEM65_DATA261_0         (0x1u<<8)
#define JPEG_DHTMEM65_DATA260           (0xFFu<<0)
#define JPEG_DHTMEM65_DATA260_0         (0x1u<<0)

// DHTMEM66 Configuration

#define JPEG_DHTMEM66_DATA267           (0xFFu<<24)
#define JPEG_DHTMEM66_DATA267_0         (0x1u<<24)
#define JPEG_DHTMEM66_DATA266           (0xFFu<<16)
#define JPEG_DHTMEM66_DATA266_0         (0x1u<<16)
#define JPEG_DHTMEM66_DATA265           (0xFFu<<8)
#define JPEG_DHTMEM66_DATA265_0         (0x1u<<8)
#define JPEG_DHTMEM66_DATA264           (0xFFu<<0)
#define JPEG_DHTMEM66_DATA264_0         (0x1u<<0)

// DHTMEM67 Configuration

#define JPEG_DHTMEM67_DATA271           (0xFFu<<24)
#define JPEG_DHTMEM67_DATA271_0         (0x1u<<24)
#define JPEG_DHTMEM67_DATA270           (0xFFu<<16)
#define JPEG_DHTMEM67_DATA270_0         (0x1u<<16)
#define JPEG_DHTMEM67_DATA269           (0xFFu<<8)
#define JPEG_DHTMEM67_DATA269_0         (0x1u<<8)
#define JPEG_DHTMEM67_DATA268           (0xFFu<<0)
#define JPEG_DHTMEM67_DATA268_0         (0x1u<<0)

// DHTMEM68 Configuration

#define JPEG_DHTMEM68_DATA275           (0xFFu<<24)
#define JPEG_DHTMEM68_DATA275_0         (0x1u<<24)
#define JPEG_DHTMEM68_DATA274           (0xFFu<<16)
#define JPEG_DHTMEM68_DATA274_0         (0x1u<<16)
#define JPEG_DHTMEM68_DATA273           (0xFFu<<8)
#define JPEG_DHTMEM68_DATA273_0         (0x1u<<8)
#define JPEG_DHTMEM68_DATA272           (0xFFu<<0)
#define JPEG_DHTMEM68_DATA272_0         (0x1u<<0)

// DHTMEM69 Configuration

#define JPEG_DHTMEM69_DATA279           (0xFFu<<24)
#define JPEG_DHTMEM69_DATA279_0         (0x1u<<24)
#define JPEG_DHTMEM69_DATA278           (0xFFu<<16)
#define JPEG_DHTMEM69_DATA278_0         (0x1u<<16)
#define JPEG_DHTMEM69_DATA277           (0xFFu<<8)
#define JPEG_DHTMEM69_DATA277_0         (0x1u<<8)
#define JPEG_DHTMEM69_DATA276           (0xFFu<<0)
#define JPEG_DHTMEM69_DATA276_0         (0x1u<<0)

// DHTMEM70 Configuration

#define JPEG_DHTMEM70_DATA283           (0xFFu<<24)
#define JPEG_DHTMEM70_DATA283_0         (0x1u<<24)
#define JPEG_DHTMEM70_DATA282           (0xFFu<<16)
#define JPEG_DHTMEM70_DATA282_0         (0x1u<<16)
#define JPEG_DHTMEM70_DATA281           (0xFFu<<8)
#define JPEG_DHTMEM70_DATA281_0         (0x1u<<8)
#define JPEG_DHTMEM70_DATA280           (0xFFu<<0)
#define JPEG_DHTMEM70_DATA280_0         (0x1u<<0)

// DHTMEM71 Configuration

#define JPEG_DHTMEM71_DATA287           (0xFFu<<24)
#define JPEG_DHTMEM71_DATA287_0         (0x1u<<24)
#define JPEG_DHTMEM71_DATA286           (0xFFu<<16)
#define JPEG_DHTMEM71_DATA286_0         (0x1u<<16)
#define JPEG_DHTMEM71_DATA285           (0xFFu<<8)
#define JPEG_DHTMEM71_DATA285_0         (0x1u<<8)
#define JPEG_DHTMEM71_DATA284           (0xFFu<<0)
#define JPEG_DHTMEM71_DATA284_0         (0x1u<<0)

// DHTMEM72 Configuration

#define JPEG_DHTMEM72_DATA291           (0xFFu<<24)
#define JPEG_DHTMEM72_DATA291_0         (0x1u<<24)
#define JPEG_DHTMEM72_DATA290           (0xFFu<<16)
#define JPEG_DHTMEM72_DATA290_0         (0x1u<<16)
#define JPEG_DHTMEM72_DATA289           (0xFFu<<8)
#define JPEG_DHTMEM72_DATA289_0         (0x1u<<8)
#define JPEG_DHTMEM72_DATA288           (0xFFu<<0)
#define JPEG_DHTMEM72_DATA288_0         (0x1u<<0)

// DHTMEM73 Configuration

#define JPEG_DHTMEM73_DATA295           (0xFFu<<24)
#define JPEG_DHTMEM73_DATA295_0         (0x1u<<24)
#define JPEG_DHTMEM73_DATA294           (0xFFu<<16)
#define JPEG_DHTMEM73_DATA294_0         (0x1u<<16)
#define JPEG_DHTMEM73_DATA293           (0xFFu<<8)
#define JPEG_DHTMEM73_DATA293_0         (0x1u<<8)
#define JPEG_DHTMEM73_DATA292           (0xFFu<<0)
#define JPEG_DHTMEM73_DATA292_0         (0x1u<<0)

// DHTMEM74 Configuration

#define JPEG_DHTMEM74_DATA299           (0xFFu<<24)
#define JPEG_DHTMEM74_DATA299_0         (0x1u<<24)
#define JPEG_DHTMEM74_DATA298           (0xFFu<<16)
#define JPEG_DHTMEM74_DATA298_0         (0x1u<<16)
#define JPEG_DHTMEM74_DATA297           (0xFFu<<8)
#define JPEG_DHTMEM74_DATA297_0         (0x1u<<8)
#define JPEG_DHTMEM74_DATA296           (0xFFu<<0)
#define JPEG_DHTMEM74_DATA296_0         (0x1u<<0)

// DHTMEM75 Configuration

#define JPEG_DHTMEM75_DATA303           (0xFFu<<24)
#define JPEG_DHTMEM75_DATA303_0         (0x1u<<24)
#define JPEG_DHTMEM75_DATA302           (0xFFu<<16)
#define JPEG_DHTMEM75_DATA302_0         (0x1u<<16)
#define JPEG_DHTMEM75_DATA301           (0xFFu<<8)
#define JPEG_DHTMEM75_DATA301_0         (0x1u<<8)
#define JPEG_DHTMEM75_DATA300           (0xFFu<<0)
#define JPEG_DHTMEM75_DATA300_0         (0x1u<<0)

// DHTMEM76 Configuration

#define JPEG_DHTMEM76_DATA307           (0xFFu<<24)
#define JPEG_DHTMEM76_DATA307_0         (0x1u<<24)
#define JPEG_DHTMEM76_DATA306           (0xFFu<<16)
#define JPEG_DHTMEM76_DATA306_0         (0x1u<<16)
#define JPEG_DHTMEM76_DATA305           (0xFFu<<8)
#define JPEG_DHTMEM76_DATA305_0         (0x1u<<8)
#define JPEG_DHTMEM76_DATA304           (0xFFu<<0)
#define JPEG_DHTMEM76_DATA304_0         (0x1u<<0)

// DHTMEM77 Configuration

#define JPEG_DHTMEM77_DATA311           (0xFFu<<24)
#define JPEG_DHTMEM77_DATA311_0         (0x1u<<24)
#define JPEG_DHTMEM77_DATA310           (0xFFu<<16)
#define JPEG_DHTMEM77_DATA310_0         (0x1u<<16)
#define JPEG_DHTMEM77_DATA309           (0xFFu<<8)
#define JPEG_DHTMEM77_DATA309_0         (0x1u<<8)
#define JPEG_DHTMEM77_DATA308           (0xFFu<<0)
#define JPEG_DHTMEM77_DATA308_0         (0x1u<<0)

// DHTMEM78 Configuration

#define JPEG_DHTMEM78_DATA315           (0xFFu<<24)
#define JPEG_DHTMEM78_DATA315_0         (0x1u<<24)
#define JPEG_DHTMEM78_DATA314           (0xFFu<<16)
#define JPEG_DHTMEM78_DATA314_0         (0x1u<<16)
#define JPEG_DHTMEM78_DATA313           (0xFFu<<8)
#define JPEG_DHTMEM78_DATA313_0         (0x1u<<8)
#define JPEG_DHTMEM78_DATA312           (0xFFu<<0)
#define JPEG_DHTMEM78_DATA312_0         (0x1u<<0)

// DHTMEM79 Configuration

#define JPEG_DHTMEM79_DATA319           (0xFFu<<24)
#define JPEG_DHTMEM79_DATA319_0         (0x1u<<24)
#define JPEG_DHTMEM79_DATA318           (0xFFu<<16)
#define JPEG_DHTMEM79_DATA318_0         (0x1u<<16)
#define JPEG_DHTMEM79_DATA317           (0xFFu<<8)
#define JPEG_DHTMEM79_DATA317_0         (0x1u<<8)
#define JPEG_DHTMEM79_DATA316           (0xFFu<<0)
#define JPEG_DHTMEM79_DATA316_0         (0x1u<<0)

// DHTMEM80 Configuration

#define JPEG_DHTMEM80_DATA323           (0xFFu<<24)
#define JPEG_DHTMEM80_DATA323_0         (0x1u<<24)
#define JPEG_DHTMEM80_DATA322           (0xFFu<<16)
#define JPEG_DHTMEM80_DATA322_0         (0x1u<<16)
#define JPEG_DHTMEM80_DATA321           (0xFFu<<8)
#define JPEG_DHTMEM80_DATA321_0         (0x1u<<8)
#define JPEG_DHTMEM80_DATA320           (0xFFu<<0)
#define JPEG_DHTMEM80_DATA320_0         (0x1u<<0)

// DHTMEM81 Configuration

#define JPEG_DHTMEM81_DATA327           (0xFFu<<24)
#define JPEG_DHTMEM81_DATA327_0         (0x1u<<24)
#define JPEG_DHTMEM81_DATA326           (0xFFu<<16)
#define JPEG_DHTMEM81_DATA326_0         (0x1u<<16)
#define JPEG_DHTMEM81_DATA325           (0xFFu<<8)
#define JPEG_DHTMEM81_DATA325_0         (0x1u<<8)
#define JPEG_DHTMEM81_DATA324           (0xFFu<<0)
#define JPEG_DHTMEM81_DATA324_0         (0x1u<<0)

// DHTMEM82 Configuration

#define JPEG_DHTMEM82_DATA331           (0xFFu<<24)
#define JPEG_DHTMEM82_DATA331_0         (0x1u<<24)
#define JPEG_DHTMEM82_DATA330           (0xFFu<<16)
#define JPEG_DHTMEM82_DATA330_0         (0x1u<<16)
#define JPEG_DHTMEM82_DATA329           (0xFFu<<8)
#define JPEG_DHTMEM82_DATA329_0         (0x1u<<8)
#define JPEG_DHTMEM82_DATA328           (0xFFu<<0)
#define JPEG_DHTMEM82_DATA328_0         (0x1u<<0)

// DHTMEM83 Configuration

#define JPEG_DHTMEM83_DATA335           (0xFFu<<24)
#define JPEG_DHTMEM83_DATA335_0         (0x1u<<24)
#define JPEG_DHTMEM83_DATA334           (0xFFu<<16)
#define JPEG_DHTMEM83_DATA334_0         (0x1u<<16)
#define JPEG_DHTMEM83_DATA333           (0xFFu<<8)
#define JPEG_DHTMEM83_DATA333_0         (0x1u<<8)
#define JPEG_DHTMEM83_DATA332           (0xFFu<<0)
#define JPEG_DHTMEM83_DATA332_0         (0x1u<<0)

// DHTMEM84 Configuration

#define JPEG_DHTMEM84_DATA339           (0xFFu<<24)
#define JPEG_DHTMEM84_DATA339_0         (0x1u<<24)
#define JPEG_DHTMEM84_DATA338           (0xFFu<<16)
#define JPEG_DHTMEM84_DATA338_0         (0x1u<<16)
#define JPEG_DHTMEM84_DATA337           (0xFFu<<8)
#define JPEG_DHTMEM84_DATA337_0         (0x1u<<8)
#define JPEG_DHTMEM84_DATA336           (0xFFu<<0)
#define JPEG_DHTMEM84_DATA336_0         (0x1u<<0)

// DHTMEM85 Configuration

