Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_jpeg.h
#define JPEG_DHTMEM85_DATA343           (0xFFu<<24)
#define JPEG_DHTMEM85_DATA343_0         (0x1u<<24)
#define JPEG_DHTMEM85_DATA342           (0xFFu<<16)
#define JPEG_DHTMEM85_DATA342_0         (0x1u<<16)
#define JPEG_DHTMEM85_DATA341           (0xFFu<<8)
#define JPEG_DHTMEM85_DATA341_0         (0x1u<<8)
#define JPEG_DHTMEM85_DATA340           (0xFFu<<0)
#define JPEG_DHTMEM85_DATA340_0         (0x1u<<0)

// DHTMEM86 Configuration

#define JPEG_DHTMEM86_DATA347           (0xFFu<<24)
#define JPEG_DHTMEM86_DATA347_0         (0x1u<<24)
#define JPEG_DHTMEM86_DATA346           (0xFFu<<16)
#define JPEG_DHTMEM86_DATA346_0         (0x1u<<16)
#define JPEG_DHTMEM86_DATA345           (0xFFu<<8)
#define JPEG_DHTMEM86_DATA345_0         (0x1u<<8)
#define JPEG_DHTMEM86_DATA344           (0xFFu<<0)
#define JPEG_DHTMEM86_DATA344_0         (0x1u<<0)

// DHTMEM87 Configuration

#define JPEG_DHTMEM87_DATA351           (0xFFu<<24)
#define JPEG_DHTMEM87_DATA351_0         (0x1u<<24)
#define JPEG_DHTMEM87_DATA350           (0xFFu<<16)
#define JPEG_DHTMEM87_DATA350_0         (0x1u<<16)
#define JPEG_DHTMEM87_DATA349           (0xFFu<<8)
#define JPEG_DHTMEM87_DATA349_0         (0x1u<<8)
#define JPEG_DHTMEM87_DATA348           (0xFFu<<0)
#define JPEG_DHTMEM87_DATA348_0         (0x1u<<0)

// DHTMEM88 Configuration

#define JPEG_DHTMEM88_DATA355           (0xFFu<<24)
#define JPEG_DHTMEM88_DATA355_0         (0x1u<<24)
#define JPEG_DHTMEM88_DATA354           (0xFFu<<16)
#define JPEG_DHTMEM88_DATA354_0         (0x1u<<16)
#define JPEG_DHTMEM88_DATA353           (0xFFu<<8)
#define JPEG_DHTMEM88_DATA353_0         (0x1u<<8)
#define JPEG_DHTMEM88_DATA352           (0xFFu<<0)
#define JPEG_DHTMEM88_DATA352_0         (0x1u<<0)

// DHTMEM89 Configuration

#define JPEG_DHTMEM89_DATA359           (0xFFu<<24)
#define JPEG_DHTMEM89_DATA359_0         (0x1u<<24)
#define JPEG_DHTMEM89_DATA358           (0xFFu<<16)
#define JPEG_DHTMEM89_DATA358_0         (0x1u<<16)
#define JPEG_DHTMEM89_DATA357           (0xFFu<<8)
#define JPEG_DHTMEM89_DATA357_0         (0x1u<<8)
#define JPEG_DHTMEM89_DATA356           (0xFFu<<0)
#define JPEG_DHTMEM89_DATA356_0         (0x1u<<0)

// DHTMEM90 Configuration

#define JPEG_DHTMEM90_DATA363           (0xFFu<<24)
#define JPEG_DHTMEM90_DATA363_0         (0x1u<<24)
#define JPEG_DHTMEM90_DATA362           (0xFFu<<16)
#define JPEG_DHTMEM90_DATA362_0         (0x1u<<16)
#define JPEG_DHTMEM90_DATA361           (0xFFu<<8)
#define JPEG_DHTMEM90_DATA361_0         (0x1u<<8)
#define JPEG_DHTMEM90_DATA360           (0xFFu<<0)
#define JPEG_DHTMEM90_DATA360_0         (0x1u<<0)

// DHTMEM91 Configuration

#define JPEG_DHTMEM91_DATA367           (0xFFu<<24)
#define JPEG_DHTMEM91_DATA367_0         (0x1u<<24)
#define JPEG_DHTMEM91_DATA366           (0xFFu<<16)
#define JPEG_DHTMEM91_DATA366_0         (0x1u<<16)
#define JPEG_DHTMEM91_DATA365           (0xFFu<<8)
#define JPEG_DHTMEM91_DATA365_0         (0x1u<<8)
#define JPEG_DHTMEM91_DATA364           (0xFFu<<0)
#define JPEG_DHTMEM91_DATA364_0         (0x1u<<0)

// DHTMEM92 Configuration

#define JPEG_DHTMEM92_DATA371           (0xFFu<<24)
#define JPEG_DHTMEM92_DATA371_0         (0x1u<<24)
#define JPEG_DHTMEM92_DATA370           (0xFFu<<16)
#define JPEG_DHTMEM92_DATA370_0         (0x1u<<16)
#define JPEG_DHTMEM92_DATA369           (0xFFu<<8)
#define JPEG_DHTMEM92_DATA369_0         (0x1u<<8)
#define JPEG_DHTMEM92_DATA368           (0xFFu<<0)
#define JPEG_DHTMEM92_DATA368_0         (0x1u<<0)

// DHTMEM93 Configuration

#define JPEG_DHTMEM93_DATA375           (0xFFu<<24)
#define JPEG_DHTMEM93_DATA375_0         (0x1u<<24)
#define JPEG_DHTMEM93_DATA374           (0xFFu<<16)
#define JPEG_DHTMEM93_DATA374_0         (0x1u<<16)
#define JPEG_DHTMEM93_DATA373           (0xFFu<<8)
#define JPEG_DHTMEM93_DATA373_0         (0x1u<<8)
#define JPEG_DHTMEM93_DATA372           (0xFFu<<0)
#define JPEG_DHTMEM93_DATA372_0         (0x1u<<0)

// DHTMEM94 Configuration

#define JPEG_DHTMEM94_DATA379           (0xFFu<<24)
#define JPEG_DHTMEM94_DATA379_0         (0x1u<<24)
#define JPEG_DHTMEM94_DATA378           (0xFFu<<16)
#define JPEG_DHTMEM94_DATA378_0         (0x1u<<16)
#define JPEG_DHTMEM94_DATA377           (0xFFu<<8)
#define JPEG_DHTMEM94_DATA377_0         (0x1u<<8)
#define JPEG_DHTMEM94_DATA376           (0xFFu<<0)
#define JPEG_DHTMEM94_DATA376_0         (0x1u<<0)

// DHTMEM95 Configuration

#define JPEG_DHTMEM95_DATA383           (0xFFu<<24)
#define JPEG_DHTMEM95_DATA383_0         (0x1u<<24)
#define JPEG_DHTMEM95_DATA382           (0xFFu<<16)
#define JPEG_DHTMEM95_DATA382_0         (0x1u<<16)
#define JPEG_DHTMEM95_DATA381           (0xFFu<<8)
#define JPEG_DHTMEM95_DATA381_0         (0x1u<<8)
#define JPEG_DHTMEM95_DATA380           (0xFFu<<0)
#define JPEG_DHTMEM95_DATA380_0         (0x1u<<0)

// DHTMEM96 Configuration

#define JPEG_DHTMEM96_DATA387           (0xFFu<<24)
#define JPEG_DHTMEM96_DATA387_0         (0x1u<<24)
#define JPEG_DHTMEM96_DATA386           (0xFFu<<16)
#define JPEG_DHTMEM96_DATA386_0         (0x1u<<16)
#define JPEG_DHTMEM96_DATA385           (0xFFu<<8)
#define JPEG_DHTMEM96_DATA385_0         (0x1u<<8)
#define JPEG_DHTMEM96_DATA384           (0xFFu<<0)
#define JPEG_DHTMEM96_DATA384_0         (0x1u<<0)

// DHTMEM97 Configuration

#define JPEG_DHTMEM97_DATA391           (0xFFu<<24)
#define JPEG_DHTMEM97_DATA391_0         (0x1u<<24)
#define JPEG_DHTMEM97_DATA390           (0xFFu<<16)
#define JPEG_DHTMEM97_DATA390_0         (0x1u<<16)
#define JPEG_DHTMEM97_DATA389           (0xFFu<<8)
#define JPEG_DHTMEM97_DATA389_0         (0x1u<<8)
#define JPEG_DHTMEM97_DATA388           (0xFFu<<0)
#define JPEG_DHTMEM97_DATA388_0         (0x1u<<0)

// DHTMEM98 Configuration

#define JPEG_DHTMEM98_DATA395           (0xFFu<<24)
#define JPEG_DHTMEM98_DATA395_0         (0x1u<<24)
#define JPEG_DHTMEM98_DATA394           (0xFFu<<16)
#define JPEG_DHTMEM98_DATA394_0         (0x1u<<16)
#define JPEG_DHTMEM98_DATA393           (0xFFu<<8)
#define JPEG_DHTMEM98_DATA393_0         (0x1u<<8)
#define JPEG_DHTMEM98_DATA392           (0xFFu<<0)
#define JPEG_DHTMEM98_DATA392_0         (0x1u<<0)

