Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_jpeg.h
// DHTMEM99 Configuration

#define JPEG_DHTMEM99_DATA399           (0xFFu<<24)
#define JPEG_DHTMEM99_DATA399_0         (0x1u<<24)
#define JPEG_DHTMEM99_DATA398           (0xFFu<<16)
#define JPEG_DHTMEM99_DATA398_0         (0x1u<<16)
#define JPEG_DHTMEM99_DATA397           (0xFFu<<8)
#define JPEG_DHTMEM99_DATA397_0         (0x1u<<8)
#define JPEG_DHTMEM99_DATA396           (0xFFu<<0)
#define JPEG_DHTMEM99_DATA396_0         (0x1u<<0)

// DHTMEM100 Configuration

#define JPEG_DHTMEM100_DATA403          (0xFFu<<24)
#define JPEG_DHTMEM100_DATA403_0        (0x1u<<24)
#define JPEG_DHTMEM100_DATA402          (0xFFu<<16)
#define JPEG_DHTMEM100_DATA402_0        (0x1u<<16)
#define JPEG_DHTMEM100_DATA401          (0xFFu<<8)
#define JPEG_DHTMEM100_DATA401_0        (0x1u<<8)
#define JPEG_DHTMEM100_DATA400          (0xFFu<<0)
#define JPEG_DHTMEM100_DATA400_0        (0x1u<<0)

// DHTMEM101 Configuration

#define JPEG_DHTMEM101_DATA407          (0xFFu<<24)
#define JPEG_DHTMEM101_DATA407_0        (0x1u<<24)
#define JPEG_DHTMEM101_DATA406          (0xFFu<<16)
#define JPEG_DHTMEM101_DATA406_0        (0x1u<<16)
#define JPEG_DHTMEM101_DATA405          (0xFFu<<8)
#define JPEG_DHTMEM101_DATA405_0        (0x1u<<8)
#define JPEG_DHTMEM101_DATA404          (0xFFu<<0)
#define JPEG_DHTMEM101_DATA404_0        (0x1u<<0)

// DHTMEM102 Configuration

#define JPEG_DHTMEM102_DATA411          (0xFFu<<24)
#define JPEG_DHTMEM102_DATA411_0        (0x1u<<24)
#define JPEG_DHTMEM102_DATA410          (0xFFu<<16)
#define JPEG_DHTMEM102_DATA410_0        (0x1u<<16)
#define JPEG_DHTMEM102_DATA409          (0xFFu<<8)
#define JPEG_DHTMEM102_DATA409_0        (0x1u<<8)
#define JPEG_DHTMEM102_DATA408          (0xFFu<<0)
#define JPEG_DHTMEM102_DATA408_0        (0x1u<<0)

// HUFFENC_AC0_0 Configuration

#define JPEG_HUFFENC_AC0_0_HLEN1        (0xFu<<24)
#define JPEG_HUFFENC_AC0_0_HLEN1_0      (0x1u<<24)
#define JPEG_HUFFENC_AC0_0_HCODE1       (0xFFu<<16)
#define JPEG_HUFFENC_AC0_0_HCODE1_0     (0x1u<<16)
#define JPEG_HUFFENC_AC0_0_HLEN0        (0xFu<<8)
#define JPEG_HUFFENC_AC0_0_HLEN0_0      (0x1u<<8)
#define JPEG_HUFFENC_AC0_0_HCODE0       (0xFFu<<0)
#define JPEG_HUFFENC_AC0_0_HCODE0_0     (0x1u<<0)

// HUFFENC_AC0_1 Configuration

#define JPEG_HUFFENC_AC0_1_HLEN3        (0xFu<<24)
#define JPEG_HUFFENC_AC0_1_HLEN3_0      (0x1u<<24)
#define JPEG_HUFFENC_AC0_1_HCODE3       (0xFFu<<16)
#define JPEG_HUFFENC_AC0_1_HCODE3_0     (0x1u<<16)
#define JPEG_HUFFENC_AC0_1_HLEN2        (0xFu<<8)
#define JPEG_HUFFENC_AC0_1_HLEN2_0      (0x1u<<8)
#define JPEG_HUFFENC_AC0_1_HCODE2       (0xFFu<<0)
#define JPEG_HUFFENC_AC0_1_HCODE2_0     (0x1u<<0)

// HUFFENC_AC0_2 Configuration

#define JPEG_HUFFENC_AC0_2_HLEN5        (0xFu<<24)
#define JPEG_HUFFENC_AC0_2_HLEN5_0      (0x1u<<24)
#define JPEG_HUFFENC_AC0_2_HCODE5       (0xFFu<<16)
#define JPEG_HUFFENC_AC0_2_HCODE5_0     (0x1u<<16)
#define JPEG_HUFFENC_AC0_2_HLEN4        (0xFu<<8)
#define JPEG_HUFFENC_AC0_2_HLEN4_0      (0x1u<<8)
#define JPEG_HUFFENC_AC0_2_HCODE4       (0xFFu<<0)
#define JPEG_HUFFENC_AC0_2_HCODE4_0     (0x1u<<0)

// HUFFENC_AC0_3 Configuration

#define JPEG_HUFFENC_AC0_3_HLEN7        (0xFu<<24)
#define JPEG_HUFFENC_AC0_3_HLEN7_0      (0x1u<<24)
#define JPEG_HUFFENC_AC0_3_HCODE7       (0xFFu<<16)
#define JPEG_HUFFENC_AC0_3_HCODE7_0     (0x1u<<16)
#define JPEG_HUFFENC_AC0_3_HLEN6        (0xFu<<8)
#define JPEG_HUFFENC_AC0_3_HLEN6_0      (0x1u<<8)
#define JPEG_HUFFENC_AC0_3_HCODE6       (0xFFu<<0)
#define JPEG_HUFFENC_AC0_3_HCODE6_0     (0x1u<<0)

// HUFFENC_AC0_4 Configuration

#define JPEG_HUFFENC_AC0_4_HLEN9        (0xFu<<24)
#define JPEG_HUFFENC_AC0_4_HLEN9_0      (0x1u<<24)
#define JPEG_HUFFENC_AC0_4_HCODE9       (0xFFu<<16)
#define JPEG_HUFFENC_AC0_4_HCODE9_0     (0x1u<<16)
#define JPEG_HUFFENC_AC0_4_HLEN8        (0xFu<<8)
#define JPEG_HUFFENC_AC0_4_HLEN8_0      (0x1u<<8)
#define JPEG_HUFFENC_AC0_4_HCODE8       (0xFFu<<0)
#define JPEG_HUFFENC_AC0_4_HCODE8_0     (0x1u<<0)

// HUFFENC_AC0_5 Configuration

#define JPEG_HUFFENC_AC0_5_HLEN11       (0xFu<<24)
#define JPEG_HUFFENC_AC0_5_HLEN11_0     (0x1u<<24)
#define JPEG_HUFFENC_AC0_5_HCODE11      (0xFFu<<16)
#define JPEG_HUFFENC_AC0_5_HCODE11_0    (0x1u<<16)
#define JPEG_HUFFENC_AC0_5_HLEN10       (0xFu<<8)
#define JPEG_HUFFENC_AC0_5_HLEN10_0     (0x1u<<8)
#define JPEG_HUFFENC_AC0_5_HCODE10      (0xFFu<<0)
#define JPEG_HUFFENC_AC0_5_HCODE10_0    (0x1u<<0)

// HUFFENC_AC0_6 Configuration

#define JPEG_HUFFENC_AC0_6_HLEN13       (0xFu<<24)
#define JPEG_HUFFENC_AC0_6_HLEN13_0     (0x1u<<24)
#define JPEG_HUFFENC_AC0_6_HCODE13      (0xFFu<<16)
#define JPEG_HUFFENC_AC0_6_HCODE13_0    (0x1u<<16)
#define JPEG_HUFFENC_AC0_6_HLEN12       (0xFu<<8)
#define JPEG_HUFFENC_AC0_6_HLEN12_0     (0x1u<<8)
#define JPEG_HUFFENC_AC0_6_HCODE12      (0xFFu<<0)
#define JPEG_HUFFENC_AC0_6_HCODE12_0    (0x1u<<0)

// HUFFENC_AC0_7 Configuration

#define JPEG_HUFFENC_AC0_7_HLEN15       (0xFu<<24)
#define JPEG_HUFFENC_AC0_7_HLEN15_0     (0x1u<<24)
#define JPEG_HUFFENC_AC0_7_HCODE15      (0xFFu<<16)
#define JPEG_HUFFENC_AC0_7_HCODE15_0    (0x1u<<16)
#define JPEG_HUFFENC_AC0_7_HLEN14       (0xFu<<8)
#define JPEG_HUFFENC_AC0_7_HLEN14_0     (0x1u<<8)
#define JPEG_HUFFENC_AC0_7_HCODE14      (0xFFu<<0)
#define JPEG_HUFFENC_AC0_7_HCODE14_0    (0x1u<<0)

// HUFFENC_AC0_8 Configuration

#define JPEG_HUFFENC_AC0_8_HLEN17       (0xFu<<24)
#define JPEG_HUFFENC_AC0_8_HLEN17_0     (0x1u<<24)
#define JPEG_HUFFENC_AC0_8_HCODE17      (0xFFu<<16)
#define JPEG_HUFFENC_AC0_8_HCODE17_0    (0x1u<<16)
#define JPEG_HUFFENC_AC0_8_HLEN16       (0xFu<<8)
#define JPEG_HUFFENC_AC0_8_HLEN16_0     (0x1u<<8)
#define JPEG_HUFFENC_AC0_8_HCODE16      (0xFFu<<0)
#define JPEG_HUFFENC_AC0_8_HCODE16_0    (0x1u<<0)

// HUFFENC_AC0_9 Configuration

#define JPEG_HUFFENC_AC0_9_HLEN19       (0xFu<<24)
#define JPEG_HUFFENC_AC0_9_HLEN19_0     (0x1u<<24)
#define JPEG_HUFFENC_AC0_9_HCODE19      (0xFFu<<16)
#define JPEG_HUFFENC_AC0_9_HCODE19_0    (0x1u<<16)
#define JPEG_HUFFENC_AC0_9_HLEN18       (0xFu<<8)
#define JPEG_HUFFENC_AC0_9_HLEN18_0     (0x1u<<8)
#define JPEG_HUFFENC_AC0_9_HCODE18      (0xFFu<<0)
#define JPEG_HUFFENC_AC0_9_HCODE18_0    (0x1u<<0)

// HUFFENC_AC0_10 Configuration

