Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_jpeg.h
#define JPEG_HUFFENC_AC0_10_HLEN21      (0xFu<<24)
#define JPEG_HUFFENC_AC0_10_HLEN21_0    (0x1u<<24)
#define JPEG_HUFFENC_AC0_10_HCODE21     (0xFFu<<16)
#define JPEG_HUFFENC_AC0_10_HCODE21_0   (0x1u<<16)
#define JPEG_HUFFENC_AC0_10_HLEN20      (0xFu<<8)
#define JPEG_HUFFENC_AC0_10_HLEN20_0    (0x1u<<8)
#define JPEG_HUFFENC_AC0_10_HCODE20     (0xFFu<<0)
#define JPEG_HUFFENC_AC0_10_HCODE20_0   (0x1u<<0)

// HUFFENC_AC0_11 Configuration

#define JPEG_HUFFENC_AC0_11_HLEN23      (0xFu<<24)
#define JPEG_HUFFENC_AC0_11_HLEN23_0    (0x1u<<24)
#define JPEG_HUFFENC_AC0_11_HCODE23     (0xFFu<<16)
#define JPEG_HUFFENC_AC0_11_HCODE23_0   (0x1u<<16)
#define JPEG_HUFFENC_AC0_11_HLEN22      (0xFu<<8)
#define JPEG_HUFFENC_AC0_11_HLEN22_0    (0x1u<<8)
#define JPEG_HUFFENC_AC0_11_HCODE22     (0xFFu<<0)
#define JPEG_HUFFENC_AC0_11_HCODE22_0   (0x1u<<0)

// HUFFENC_AC0_12 Configuration

#define JPEG_HUFFENC_AC0_12_HLEN25      (0xFu<<24)
#define JPEG_HUFFENC_AC0_12_HLEN25_0    (0x1u<<24)
#define JPEG_HUFFENC_AC0_12_HCODE25     (0xFFu<<16)
#define JPEG_HUFFENC_AC0_12_HCODE25_0   (0x1u<<16)
#define JPEG_HUFFENC_AC0_12_HLEN24      (0xFu<<8)
#define JPEG_HUFFENC_AC0_12_HLEN24_0    (0x1u<<8)
#define JPEG_HUFFENC_AC0_12_HCODE24     (0xFFu<<0)
#define JPEG_HUFFENC_AC0_12_HCODE24_0   (0x1u<<0)

// HUFFENC_AC0_13 Configuration

#define JPEG_HUFFENC_AC0_13_HLEN27      (0xFu<<24)
#define JPEG_HUFFENC_AC0_13_HLEN27_0    (0x1u<<24)
#define JPEG_HUFFENC_AC0_13_HCODE27     (0xFFu<<16)
#define JPEG_HUFFENC_AC0_13_HCODE27_0   (0x1u<<16)
#define JPEG_HUFFENC_AC0_13_HLEN26      (0xFu<<8)
#define JPEG_HUFFENC_AC0_13_HLEN26_0    (0x1u<<8)
#define JPEG_HUFFENC_AC0_13_HCODE26     (0xFFu<<0)
#define JPEG_HUFFENC_AC0_13_HCODE26_0   (0x1u<<0)

// HUFFENC_AC0_14 Configuration

#define JPEG_HUFFENC_AC0_14_HLEN29      (0xFu<<24)
#define JPEG_HUFFENC_AC0_14_HLEN29_0    (0x1u<<24)
#define JPEG_HUFFENC_AC0_14_HCODE29     (0xFFu<<16)
#define JPEG_HUFFENC_AC0_14_HCODE29_0   (0x1u<<16)
#define JPEG_HUFFENC_AC0_14_HLEN28      (0xFu<<8)
#define JPEG_HUFFENC_AC0_14_HLEN28_0    (0x1u<<8)
#define JPEG_HUFFENC_AC0_14_HCODE28     (0xFFu<<0)
#define JPEG_HUFFENC_AC0_14_HCODE28_0   (0x1u<<0)

// HUFFENC_AC0_15 Configuration

#define JPEG_HUFFENC_AC0_15_HLEN31      (0xFu<<24)
#define JPEG_HUFFENC_AC0_15_HLEN31_0    (0x1u<<24)
#define JPEG_HUFFENC_AC0_15_HCODE31     (0xFFu<<16)
#define JPEG_HUFFENC_AC0_15_HCODE31_0   (0x1u<<16)
#define JPEG_HUFFENC_AC0_15_HLEN30      (0xFu<<8)
#define JPEG_HUFFENC_AC0_15_HLEN30_0    (0x1u<<8)
#define JPEG_HUFFENC_AC0_15_HCODE30     (0xFFu<<0)
#define JPEG_HUFFENC_AC0_15_HCODE30_0   (0x1u<<0)

// HUFFENC_AC0_16 Configuration

#define JPEG_HUFFENC_AC0_16_HLEN33      (0xFu<<24)
#define JPEG_HUFFENC_AC0_16_HLEN33_0    (0x1u<<24)
#define JPEG_HUFFENC_AC0_16_HCODE33     (0xFFu<<16)
#define JPEG_HUFFENC_AC0_16_HCODE33_0   (0x1u<<16)
#define JPEG_HUFFENC_AC0_16_HLEN32      (0xFu<<8)
#define JPEG_HUFFENC_AC0_16_HLEN32_0    (0x1u<<8)
#define JPEG_HUFFENC_AC0_16_HCODE32     (0xFFu<<0)
#define JPEG_HUFFENC_AC0_16_HCODE32_0   (0x1u<<0)

// HUFFENC_AC0_17 Configuration

#define JPEG_HUFFENC_AC0_17_HLEN35      (0xFu<<24)
#define JPEG_HUFFENC_AC0_17_HLEN35_0    (0x1u<<24)
#define JPEG_HUFFENC_AC0_17_HCODE35     (0xFFu<<16)
#define JPEG_HUFFENC_AC0_17_HCODE35_0   (0x1u<<16)
#define JPEG_HUFFENC_AC0_17_HLEN34      (0xFu<<8)
#define JPEG_HUFFENC_AC0_17_HLEN34_0    (0x1u<<8)
#define JPEG_HUFFENC_AC0_17_HCODE34     (0xFFu<<0)
#define JPEG_HUFFENC_AC0_17_HCODE34_0   (0x1u<<0)

// HUFFENC_AC0_18 Configuration

#define JPEG_HUFFENC_AC0_18_HLEN37      (0xFu<<24)
#define JPEG_HUFFENC_AC0_18_HLEN37_0    (0x1u<<24)
#define JPEG_HUFFENC_AC0_18_HCODE37     (0xFFu<<16)
#define JPEG_HUFFENC_AC0_18_HCODE37_0   (0x1u<<16)
#define JPEG_HUFFENC_AC0_18_HLEN36      (0xFu<<8)
#define JPEG_HUFFENC_AC0_18_HLEN36_0    (0x1u<<8)
#define JPEG_HUFFENC_AC0_18_HCODE36     (0xFFu<<0)
#define JPEG_HUFFENC_AC0_18_HCODE36_0   (0x1u<<0)

// HUFFENC_AC0_19 Configuration

#define JPEG_HUFFENC_AC0_19_HLEN39      (0xFu<<24)
#define JPEG_HUFFENC_AC0_19_HLEN39_0    (0x1u<<24)
#define JPEG_HUFFENC_AC0_19_HCODE39     (0xFFu<<16)
#define JPEG_HUFFENC_AC0_19_HCODE39_0   (0x1u<<16)
#define JPEG_HUFFENC_AC0_19_HLEN38      (0xFu<<8)
#define JPEG_HUFFENC_AC0_19_HLEN38_0    (0x1u<<8)
#define JPEG_HUFFENC_AC0_19_HCODE38     (0xFFu<<0)
#define JPEG_HUFFENC_AC0_19_HCODE38_0   (0x1u<<0)

// HUFFENC_AC0_20 Configuration

#define JPEG_HUFFENC_AC0_20_HLEN41      (0xFu<<24)
#define JPEG_HUFFENC_AC0_20_HLEN41_0    (0x1u<<24)
#define JPEG_HUFFENC_AC0_20_HCODE41     (0xFFu<<16)
#define JPEG_HUFFENC_AC0_20_HCODE41_0   (0x1u<<16)
#define JPEG_HUFFENC_AC0_20_HLEN40      (0xFu<<8)
#define JPEG_HUFFENC_AC0_20_HLEN40_0    (0x1u<<8)
#define JPEG_HUFFENC_AC0_20_HCODE40     (0xFFu<<0)
#define JPEG_HUFFENC_AC0_20_HCODE40_0   (0x1u<<0)

// HUFFENC_AC0_21 Configuration

#define JPEG_HUFFENC_AC0_21_HLEN43      (0xFu<<24)
#define JPEG_HUFFENC_AC0_21_HLEN43_0    (0x1u<<24)
#define JPEG_HUFFENC_AC0_21_HCODE43     (0xFFu<<16)
#define JPEG_HUFFENC_AC0_21_HCODE43_0   (0x1u<<16)
#define JPEG_HUFFENC_AC0_21_HLEN42      (0xFu<<8)
#define JPEG_HUFFENC_AC0_21_HLEN42_0    (0x1u<<8)
#define JPEG_HUFFENC_AC0_21_HCODE42     (0xFFu<<0)
#define JPEG_HUFFENC_AC0_21_HCODE42_0   (0x1u<<0)

// HUFFENC_AC0_22 Configuration

#define JPEG_HUFFENC_AC0_22_HLEN45      (0xFu<<24)
#define JPEG_HUFFENC_AC0_22_HLEN45_0    (0x1u<<24)
#define JPEG_HUFFENC_AC0_22_HCODE45     (0xFFu<<16)
#define JPEG_HUFFENC_AC0_22_HCODE45_0   (0x1u<<16)
#define JPEG_HUFFENC_AC0_22_HLEN44      (0xFu<<8)
#define JPEG_HUFFENC_AC0_22_HLEN44_0    (0x1u<<8)
#define JPEG_HUFFENC_AC0_22_HCODE44     (0xFFu<<0)
#define JPEG_HUFFENC_AC0_22_HCODE44_0   (0x1u<<0)

// HUFFENC_AC0_23 Configuration

#define JPEG_HUFFENC_AC0_23_HLEN47      (0xFu<<24)
#define JPEG_HUFFENC_AC0_23_HLEN47_0    (0x1u<<24)
#define JPEG_HUFFENC_AC0_23_HCODE47     (0xFFu<<16)
#define JPEG_HUFFENC_AC0_23_HCODE47_0   (0x1u<<16)
#define JPEG_HUFFENC_AC0_23_HLEN46      (0xFu<<8)
#define JPEG_HUFFENC_AC0_23_HLEN46_0    (0x1u<<8)
#define JPEG_HUFFENC_AC0_23_HCODE46     (0xFFu<<0)
#define JPEG_HUFFENC_AC0_23_HCODE46_0   (0x1u<<0)

// HUFFENC_AC0_24 Configuration

#define JPEG_HUFFENC_AC0_24_HLEN49      (0xFu<<24)
#define JPEG_HUFFENC_AC0_24_HLEN49_0    (0x1u<<24)
#define JPEG_HUFFENC_AC0_24_HCODE49     (0xFFu<<16)
#define JPEG_HUFFENC_AC0_24_HCODE49_0   (0x1u<<16)
#define JPEG_HUFFENC_AC0_24_HLEN48      (0xFu<<8)
#define JPEG_HUFFENC_AC0_24_HLEN48_0    (0x1u<<8)
#define JPEG_HUFFENC_AC0_24_HCODE48     (0xFFu<<0)
#define JPEG_HUFFENC_AC0_24_HCODE48_0   (0x1u<<0)

// HUFFENC_AC0_25 Configuration

#define JPEG_HUFFENC_AC0_25_HLEN51      (0xFu<<24)
#define JPEG_HUFFENC_AC0_25_HLEN51_0    (0x1u<<24)
#define JPEG_HUFFENC_AC0_25_HCODE51     (0xFFu<<16)
#define JPEG_HUFFENC_AC0_25_HCODE51_0   (0x1u<<16)
#define JPEG_HUFFENC_AC0_25_HLEN50      (0xFu<<8)
#define JPEG_HUFFENC_AC0_25_HLEN50_0    (0x1u<<8)
#define JPEG_HUFFENC_AC0_25_HCODE50     (0xFFu<<0)
#define JPEG_HUFFENC_AC0_25_HCODE50_0   (0x1u<<0)

// HUFFENC_AC0_26 Configuration

