Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_jpeg.h
// HUFFENC_AC0_40 Configuration

#define JPEG_HUFFENC_AC0_40_HLEN81      (0xFu<<24)
#define JPEG_HUFFENC_AC0_40_HLEN81_0    (0x1u<<24)
#define JPEG_HUFFENC_AC0_40_HCODE81     (0xFFu<<16)
#define JPEG_HUFFENC_AC0_40_HCODE81_0   (0x1u<<16)
#define JPEG_HUFFENC_AC0_40_HLEN80      (0xFu<<8)
#define JPEG_HUFFENC_AC0_40_HLEN80_0    (0x1u<<8)
#define JPEG_HUFFENC_AC0_40_HCODE80     (0xFFu<<0)
#define JPEG_HUFFENC_AC0_40_HCODE80_0   (0x1u<<0)

// HUFFENC_AC0_41 Configuration

#define JPEG_HUFFENC_AC0_41_HLEN83      (0xFu<<24)
#define JPEG_HUFFENC_AC0_41_HLEN83_0    (0x1u<<24)
#define JPEG_HUFFENC_AC0_41_HCODE83     (0xFFu<<16)
#define JPEG_HUFFENC_AC0_41_HCODE83_0   (0x1u<<16)
#define JPEG_HUFFENC_AC0_41_HLEN82      (0xFu<<8)
#define JPEG_HUFFENC_AC0_41_HLEN82_0    (0x1u<<8)
#define JPEG_HUFFENC_AC0_41_HCODE82     (0xFFu<<0)
#define JPEG_HUFFENC_AC0_41_HCODE82_0   (0x1u<<0)

// HUFFENC_AC0_42 Configuration

#define JPEG_HUFFENC_AC0_42_HLEN85      (0xFu<<24)
#define JPEG_HUFFENC_AC0_42_HLEN85_0    (0x1u<<24)
#define JPEG_HUFFENC_AC0_42_HCODE85     (0xFFu<<16)
#define JPEG_HUFFENC_AC0_42_HCODE85_0   (0x1u<<16)
#define JPEG_HUFFENC_AC0_42_HLEN84      (0xFu<<8)
#define JPEG_HUFFENC_AC0_42_HLEN84_0    (0x1u<<8)
#define JPEG_HUFFENC_AC0_42_HCODE84     (0xFFu<<0)
#define JPEG_HUFFENC_AC0_42_HCODE84_0   (0x1u<<0)

// HUFFENC_AC0_43 Configuration

#define JPEG_HUFFENC_AC0_43_HLEN87      (0xFu<<24)
#define JPEG_HUFFENC_AC0_43_HLEN87_0    (0x1u<<24)
#define JPEG_HUFFENC_AC0_43_HCODE87     (0xFFu<<16)
#define JPEG_HUFFENC_AC0_43_HCODE87_0   (0x1u<<16)
#define JPEG_HUFFENC_AC0_43_HLEN86      (0xFu<<8)
#define JPEG_HUFFENC_AC0_43_HLEN86_0    (0x1u<<8)
#define JPEG_HUFFENC_AC0_43_HCODE86     (0xFFu<<0)
#define JPEG_HUFFENC_AC0_43_HCODE86_0   (0x1u<<0)

// HUFFENC_AC0_44 Configuration

#define JPEG_HUFFENC_AC0_44_HLEN89      (0xFu<<24)
#define JPEG_HUFFENC_AC0_44_HLEN89_0    (0x1u<<24)
#define JPEG_HUFFENC_AC0_44_HCODE89     (0xFFu<<16)
#define JPEG_HUFFENC_AC0_44_HCODE89_0   (0x1u<<16)
#define JPEG_HUFFENC_AC0_44_HLEN88      (0xFu<<8)
#define JPEG_HUFFENC_AC0_44_HLEN88_0    (0x1u<<8)
#define JPEG_HUFFENC_AC0_44_HCODE88     (0xFFu<<0)
#define JPEG_HUFFENC_AC0_44_HCODE88_0   (0x1u<<0)

// HUFFENC_AC0_45 Configuration

#define JPEG_HUFFENC_AC0_45_HLEN91      (0xFu<<24)
#define JPEG_HUFFENC_AC0_45_HLEN91_0    (0x1u<<24)
#define JPEG_HUFFENC_AC0_45_HCODE91     (0xFFu<<16)
#define JPEG_HUFFENC_AC0_45_HCODE91_0   (0x1u<<16)
#define JPEG_HUFFENC_AC0_45_HLEN90      (0xFu<<8)
#define JPEG_HUFFENC_AC0_45_HLEN90_0    (0x1u<<8)
#define JPEG_HUFFENC_AC0_45_HCODE90     (0xFFu<<0)
#define JPEG_HUFFENC_AC0_45_HCODE90_0   (0x1u<<0)

// HUFFENC_AC0_46 Configuration

#define JPEG_HUFFENC_AC0_46_HLEN93      (0xFu<<24)
#define JPEG_HUFFENC_AC0_46_HLEN93_0    (0x1u<<24)
#define JPEG_HUFFENC_AC0_46_HCODE93     (0xFFu<<16)
#define JPEG_HUFFENC_AC0_46_HCODE93_0   (0x1u<<16)
#define JPEG_HUFFENC_AC0_46_HLEN92      (0xFu<<8)
#define JPEG_HUFFENC_AC0_46_HLEN92_0    (0x1u<<8)
#define JPEG_HUFFENC_AC0_46_HCODE92     (0xFFu<<0)
#define JPEG_HUFFENC_AC0_46_HCODE92_0   (0x1u<<0)

// HUFFENC_AC0_47 Configuration

#define JPEG_HUFFENC_AC0_47_HLEN95      (0xFu<<24)
#define JPEG_HUFFENC_AC0_47_HLEN95_0    (0x1u<<24)
#define JPEG_HUFFENC_AC0_47_HCODE95     (0xFFu<<16)
#define JPEG_HUFFENC_AC0_47_HCODE95_0   (0x1u<<16)
#define JPEG_HUFFENC_AC0_47_HLEN94      (0xFu<<8)
#define JPEG_HUFFENC_AC0_47_HLEN94_0    (0x1u<<8)
#define JPEG_HUFFENC_AC0_47_HCODE94     (0xFFu<<0)
#define JPEG_HUFFENC_AC0_47_HCODE94_0   (0x1u<<0)

// HUFFENC_AC0_48 Configuration

#define JPEG_HUFFENC_AC0_48_HLEN97      (0xFu<<24)
#define JPEG_HUFFENC_AC0_48_HLEN97_0    (0x1u<<24)
#define JPEG_HUFFENC_AC0_48_HCODE97     (0xFFu<<16)
#define JPEG_HUFFENC_AC0_48_HCODE97_0   (0x1u<<16)
#define JPEG_HUFFENC_AC0_48_HLEN96      (0xFu<<8)
#define JPEG_HUFFENC_AC0_48_HLEN96_0    (0x1u<<8)
#define JPEG_HUFFENC_AC0_48_HCODE96     (0xFFu<<0)
#define JPEG_HUFFENC_AC0_48_HCODE96_0   (0x1u<<0)

// HUFFENC_AC0_49 Configuration

#define JPEG_HUFFENC_AC0_49_HLEN99      (0xFu<<24)
#define JPEG_HUFFENC_AC0_49_HLEN99_0    (0x1u<<24)
#define JPEG_HUFFENC_AC0_49_HCODE99     (0xFFu<<16)
#define JPEG_HUFFENC_AC0_49_HCODE99_0   (0x1u<<16)
#define JPEG_HUFFENC_AC0_49_HLEN98      (0xFu<<8)
#define JPEG_HUFFENC_AC0_49_HLEN98_0    (0x1u<<8)
#define JPEG_HUFFENC_AC0_49_HCODE98     (0xFFu<<0)
#define JPEG_HUFFENC_AC0_49_HCODE98_0   (0x1u<<0)

// HUFFENC_AC0_50 Configuration

#define JPEG_HUFFENC_AC0_50_HLEN101     (0xFu<<24)
#define JPEG_HUFFENC_AC0_50_HLEN101_0   (0x1u<<24)
#define JPEG_HUFFENC_AC0_50_HCODE101    (0xFFu<<16)
#define JPEG_HUFFENC_AC0_50_HCODE101_0  (0x1u<<16)
#define JPEG_HUFFENC_AC0_50_HLEN100     (0xFu<<8)
#define JPEG_HUFFENC_AC0_50_HLEN100_0   (0x1u<<8)
#define JPEG_HUFFENC_AC0_50_HCODE100    (0xFFu<<0)
#define JPEG_HUFFENC_AC0_50_HCODE100_0  (0x1u<<0)

// HUFFENC_AC0_51 Configuration

#define JPEG_HUFFENC_AC0_51_HLEN103     (0xFu<<24)
#define JPEG_HUFFENC_AC0_51_HLEN103_0   (0x1u<<24)
#define JPEG_HUFFENC_AC0_51_HCODE103    (0xFFu<<16)
#define JPEG_HUFFENC_AC0_51_HCODE103_0  (0x1u<<16)
#define JPEG_HUFFENC_AC0_51_HLEN102     (0xFu<<8)
#define JPEG_HUFFENC_AC0_51_HLEN102_0   (0x1u<<8)
#define JPEG_HUFFENC_AC0_51_HCODE102    (0xFFu<<0)
#define JPEG_HUFFENC_AC0_51_HCODE102_0  (0x1u<<0)

// HUFFENC_AC0_52 Configuration

#define JPEG_HUFFENC_AC0_52_HLEN105     (0xFu<<24)
#define JPEG_HUFFENC_AC0_52_HLEN105_0   (0x1u<<24)
#define JPEG_HUFFENC_AC0_52_HCODE105    (0xFFu<<16)
#define JPEG_HUFFENC_AC0_52_HCODE105_0  (0x1u<<16)
#define JPEG_HUFFENC_AC0_52_HLEN104     (0xFu<<8)
#define JPEG_HUFFENC_AC0_52_HLEN104_0   (0x1u<<8)
#define JPEG_HUFFENC_AC0_52_HCODE104    (0xFFu<<0)
#define JPEG_HUFFENC_AC0_52_HCODE104_0  (0x1u<<0)

// HUFFENC_AC0_53 Configuration

#define JPEG_HUFFENC_AC0_53_HLEN107     (0xFu<<24)
#define JPEG_HUFFENC_AC0_53_HLEN107_0   (0x1u<<24)
#define JPEG_HUFFENC_AC0_53_HCODE107    (0xFFu<<16)
#define JPEG_HUFFENC_AC0_53_HCODE107_0  (0x1u<<16)
#define JPEG_HUFFENC_AC0_53_HLEN106     (0xFu<<8)
#define JPEG_HUFFENC_AC0_53_HLEN106_0   (0x1u<<8)
#define JPEG_HUFFENC_AC0_53_HCODE106    (0xFFu<<0)
#define JPEG_HUFFENC_AC0_53_HCODE106_0  (0x1u<<0)

// HUFFENC_AC0_54 Configuration

#define JPEG_HUFFENC_AC0_54_HLEN109     (0xFu<<24)
#define JPEG_HUFFENC_AC0_54_HLEN109_0   (0x1u<<24)
#define JPEG_HUFFENC_AC0_54_HCODE109    (0xFFu<<16)
#define JPEG_HUFFENC_AC0_54_HCODE109_0  (0x1u<<16)
#define JPEG_HUFFENC_AC0_54_HLEN108     (0xFu<<8)
#define JPEG_HUFFENC_AC0_54_HLEN108_0   (0x1u<<8)
#define JPEG_HUFFENC_AC0_54_HCODE108    (0xFFu<<0)
#define JPEG_HUFFENC_AC0_54_HCODE108_0  (0x1u<<0)

// HUFFENC_AC0_55 Configuration

#define JPEG_HUFFENC_AC0_55_HLEN111     (0xFu<<24)
#define JPEG_HUFFENC_AC0_55_HLEN111_0   (0x1u<<24)
#define JPEG_HUFFENC_AC0_55_HCODE111    (0xFFu<<16)
#define JPEG_HUFFENC_AC0_55_HCODE111_0  (0x1u<<16)
#define JPEG_HUFFENC_AC0_55_HLEN110     (0xFu<<8)
#define JPEG_HUFFENC_AC0_55_HLEN110_0   (0x1u<<8)
#define JPEG_HUFFENC_AC0_55_HCODE110    (0xFFu<<0)
#define JPEG_HUFFENC_AC0_55_HCODE110_0  (0x1u<<0)

// HUFFENC_AC0_56 Configuration

#define JPEG_HUFFENC_AC0_56_HLEN113     (0xFu<<24)
#define JPEG_HUFFENC_AC0_56_HLEN113_0   (0x1u<<24)
#define JPEG_HUFFENC_AC0_56_HCODE113    (0xFFu<<16)
#define JPEG_HUFFENC_AC0_56_HCODE113_0  (0x1u<<16)
#define JPEG_HUFFENC_AC0_56_HLEN112     (0xFu<<8)
#define JPEG_HUFFENC_AC0_56_HLEN112_0   (0x1u<<8)
#define JPEG_HUFFENC_AC0_56_HCODE112    (0xFFu<<0)
#define JPEG_HUFFENC_AC0_56_HCODE112_0  (0x1u<<0)

// HUFFENC_AC0_57 Configuration

#define JPEG_HUFFENC_AC0_57_HLEN115     (0xFu<<24)
#define JPEG_HUFFENC_AC0_57_HLEN115_0   (0x1u<<24)
#define JPEG_HUFFENC_AC0_57_HCODE115    (0xFFu<<16)
#define JPEG_HUFFENC_AC0_57_HCODE115_0  (0x1u<<16)
#define JPEG_HUFFENC_AC0_57_HLEN114     (0xFu<<8)
#define JPEG_HUFFENC_AC0_57_HLEN114_0   (0x1u<<8)
#define JPEG_HUFFENC_AC0_57_HCODE114    (0xFFu<<0)
#define JPEG_HUFFENC_AC0_57_HCODE114_0  (0x1u<<0)

// HUFFENC_AC0_58 Configuration

