Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_jpeg.h
#define JPEG_HUFFENC_AC0_58_HLEN117     (0xFu<<24)
#define JPEG_HUFFENC_AC0_58_HLEN117_0   (0x1u<<24)
#define JPEG_HUFFENC_AC0_58_HCODE117    (0xFFu<<16)
#define JPEG_HUFFENC_AC0_58_HCODE117_0  (0x1u<<16)
#define JPEG_HUFFENC_AC0_58_HLEN116     (0xFu<<8)
#define JPEG_HUFFENC_AC0_58_HLEN116_0   (0x1u<<8)
#define JPEG_HUFFENC_AC0_58_HCODE116    (0xFFu<<0)
#define JPEG_HUFFENC_AC0_58_HCODE116_0  (0x1u<<0)

// HUFFENC_AC0_59 Configuration

#define JPEG_HUFFENC_AC0_59_HLEN119     (0xFu<<24)
#define JPEG_HUFFENC_AC0_59_HLEN119_0   (0x1u<<24)
#define JPEG_HUFFENC_AC0_59_HCODE119    (0xFFu<<16)
#define JPEG_HUFFENC_AC0_59_HCODE119_0  (0x1u<<16)
#define JPEG_HUFFENC_AC0_59_HLEN118     (0xFu<<8)
#define JPEG_HUFFENC_AC0_59_HLEN118_0   (0x1u<<8)
#define JPEG_HUFFENC_AC0_59_HCODE118    (0xFFu<<0)
#define JPEG_HUFFENC_AC0_59_HCODE118_0  (0x1u<<0)

// HUFFENC_AC0_60 Configuration

#define JPEG_HUFFENC_AC0_60_HLEN121     (0xFu<<24)
#define JPEG_HUFFENC_AC0_60_HLEN121_0   (0x1u<<24)
#define JPEG_HUFFENC_AC0_60_HCODE121    (0xFFu<<16)
#define JPEG_HUFFENC_AC0_60_HCODE121_0  (0x1u<<16)
#define JPEG_HUFFENC_AC0_60_HLEN120     (0xFu<<8)
#define JPEG_HUFFENC_AC0_60_HLEN120_0   (0x1u<<8)
#define JPEG_HUFFENC_AC0_60_HCODE120    (0xFFu<<0)
#define JPEG_HUFFENC_AC0_60_HCODE120_0  (0x1u<<0)

// HUFFENC_AC0_61 Configuration

#define JPEG_HUFFENC_AC0_61_HLEN123     (0xFu<<24)
#define JPEG_HUFFENC_AC0_61_HLEN123_0   (0x1u<<24)
#define JPEG_HUFFENC_AC0_61_HCODE123    (0xFFu<<16)
#define JPEG_HUFFENC_AC0_61_HCODE123_0  (0x1u<<16)
#define JPEG_HUFFENC_AC0_61_HLEN122     (0xFu<<8)
#define JPEG_HUFFENC_AC0_61_HLEN122_0   (0x1u<<8)
#define JPEG_HUFFENC_AC0_61_HCODE122    (0xFFu<<0)
#define JPEG_HUFFENC_AC0_61_HCODE122_0  (0x1u<<0)

// HUFFENC_AC0_62 Configuration

#define JPEG_HUFFENC_AC0_62_HLEN125     (0xFu<<24)
#define JPEG_HUFFENC_AC0_62_HLEN125_0   (0x1u<<24)
#define JPEG_HUFFENC_AC0_62_HCODE125    (0xFFu<<16)
#define JPEG_HUFFENC_AC0_62_HCODE125_0  (0x1u<<16)
#define JPEG_HUFFENC_AC0_62_HLEN124     (0xFu<<8)
#define JPEG_HUFFENC_AC0_62_HLEN124_0   (0x1u<<8)
#define JPEG_HUFFENC_AC0_62_HCODE124    (0xFFu<<0)
#define JPEG_HUFFENC_AC0_62_HCODE124_0  (0x1u<<0)

// HUFFENC_AC0_63 Configuration

#define JPEG_HUFFENC_AC0_63_HLEN127     (0xFu<<24)
#define JPEG_HUFFENC_AC0_63_HLEN127_0   (0x1u<<24)
#define JPEG_HUFFENC_AC0_63_HCODE127    (0xFFu<<16)
#define JPEG_HUFFENC_AC0_63_HCODE127_0  (0x1u<<16)
#define JPEG_HUFFENC_AC0_63_HLEN126     (0xFu<<8)
#define JPEG_HUFFENC_AC0_63_HLEN126_0   (0x1u<<8)
#define JPEG_HUFFENC_AC0_63_HCODE126    (0xFFu<<0)
#define JPEG_HUFFENC_AC0_63_HCODE126_0  (0x1u<<0)

// HUFFENC_AC0_64 Configuration

#define JPEG_HUFFENC_AC0_64_HLEN129     (0xFu<<24)
#define JPEG_HUFFENC_AC0_64_HLEN129_0   (0x1u<<24)
#define JPEG_HUFFENC_AC0_64_HCODE129    (0xFFu<<16)
#define JPEG_HUFFENC_AC0_64_HCODE129_0  (0x1u<<16)
#define JPEG_HUFFENC_AC0_64_HLEN128     (0xFu<<8)
#define JPEG_HUFFENC_AC0_64_HLEN128_0   (0x1u<<8)
#define JPEG_HUFFENC_AC0_64_HCODE128    (0xFFu<<0)
#define JPEG_HUFFENC_AC0_64_HCODE128_0  (0x1u<<0)

// HUFFENC_AC0_65 Configuration

#define JPEG_HUFFENC_AC0_65_HLEN131     (0xFu<<24)
#define JPEG_HUFFENC_AC0_65_HLEN131_0   (0x1u<<24)
#define JPEG_HUFFENC_AC0_65_HCODE131    (0xFFu<<16)
#define JPEG_HUFFENC_AC0_65_HCODE131_0  (0x1u<<16)
#define JPEG_HUFFENC_AC0_65_HLEN130     (0xFu<<8)
#define JPEG_HUFFENC_AC0_65_HLEN130_0   (0x1u<<8)
#define JPEG_HUFFENC_AC0_65_HCODE130    (0xFFu<<0)
#define JPEG_HUFFENC_AC0_65_HCODE130_0  (0x1u<<0)

// HUFFENC_AC0_66 Configuration

#define JPEG_HUFFENC_AC0_66_HLEN133     (0xFu<<24)
#define JPEG_HUFFENC_AC0_66_HLEN133_0   (0x1u<<24)
#define JPEG_HUFFENC_AC0_66_HCODE133    (0xFFu<<16)
#define JPEG_HUFFENC_AC0_66_HCODE133_0  (0x1u<<16)
#define JPEG_HUFFENC_AC0_66_HLEN132     (0xFu<<8)
#define JPEG_HUFFENC_AC0_66_HLEN132_0   (0x1u<<8)
#define JPEG_HUFFENC_AC0_66_HCODE132    (0xFFu<<0)
#define JPEG_HUFFENC_AC0_66_HCODE132_0  (0x1u<<0)

// HUFFENC_AC0_67 Configuration

#define JPEG_HUFFENC_AC0_67_HLEN135     (0xFu<<24)
#define JPEG_HUFFENC_AC0_67_HLEN135_0   (0x1u<<24)
#define JPEG_HUFFENC_AC0_67_HCODE135    (0xFFu<<16)
#define JPEG_HUFFENC_AC0_67_HCODE135_0  (0x1u<<16)
#define JPEG_HUFFENC_AC0_67_HLEN134     (0xFu<<8)
#define JPEG_HUFFENC_AC0_67_HLEN134_0   (0x1u<<8)
#define JPEG_HUFFENC_AC0_67_HCODE134    (0xFFu<<0)
#define JPEG_HUFFENC_AC0_67_HCODE134_0  (0x1u<<0)

// HUFFENC_AC0_68 Configuration

#define JPEG_HUFFENC_AC0_68_HLEN137     (0xFu<<24)
#define JPEG_HUFFENC_AC0_68_HLEN137_0   (0x1u<<24)
#define JPEG_HUFFENC_AC0_68_HCODE137    (0xFFu<<16)
#define JPEG_HUFFENC_AC0_68_HCODE137_0  (0x1u<<16)
#define JPEG_HUFFENC_AC0_68_HLEN136     (0xFu<<8)
#define JPEG_HUFFENC_AC0_68_HLEN136_0   (0x1u<<8)
#define JPEG_HUFFENC_AC0_68_HCODE136    (0xFFu<<0)
#define JPEG_HUFFENC_AC0_68_HCODE136_0  (0x1u<<0)

// HUFFENC_AC0_69 Configuration

#define JPEG_HUFFENC_AC0_69_HLEN139     (0xFu<<24)
#define JPEG_HUFFENC_AC0_69_HLEN139_0   (0x1u<<24)
#define JPEG_HUFFENC_AC0_69_HCODE139    (0xFFu<<16)
#define JPEG_HUFFENC_AC0_69_HCODE139_0  (0x1u<<16)
#define JPEG_HUFFENC_AC0_69_HLEN138     (0xFu<<8)
#define JPEG_HUFFENC_AC0_69_HLEN138_0   (0x1u<<8)
#define JPEG_HUFFENC_AC0_69_HCODE138    (0xFFu<<0)
#define JPEG_HUFFENC_AC0_69_HCODE138_0  (0x1u<<0)

// HUFFENC_AC0_70 Configuration

#define JPEG_HUFFENC_AC0_70_HLEN141     (0xFu<<24)
#define JPEG_HUFFENC_AC0_70_HLEN141_0   (0x1u<<24)
#define JPEG_HUFFENC_AC0_70_HCODE141    (0xFFu<<16)
#define JPEG_HUFFENC_AC0_70_HCODE141_0  (0x1u<<16)
#define JPEG_HUFFENC_AC0_70_HLEN140     (0xFu<<8)
#define JPEG_HUFFENC_AC0_70_HLEN140_0   (0x1u<<8)
#define JPEG_HUFFENC_AC0_70_HCODE140    (0xFFu<<0)
#define JPEG_HUFFENC_AC0_70_HCODE140_0  (0x1u<<0)

// HUFFENC_AC0_71 Configuration

#define JPEG_HUFFENC_AC0_71_HLEN143     (0xFu<<24)
#define JPEG_HUFFENC_AC0_71_HLEN143_0   (0x1u<<24)
#define JPEG_HUFFENC_AC0_71_HCODE143    (0xFFu<<16)
#define JPEG_HUFFENC_AC0_71_HCODE143_0  (0x1u<<16)
#define JPEG_HUFFENC_AC0_71_HLEN142     (0xFu<<8)
#define JPEG_HUFFENC_AC0_71_HLEN142_0   (0x1u<<8)
#define JPEG_HUFFENC_AC0_71_HCODE142    (0xFFu<<0)
#define JPEG_HUFFENC_AC0_71_HCODE142_0  (0x1u<<0)

// HUFFENC_AC0_72 Configuration

#define JPEG_HUFFENC_AC0_72_HLEN145     (0xFu<<24)
#define JPEG_HUFFENC_AC0_72_HLEN145_0   (0x1u<<24)
#define JPEG_HUFFENC_AC0_72_HCODE145    (0xFFu<<16)
#define JPEG_HUFFENC_AC0_72_HCODE145_0  (0x1u<<16)
#define JPEG_HUFFENC_AC0_72_HLEN144     (0xFu<<8)
#define JPEG_HUFFENC_AC0_72_HLEN144_0   (0x1u<<8)
#define JPEG_HUFFENC_AC0_72_HCODE144    (0xFFu<<0)
#define JPEG_HUFFENC_AC0_72_HCODE144_0  (0x1u<<0)

// HUFFENC_AC0_73 Configuration

#define JPEG_HUFFENC_AC0_73_HLEN147     (0xFu<<24)
#define JPEG_HUFFENC_AC0_73_HLEN147_0   (0x1u<<24)
#define JPEG_HUFFENC_AC0_73_HCODE147    (0xFFu<<16)
#define JPEG_HUFFENC_AC0_73_HCODE147_0  (0x1u<<16)
#define JPEG_HUFFENC_AC0_73_HLEN146     (0xFu<<8)
#define JPEG_HUFFENC_AC0_73_HLEN146_0   (0x1u<<8)
#define JPEG_HUFFENC_AC0_73_HCODE146    (0xFFu<<0)
#define JPEG_HUFFENC_AC0_73_HCODE146_0  (0x1u<<0)

// HUFFENC_AC0_74 Configuration

#define JPEG_HUFFENC_AC0_74_HLEN149     (0xFu<<24)
#define JPEG_HUFFENC_AC0_74_HLEN149_0   (0x1u<<24)
#define JPEG_HUFFENC_AC0_74_HCODE149    (0xFFu<<16)
#define JPEG_HUFFENC_AC0_74_HCODE149_0  (0x1u<<16)
#define JPEG_HUFFENC_AC0_74_HLEN148     (0xFu<<8)
#define JPEG_HUFFENC_AC0_74_HLEN148_0   (0x1u<<8)
#define JPEG_HUFFENC_AC0_74_HCODE148    (0xFFu<<0)
#define JPEG_HUFFENC_AC0_74_HCODE148_0  (0x1u<<0)

// HUFFENC_AC0_75 Configuration

