Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_jpeg.h
#define JPEG_HUFFENC_AC0_75_HLEN151     (0xFu<<24)
#define JPEG_HUFFENC_AC0_75_HLEN151_0   (0x1u<<24)
#define JPEG_HUFFENC_AC0_75_HCODE151    (0xFFu<<16)
#define JPEG_HUFFENC_AC0_75_HCODE151_0  (0x1u<<16)
#define JPEG_HUFFENC_AC0_75_HLEN150     (0xFu<<8)
#define JPEG_HUFFENC_AC0_75_HLEN150_0   (0x1u<<8)
#define JPEG_HUFFENC_AC0_75_HCODE150    (0xFFu<<0)
#define JPEG_HUFFENC_AC0_75_HCODE150_0  (0x1u<<0)

// HUFFENC_AC0_76 Configuration

#define JPEG_HUFFENC_AC0_76_HLEN153     (0xFu<<24)
#define JPEG_HUFFENC_AC0_76_HLEN153_0   (0x1u<<24)
#define JPEG_HUFFENC_AC0_76_HCODE153    (0xFFu<<16)
#define JPEG_HUFFENC_AC0_76_HCODE153_0  (0x1u<<16)
#define JPEG_HUFFENC_AC0_76_HLEN152     (0xFu<<8)
#define JPEG_HUFFENC_AC0_76_HLEN152_0   (0x1u<<8)
#define JPEG_HUFFENC_AC0_76_HCODE152    (0xFFu<<0)
#define JPEG_HUFFENC_AC0_76_HCODE152_0  (0x1u<<0)

// HUFFENC_AC0_77 Configuration

#define JPEG_HUFFENC_AC0_77_HLEN155     (0xFu<<24)
#define JPEG_HUFFENC_AC0_77_HLEN155_0   (0x1u<<24)
#define JPEG_HUFFENC_AC0_77_HCODE155    (0xFFu<<16)
#define JPEG_HUFFENC_AC0_77_HCODE155_0  (0x1u<<16)
#define JPEG_HUFFENC_AC0_77_HLEN154     (0xFu<<8)
#define JPEG_HUFFENC_AC0_77_HLEN154_0   (0x1u<<8)
#define JPEG_HUFFENC_AC0_77_HCODE154    (0xFFu<<0)
#define JPEG_HUFFENC_AC0_77_HCODE154_0  (0x1u<<0)

// HUFFENC_AC0_78 Configuration

#define JPEG_HUFFENC_AC0_78_HLEN157     (0xFu<<24)
#define JPEG_HUFFENC_AC0_78_HLEN157_0   (0x1u<<24)
#define JPEG_HUFFENC_AC0_78_HCODE157    (0xFFu<<16)
#define JPEG_HUFFENC_AC0_78_HCODE157_0  (0x1u<<16)
#define JPEG_HUFFENC_AC0_78_HLEN156     (0xFu<<8)
#define JPEG_HUFFENC_AC0_78_HLEN156_0   (0x1u<<8)
#define JPEG_HUFFENC_AC0_78_HCODE156    (0xFFu<<0)
#define JPEG_HUFFENC_AC0_78_HCODE156_0  (0x1u<<0)

// HUFFENC_AC0_79 Configuration

#define JPEG_HUFFENC_AC0_79_HLEN159     (0xFu<<24)
#define JPEG_HUFFENC_AC0_79_HLEN159_0   (0x1u<<24)
#define JPEG_HUFFENC_AC0_79_HCODE159    (0xFFu<<16)
#define JPEG_HUFFENC_AC0_79_HCODE159_0  (0x1u<<16)
#define JPEG_HUFFENC_AC0_79_HLEN158     (0xFu<<8)
#define JPEG_HUFFENC_AC0_79_HLEN158_0   (0x1u<<8)
#define JPEG_HUFFENC_AC0_79_HCODE158    (0xFFu<<0)
#define JPEG_HUFFENC_AC0_79_HCODE158_0  (0x1u<<0)

// HUFFENC_AC0_80 Configuration

#define JPEG_HUFFENC_AC0_80_HLEN161     (0xFu<<24)
#define JPEG_HUFFENC_AC0_80_HLEN161_0   (0x1u<<24)
#define JPEG_HUFFENC_AC0_80_HCODE161    (0xFFu<<16)
#define JPEG_HUFFENC_AC0_80_HCODE161_0  (0x1u<<16)
#define JPEG_HUFFENC_AC0_80_HLEN160     (0xFu<<8)
#define JPEG_HUFFENC_AC0_80_HLEN160_0   (0x1u<<8)
#define JPEG_HUFFENC_AC0_80_HCODE160    (0xFFu<<0)
#define JPEG_HUFFENC_AC0_80_HCODE160_0  (0x1u<<0)

// HUFFENC_AC0_81 Configuration

#define JPEG_HUFFENC_AC0_81_HLEN163     (0xFu<<24)
#define JPEG_HUFFENC_AC0_81_HLEN163_0   (0x1u<<24)
#define JPEG_HUFFENC_AC0_81_HCODE163    (0xFFu<<16)
#define JPEG_HUFFENC_AC0_81_HCODE163_0  (0x1u<<16)
#define JPEG_HUFFENC_AC0_81_HLEN162     (0xFu<<8)
#define JPEG_HUFFENC_AC0_81_HLEN162_0   (0x1u<<8)
#define JPEG_HUFFENC_AC0_81_HCODE162    (0xFFu<<0)
#define JPEG_HUFFENC_AC0_81_HCODE162_0  (0x1u<<0)

// HUFFENC_AC0_82 Configuration

#define JPEG_HUFFENC_AC0_82_HLEN165     (0xFu<<24)
#define JPEG_HUFFENC_AC0_82_HLEN165_0   (0x1u<<24)
#define JPEG_HUFFENC_AC0_82_HCODE165    (0xFFu<<16)
#define JPEG_HUFFENC_AC0_82_HCODE165_0  (0x1u<<16)
#define JPEG_HUFFENC_AC0_82_HLEN164     (0xFu<<8)
#define JPEG_HUFFENC_AC0_82_HLEN164_0   (0x1u<<8)
#define JPEG_HUFFENC_AC0_82_HCODE164    (0xFFu<<0)
#define JPEG_HUFFENC_AC0_82_HCODE164_0  (0x1u<<0)

// HUFFENC_AC0_83 Configuration

#define JPEG_HUFFENC_AC0_83_HLEN167     (0xFu<<24)
#define JPEG_HUFFENC_AC0_83_HLEN167_0   (0x1u<<24)
#define JPEG_HUFFENC_AC0_83_HCODE167    (0xFFu<<16)
#define JPEG_HUFFENC_AC0_83_HCODE167_0  (0x1u<<16)
#define JPEG_HUFFENC_AC0_83_HLEN166     (0xFu<<8)
#define JPEG_HUFFENC_AC0_83_HLEN166_0   (0x1u<<8)
#define JPEG_HUFFENC_AC0_83_HCODE166    (0xFFu<<0)
#define JPEG_HUFFENC_AC0_83_HCODE166_0  (0x1u<<0)

// HUFFENC_AC0_84 Configuration

#define JPEG_HUFFENC_AC0_84_HLEN169     (0xFu<<24)
#define JPEG_HUFFENC_AC0_84_HLEN169_0   (0x1u<<24)
#define JPEG_HUFFENC_AC0_84_HCODE169    (0xFFu<<16)
#define JPEG_HUFFENC_AC0_84_HCODE169_0  (0x1u<<16)
#define JPEG_HUFFENC_AC0_84_HLEN168     (0xFu<<8)
#define JPEG_HUFFENC_AC0_84_HLEN168_0   (0x1u<<8)
#define JPEG_HUFFENC_AC0_84_HCODE168    (0xFFu<<0)
#define JPEG_HUFFENC_AC0_84_HCODE168_0  (0x1u<<0)

// HUFFENC_AC0_85 Configuration

#define JPEG_HUFFENC_AC0_85_HLEN171     (0xFu<<24)
#define JPEG_HUFFENC_AC0_85_HLEN171_0   (0x1u<<24)
#define JPEG_HUFFENC_AC0_85_HCODE171    (0xFFu<<16)
#define JPEG_HUFFENC_AC0_85_HCODE171_0  (0x1u<<16)
#define JPEG_HUFFENC_AC0_85_HLEN170     (0xFu<<8)
#define JPEG_HUFFENC_AC0_85_HLEN170_0   (0x1u<<8)
#define JPEG_HUFFENC_AC0_85_HCODE170    (0xFFu<<0)
#define JPEG_HUFFENC_AC0_85_HCODE170_0  (0x1u<<0)

// HUFFENC_AC0_86 Configuration

#define JPEG_HUFFENC_AC0_86_HLEN173     (0xFu<<24)
#define JPEG_HUFFENC_AC0_86_HLEN173_0   (0x1u<<24)
#define JPEG_HUFFENC_AC0_86_HCODE173    (0xFFu<<16)
#define JPEG_HUFFENC_AC0_86_HCODE173_0  (0x1u<<16)
#define JPEG_HUFFENC_AC0_86_HLEN172     (0xFu<<8)
#define JPEG_HUFFENC_AC0_86_HLEN172_0   (0x1u<<8)
#define JPEG_HUFFENC_AC0_86_HCODE172    (0xFFu<<0)
#define JPEG_HUFFENC_AC0_86_HCODE172_0  (0x1u<<0)

// HUFFENC_AC0_87 Configuration

#define JPEG_HUFFENC_AC0_87_HLEN175     (0xFu<<24)
#define JPEG_HUFFENC_AC0_87_HLEN175_0   (0x1u<<24)
#define JPEG_HUFFENC_AC0_87_HCODE175    (0xFFu<<16)
#define JPEG_HUFFENC_AC0_87_HCODE175_0  (0x1u<<16)
#define JPEG_HUFFENC_AC0_87_HLEN174     (0xFu<<8)
#define JPEG_HUFFENC_AC0_87_HLEN174_0   (0x1u<<8)
#define JPEG_HUFFENC_AC0_87_HCODE174    (0xFFu<<0)
#define JPEG_HUFFENC_AC0_87_HCODE174_0  (0x1u<<0)

// HUFFENC_AC1_0 Configuration

#define JPEG_HUFFENC_AC1_0_HLEN1        (0xFu<<24)
#define JPEG_HUFFENC_AC1_0_HLEN1_0      (0x1u<<24)
#define JPEG_HUFFENC_AC1_0_HCODE1       (0xFFu<<16)
#define JPEG_HUFFENC_AC1_0_HCODE1_0     (0x1u<<16)
#define JPEG_HUFFENC_AC1_0_HLEN0        (0xFu<<8)
#define JPEG_HUFFENC_AC1_0_HLEN0_0      (0x1u<<8)
#define JPEG_HUFFENC_AC1_0_HCODE0       (0xFFu<<0)
#define JPEG_HUFFENC_AC1_0_HCODE0_0     (0x1u<<0)

// HUFFENC_AC1_1 Configuration

#define JPEG_HUFFENC_AC1_1_HLEN3        (0xFu<<24)
#define JPEG_HUFFENC_AC1_1_HLEN3_0      (0x1u<<24)
#define JPEG_HUFFENC_AC1_1_HCODE3       (0xFFu<<16)
#define JPEG_HUFFENC_AC1_1_HCODE3_0     (0x1u<<16)
#define JPEG_HUFFENC_AC1_1_HLEN2        (0xFu<<8)
#define JPEG_HUFFENC_AC1_1_HLEN2_0      (0x1u<<8)
#define JPEG_HUFFENC_AC1_1_HCODE2       (0xFFu<<0)
#define JPEG_HUFFENC_AC1_1_HCODE2_0     (0x1u<<0)

// HUFFENC_AC1_2 Configuration

#define JPEG_HUFFENC_AC1_2_HLEN5        (0xFu<<24)
#define JPEG_HUFFENC_AC1_2_HLEN5_0      (0x1u<<24)
#define JPEG_HUFFENC_AC1_2_HCODE5       (0xFFu<<16)
#define JPEG_HUFFENC_AC1_2_HCODE5_0     (0x1u<<16)
#define JPEG_HUFFENC_AC1_2_HLEN4        (0xFu<<8)
#define JPEG_HUFFENC_AC1_2_HLEN4_0      (0x1u<<8)
#define JPEG_HUFFENC_AC1_2_HCODE4       (0xFFu<<0)
#define JPEG_HUFFENC_AC1_2_HCODE4_0     (0x1u<<0)

// HUFFENC_AC1_3 Configuration

#define JPEG_HUFFENC_AC1_3_HLEN7        (0xFu<<24)
#define JPEG_HUFFENC_AC1_3_HLEN7_0      (0x1u<<24)
#define JPEG_HUFFENC_AC1_3_HCODE7       (0xFFu<<16)
#define JPEG_HUFFENC_AC1_3_HCODE7_0     (0x1u<<16)
#define JPEG_HUFFENC_AC1_3_HLEN6        (0xFu<<8)
#define JPEG_HUFFENC_AC1_3_HLEN6_0      (0x1u<<8)
#define JPEG_HUFFENC_AC1_3_HCODE6       (0xFFu<<0)
#define JPEG_HUFFENC_AC1_3_HCODE6_0     (0x1u<<0)

// HUFFENC_AC1_4 Configuration

