Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_jpeg.h
#define JPEG_HUFFENC_AC1_4_HLEN9        (0xFu<<24)
#define JPEG_HUFFENC_AC1_4_HLEN9_0      (0x1u<<24)
#define JPEG_HUFFENC_AC1_4_HCODE9       (0xFFu<<16)
#define JPEG_HUFFENC_AC1_4_HCODE9_0     (0x1u<<16)
#define JPEG_HUFFENC_AC1_4_HLEN8        (0xFu<<8)
#define JPEG_HUFFENC_AC1_4_HLEN8_0      (0x1u<<8)
#define JPEG_HUFFENC_AC1_4_HCODE8       (0xFFu<<0)
#define JPEG_HUFFENC_AC1_4_HCODE8_0     (0x1u<<0)

// HUFFENC_AC1_5 Configuration

#define JPEG_HUFFENC_AC1_5_HLEN11       (0xFu<<24)
#define JPEG_HUFFENC_AC1_5_HLEN11_0     (0x1u<<24)
#define JPEG_HUFFENC_AC1_5_HCODE11      (0xFFu<<16)
#define JPEG_HUFFENC_AC1_5_HCODE11_0    (0x1u<<16)
#define JPEG_HUFFENC_AC1_5_HLEN10       (0xFu<<8)
#define JPEG_HUFFENC_AC1_5_HLEN10_0     (0x1u<<8)
#define JPEG_HUFFENC_AC1_5_HCODE10      (0xFFu<<0)
#define JPEG_HUFFENC_AC1_5_HCODE10_0    (0x1u<<0)

// HUFFENC_AC1_6 Configuration

#define JPEG_HUFFENC_AC1_6_HLEN13       (0xFu<<24)
#define JPEG_HUFFENC_AC1_6_HLEN13_0     (0x1u<<24)
#define JPEG_HUFFENC_AC1_6_HCODE13      (0xFFu<<16)
#define JPEG_HUFFENC_AC1_6_HCODE13_0    (0x1u<<16)
#define JPEG_HUFFENC_AC1_6_HLEN12       (0xFu<<8)
#define JPEG_HUFFENC_AC1_6_HLEN12_0     (0x1u<<8)
#define JPEG_HUFFENC_AC1_6_HCODE12      (0xFFu<<0)
#define JPEG_HUFFENC_AC1_6_HCODE12_0    (0x1u<<0)

// HUFFENC_AC1_7 Configuration

#define JPEG_HUFFENC_AC1_7_HLEN15       (0xFu<<24)
#define JPEG_HUFFENC_AC1_7_HLEN15_0     (0x1u<<24)
#define JPEG_HUFFENC_AC1_7_HCODE15      (0xFFu<<16)
#define JPEG_HUFFENC_AC1_7_HCODE15_0    (0x1u<<16)
#define JPEG_HUFFENC_AC1_7_HLEN14       (0xFu<<8)
#define JPEG_HUFFENC_AC1_7_HLEN14_0     (0x1u<<8)
#define JPEG_HUFFENC_AC1_7_HCODE14      (0xFFu<<0)
#define JPEG_HUFFENC_AC1_7_HCODE14_0    (0x1u<<0)

// HUFFENC_AC1_8 Configuration

#define JPEG_HUFFENC_AC1_8_HLEN17       (0xFu<<24)
#define JPEG_HUFFENC_AC1_8_HLEN17_0     (0x1u<<24)
#define JPEG_HUFFENC_AC1_8_HCODE17      (0xFFu<<16)
#define JPEG_HUFFENC_AC1_8_HCODE17_0    (0x1u<<16)
#define JPEG_HUFFENC_AC1_8_HLEN16       (0xFu<<8)
#define JPEG_HUFFENC_AC1_8_HLEN16_0     (0x1u<<8)
#define JPEG_HUFFENC_AC1_8_HCODE16      (0xFFu<<0)
#define JPEG_HUFFENC_AC1_8_HCODE16_0    (0x1u<<0)

// HUFFENC_AC1_9 Configuration

#define JPEG_HUFFENC_AC1_9_HLEN19       (0xFu<<24)
#define JPEG_HUFFENC_AC1_9_HLEN19_0     (0x1u<<24)
#define JPEG_HUFFENC_AC1_9_HCODE19      (0xFFu<<16)
#define JPEG_HUFFENC_AC1_9_HCODE19_0    (0x1u<<16)
#define JPEG_HUFFENC_AC1_9_HLEN18       (0xFu<<8)
#define JPEG_HUFFENC_AC1_9_HLEN18_0     (0x1u<<8)
#define JPEG_HUFFENC_AC1_9_HCODE18      (0xFFu<<0)
#define JPEG_HUFFENC_AC1_9_HCODE18_0    (0x1u<<0)

// HUFFENC_AC1_10 Configuration

#define JPEG_HUFFENC_AC1_10_HLEN21      (0xFu<<24)
#define JPEG_HUFFENC_AC1_10_HLEN21_0    (0x1u<<24)
#define JPEG_HUFFENC_AC1_10_HCODE21     (0xFFu<<16)
#define JPEG_HUFFENC_AC1_10_HCODE21_0   (0x1u<<16)
#define JPEG_HUFFENC_AC1_10_HLEN20      (0xFu<<8)
#define JPEG_HUFFENC_AC1_10_HLEN20_0    (0x1u<<8)
#define JPEG_HUFFENC_AC1_10_HCODE20     (0xFFu<<0)
#define JPEG_HUFFENC_AC1_10_HCODE20_0   (0x1u<<0)

// HUFFENC_AC1_11 Configuration

#define JPEG_HUFFENC_AC1_11_HLEN23      (0xFu<<24)
#define JPEG_HUFFENC_AC1_11_HLEN23_0    (0x1u<<24)
#define JPEG_HUFFENC_AC1_11_HCODE23     (0xFFu<<16)
#define JPEG_HUFFENC_AC1_11_HCODE23_0   (0x1u<<16)
#define JPEG_HUFFENC_AC1_11_HLEN22      (0xFu<<8)
#define JPEG_HUFFENC_AC1_11_HLEN22_0    (0x1u<<8)
#define JPEG_HUFFENC_AC1_11_HCODE22     (0xFFu<<0)
#define JPEG_HUFFENC_AC1_11_HCODE22_0   (0x1u<<0)

// HUFFENC_AC1_12 Configuration

#define JPEG_HUFFENC_AC1_12_HLEN25      (0xFu<<24)
#define JPEG_HUFFENC_AC1_12_HLEN25_0    (0x1u<<24)
#define JPEG_HUFFENC_AC1_12_HCODE25     (0xFFu<<16)
#define JPEG_HUFFENC_AC1_12_HCODE25_0   (0x1u<<16)
#define JPEG_HUFFENC_AC1_12_HLEN24      (0xFu<<8)
#define JPEG_HUFFENC_AC1_12_HLEN24_0    (0x1u<<8)
#define JPEG_HUFFENC_AC1_12_HCODE24     (0xFFu<<0)
#define JPEG_HUFFENC_AC1_12_HCODE24_0   (0x1u<<0)

// HUFFENC_AC1_13 Configuration

#define JPEG_HUFFENC_AC1_13_HLEN27      (0xFu<<24)
#define JPEG_HUFFENC_AC1_13_HLEN27_0    (0x1u<<24)
#define JPEG_HUFFENC_AC1_13_HCODE27     (0xFFu<<16)
#define JPEG_HUFFENC_AC1_13_HCODE27_0   (0x1u<<16)
#define JPEG_HUFFENC_AC1_13_HLEN26      (0xFu<<8)
#define JPEG_HUFFENC_AC1_13_HLEN26_0    (0x1u<<8)
#define JPEG_HUFFENC_AC1_13_HCODE26     (0xFFu<<0)
#define JPEG_HUFFENC_AC1_13_HCODE26_0   (0x1u<<0)

// HUFFENC_AC1_14 Configuration

#define JPEG_HUFFENC_AC1_14_HLEN29      (0xFu<<24)
#define JPEG_HUFFENC_AC1_14_HLEN29_0    (0x1u<<24)
#define JPEG_HUFFENC_AC1_14_HCODE29     (0xFFu<<16)
#define JPEG_HUFFENC_AC1_14_HCODE29_0   (0x1u<<16)
#define JPEG_HUFFENC_AC1_14_HLEN28      (0xFu<<8)
#define JPEG_HUFFENC_AC1_14_HLEN28_0    (0x1u<<8)
#define JPEG_HUFFENC_AC1_14_HCODE28     (0xFFu<<0)
#define JPEG_HUFFENC_AC1_14_HCODE28_0   (0x1u<<0)

// HUFFENC_AC1_15 Configuration

#define JPEG_HUFFENC_AC1_15_HLEN31      (0xFu<<24)
#define JPEG_HUFFENC_AC1_15_HLEN31_0    (0x1u<<24)
#define JPEG_HUFFENC_AC1_15_HCODE31     (0xFFu<<16)
#define JPEG_HUFFENC_AC1_15_HCODE31_0   (0x1u<<16)
#define JPEG_HUFFENC_AC1_15_HLEN30      (0xFu<<8)
#define JPEG_HUFFENC_AC1_15_HLEN30_0    (0x1u<<8)
#define JPEG_HUFFENC_AC1_15_HCODE30     (0xFFu<<0)
#define JPEG_HUFFENC_AC1_15_HCODE30_0   (0x1u<<0)

// HUFFENC_AC1_16 Configuration

#define JPEG_HUFFENC_AC1_16_HLEN33      (0xFu<<24)
#define JPEG_HUFFENC_AC1_16_HLEN33_0    (0x1u<<24)
#define JPEG_HUFFENC_AC1_16_HCODE33     (0xFFu<<16)
#define JPEG_HUFFENC_AC1_16_HCODE33_0   (0x1u<<16)
#define JPEG_HUFFENC_AC1_16_HLEN32      (0xFu<<8)
#define JPEG_HUFFENC_AC1_16_HLEN32_0    (0x1u<<8)
#define JPEG_HUFFENC_AC1_16_HCODE32     (0xFFu<<0)
#define JPEG_HUFFENC_AC1_16_HCODE32_0   (0x1u<<0)

// HUFFENC_AC1_17 Configuration

#define JPEG_HUFFENC_AC1_17_HLEN35      (0xFu<<24)
#define JPEG_HUFFENC_AC1_17_HLEN35_0    (0x1u<<24)
#define JPEG_HUFFENC_AC1_17_HCODE35     (0xFFu<<16)
#define JPEG_HUFFENC_AC1_17_HCODE35_0   (0x1u<<16)
#define JPEG_HUFFENC_AC1_17_HLEN34      (0xFu<<8)
#define JPEG_HUFFENC_AC1_17_HLEN34_0    (0x1u<<8)
#define JPEG_HUFFENC_AC1_17_HCODE34     (0xFFu<<0)
#define JPEG_HUFFENC_AC1_17_HCODE34_0   (0x1u<<0)

