Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_jpeg.h
// HUFFENC_AC1_18 Configuration

#define JPEG_HUFFENC_AC1_18_HLEN37      (0xFu<<24)
#define JPEG_HUFFENC_AC1_18_HLEN37_0    (0x1u<<24)
#define JPEG_HUFFENC_AC1_18_HCODE37     (0xFFu<<16)
#define JPEG_HUFFENC_AC1_18_HCODE37_0   (0x1u<<16)
#define JPEG_HUFFENC_AC1_18_HLEN36      (0xFu<<8)
#define JPEG_HUFFENC_AC1_18_HLEN36_0    (0x1u<<8)
#define JPEG_HUFFENC_AC1_18_HCODE36     (0xFFu<<0)
#define JPEG_HUFFENC_AC1_18_HCODE36_0   (0x1u<<0)

// HUFFENC_AC1_19 Configuration

#define JPEG_HUFFENC_AC1_19_HLEN39      (0xFu<<24)
#define JPEG_HUFFENC_AC1_19_HLEN39_0    (0x1u<<24)
#define JPEG_HUFFENC_AC1_19_HCODE39     (0xFFu<<16)
#define JPEG_HUFFENC_AC1_19_HCODE39_0   (0x1u<<16)
#define JPEG_HUFFENC_AC1_19_HLEN38      (0xFu<<8)
#define JPEG_HUFFENC_AC1_19_HLEN38_0    (0x1u<<8)
#define JPEG_HUFFENC_AC1_19_HCODE38     (0xFFu<<0)
#define JPEG_HUFFENC_AC1_19_HCODE38_0   (0x1u<<0)

// HUFFENC_AC1_20 Configuration

#define JPEG_HUFFENC_AC1_20_HLEN41      (0xFu<<24)
#define JPEG_HUFFENC_AC1_20_HLEN41_0    (0x1u<<24)
#define JPEG_HUFFENC_AC1_20_HCODE41     (0xFFu<<16)
#define JPEG_HUFFENC_AC1_20_HCODE41_0   (0x1u<<16)
#define JPEG_HUFFENC_AC1_20_HLEN40      (0xFu<<8)
#define JPEG_HUFFENC_AC1_20_HLEN40_0    (0x1u<<8)
#define JPEG_HUFFENC_AC1_20_HCODE40     (0xFFu<<0)
#define JPEG_HUFFENC_AC1_20_HCODE40_0   (0x1u<<0)

// HUFFENC_AC1_21 Configuration

#define JPEG_HUFFENC_AC1_21_HLEN43      (0xFu<<24)
#define JPEG_HUFFENC_AC1_21_HLEN43_0    (0x1u<<24)
#define JPEG_HUFFENC_AC1_21_HCODE43     (0xFFu<<16)
#define JPEG_HUFFENC_AC1_21_HCODE43_0   (0x1u<<16)
#define JPEG_HUFFENC_AC1_21_HLEN42      (0xFu<<8)
#define JPEG_HUFFENC_AC1_21_HLEN42_0    (0x1u<<8)
#define JPEG_HUFFENC_AC1_21_HCODE42     (0xFFu<<0)
#define JPEG_HUFFENC_AC1_21_HCODE42_0   (0x1u<<0)

// HUFFENC_AC1_22 Configuration

#define JPEG_HUFFENC_AC1_22_HLEN45      (0xFu<<24)
#define JPEG_HUFFENC_AC1_22_HLEN45_0    (0x1u<<24)
#define JPEG_HUFFENC_AC1_22_HCODE45     (0xFFu<<16)
#define JPEG_HUFFENC_AC1_22_HCODE45_0   (0x1u<<16)
#define JPEG_HUFFENC_AC1_22_HLEN44      (0xFu<<8)
#define JPEG_HUFFENC_AC1_22_HLEN44_0    (0x1u<<8)
#define JPEG_HUFFENC_AC1_22_HCODE44     (0xFFu<<0)
#define JPEG_HUFFENC_AC1_22_HCODE44_0   (0x1u<<0)

// HUFFENC_AC1_23 Configuration

#define JPEG_HUFFENC_AC1_23_HLEN47      (0xFu<<24)
#define JPEG_HUFFENC_AC1_23_HLEN47_0    (0x1u<<24)
#define JPEG_HUFFENC_AC1_23_HCODE47     (0xFFu<<16)
#define JPEG_HUFFENC_AC1_23_HCODE47_0   (0x1u<<16)
#define JPEG_HUFFENC_AC1_23_HLEN46      (0xFu<<8)
#define JPEG_HUFFENC_AC1_23_HLEN46_0    (0x1u<<8)
#define JPEG_HUFFENC_AC1_23_HCODE46     (0xFFu<<0)
#define JPEG_HUFFENC_AC1_23_HCODE46_0   (0x1u<<0)

// HUFFENC_AC1_24 Configuration

#define JPEG_HUFFENC_AC1_24_HLEN49      (0xFu<<24)
#define JPEG_HUFFENC_AC1_24_HLEN49_0    (0x1u<<24)
#define JPEG_HUFFENC_AC1_24_HCODE49     (0xFFu<<16)
#define JPEG_HUFFENC_AC1_24_HCODE49_0   (0x1u<<16)
#define JPEG_HUFFENC_AC1_24_HLEN48      (0xFu<<8)
#define JPEG_HUFFENC_AC1_24_HLEN48_0    (0x1u<<8)
#define JPEG_HUFFENC_AC1_24_HCODE48     (0xFFu<<0)
#define JPEG_HUFFENC_AC1_24_HCODE48_0   (0x1u<<0)

// HUFFENC_AC1_25 Configuration

#define JPEG_HUFFENC_AC1_25_HLEN51      (0xFu<<24)
#define JPEG_HUFFENC_AC1_25_HLEN51_0    (0x1u<<24)
#define JPEG_HUFFENC_AC1_25_HCODE51     (0xFFu<<16)
#define JPEG_HUFFENC_AC1_25_HCODE51_0   (0x1u<<16)
#define JPEG_HUFFENC_AC1_25_HLEN50      (0xFu<<8)
#define JPEG_HUFFENC_AC1_25_HLEN50_0    (0x1u<<8)
#define JPEG_HUFFENC_AC1_25_HCODE50     (0xFFu<<0)
#define JPEG_HUFFENC_AC1_25_HCODE50_0   (0x1u<<0)

// HUFFENC_AC1_26 Configuration

#define JPEG_HUFFENC_AC1_26_HLEN53      (0xFu<<24)
#define JPEG_HUFFENC_AC1_26_HLEN53_0    (0x1u<<24)
#define JPEG_HUFFENC_AC1_26_HCODE53     (0xFFu<<16)
#define JPEG_HUFFENC_AC1_26_HCODE53_0   (0x1u<<16)
#define JPEG_HUFFENC_AC1_26_HLEN52      (0xFu<<8)
#define JPEG_HUFFENC_AC1_26_HLEN52_0    (0x1u<<8)
#define JPEG_HUFFENC_AC1_26_HCODE52     (0xFFu<<0)
#define JPEG_HUFFENC_AC1_26_HCODE52_0   (0x1u<<0)

// HUFFENC_AC1_27 Configuration

#define JPEG_HUFFENC_AC1_27_HLEN55      (0xFu<<24)
#define JPEG_HUFFENC_AC1_27_HLEN55_0    (0x1u<<24)
#define JPEG_HUFFENC_AC1_27_HCODE55     (0xFFu<<16)
#define JPEG_HUFFENC_AC1_27_HCODE55_0   (0x1u<<16)
#define JPEG_HUFFENC_AC1_27_HLEN54      (0xFu<<8)
#define JPEG_HUFFENC_AC1_27_HLEN54_0    (0x1u<<8)
#define JPEG_HUFFENC_AC1_27_HCODE54     (0xFFu<<0)
#define JPEG_HUFFENC_AC1_27_HCODE54_0   (0x1u<<0)

// HUFFENC_AC1_28 Configuration

#define JPEG_HUFFENC_AC1_28_HLEN57      (0xFu<<24)
#define JPEG_HUFFENC_AC1_28_HLEN57_0    (0x1u<<24)
#define JPEG_HUFFENC_AC1_28_HCODE57     (0xFFu<<16)
#define JPEG_HUFFENC_AC1_28_HCODE57_0   (0x1u<<16)
#define JPEG_HUFFENC_AC1_28_HLEN56      (0xFu<<8)
#define JPEG_HUFFENC_AC1_28_HLEN56_0    (0x1u<<8)
#define JPEG_HUFFENC_AC1_28_HCODE56     (0xFFu<<0)
#define JPEG_HUFFENC_AC1_28_HCODE56_0   (0x1u<<0)

// HUFFENC_AC1_29 Configuration

#define JPEG_HUFFENC_AC1_29_HLEN59      (0xFu<<24)
#define JPEG_HUFFENC_AC1_29_HLEN59_0    (0x1u<<24)
#define JPEG_HUFFENC_AC1_29_HCODE59     (0xFFu<<16)
#define JPEG_HUFFENC_AC1_29_HCODE59_0   (0x1u<<16)
#define JPEG_HUFFENC_AC1_29_HLEN58      (0xFu<<8)
#define JPEG_HUFFENC_AC1_29_HLEN58_0    (0x1u<<8)
#define JPEG_HUFFENC_AC1_29_HCODE58     (0xFFu<<0)
#define JPEG_HUFFENC_AC1_29_HCODE58_0   (0x1u<<0)

// HUFFENC_AC1_30 Configuration

#define JPEG_HUFFENC_AC1_30_HLEN61      (0xFu<<24)
#define JPEG_HUFFENC_AC1_30_HLEN61_0    (0x1u<<24)
#define JPEG_HUFFENC_AC1_30_HCODE61     (0xFFu<<16)
#define JPEG_HUFFENC_AC1_30_HCODE61_0   (0x1u<<16)
#define JPEG_HUFFENC_AC1_30_HLEN60      (0xFu<<8)
#define JPEG_HUFFENC_AC1_30_HLEN60_0    (0x1u<<8)
#define JPEG_HUFFENC_AC1_30_HCODE60     (0xFFu<<0)
#define JPEG_HUFFENC_AC1_30_HCODE60_0   (0x1u<<0)

// HUFFENC_AC1_31 Configuration

#define JPEG_HUFFENC_AC1_31_HLEN63      (0xFu<<24)
#define JPEG_HUFFENC_AC1_31_HLEN63_0    (0x1u<<24)
#define JPEG_HUFFENC_AC1_31_HCODE63     (0xFFu<<16)
#define JPEG_HUFFENC_AC1_31_HCODE63_0   (0x1u<<16)
#define JPEG_HUFFENC_AC1_31_HLEN62      (0xFu<<8)
#define JPEG_HUFFENC_AC1_31_HLEN62_0    (0x1u<<8)
#define JPEG_HUFFENC_AC1_31_HCODE62     (0xFFu<<0)
#define JPEG_HUFFENC_AC1_31_HCODE62_0   (0x1u<<0)

// HUFFENC_AC1_32 Configuration

#define JPEG_HUFFENC_AC1_32_HLEN65      (0xFu<<24)
#define JPEG_HUFFENC_AC1_32_HLEN65_0    (0x1u<<24)
#define JPEG_HUFFENC_AC1_32_HCODE65     (0xFFu<<16)
#define JPEG_HUFFENC_AC1_32_HCODE65_0   (0x1u<<16)
#define JPEG_HUFFENC_AC1_32_HLEN64      (0xFu<<8)
#define JPEG_HUFFENC_AC1_32_HLEN64_0    (0x1u<<8)
#define JPEG_HUFFENC_AC1_32_HCODE64     (0xFFu<<0)
#define JPEG_HUFFENC_AC1_32_HCODE64_0   (0x1u<<0)

// HUFFENC_AC1_33 Configuration

#define JPEG_HUFFENC_AC1_33_HLEN67      (0xFu<<24)
#define JPEG_HUFFENC_AC1_33_HLEN67_0    (0x1u<<24)
#define JPEG_HUFFENC_AC1_33_HCODE67     (0xFFu<<16)
#define JPEG_HUFFENC_AC1_33_HCODE67_0   (0x1u<<16)
#define JPEG_HUFFENC_AC1_33_HLEN66      (0xFu<<8)
#define JPEG_HUFFENC_AC1_33_HLEN66_0    (0x1u<<8)
#define JPEG_HUFFENC_AC1_33_HCODE66     (0xFFu<<0)
#define JPEG_HUFFENC_AC1_33_HCODE66_0   (0x1u<<0)

// HUFFENC_AC1_34 Configuration

#define JPEG_HUFFENC_AC1_34_HLEN69      (0xFu<<24)
#define JPEG_HUFFENC_AC1_34_HLEN69_0    (0x1u<<24)
#define JPEG_HUFFENC_AC1_34_HCODE69     (0xFFu<<16)
#define JPEG_HUFFENC_AC1_34_HCODE69_0   (0x1u<<16)
#define JPEG_HUFFENC_AC1_34_HLEN68      (0xFu<<8)
#define JPEG_HUFFENC_AC1_34_HLEN68_0    (0x1u<<8)
#define JPEG_HUFFENC_AC1_34_HCODE68     (0xFFu<<0)
#define JPEG_HUFFENC_AC1_34_HCODE68_0   (0x1u<<0)

// HUFFENC_AC1_35 Configuration

#define JPEG_HUFFENC_AC1_35_HLEN71      (0xFu<<24)
#define JPEG_HUFFENC_AC1_35_HLEN71_0    (0x1u<<24)
#define JPEG_HUFFENC_AC1_35_HCODE71     (0xFFu<<16)
#define JPEG_HUFFENC_AC1_35_HCODE71_0   (0x1u<<16)
#define JPEG_HUFFENC_AC1_35_HLEN70      (0xFu<<8)
#define JPEG_HUFFENC_AC1_35_HLEN70_0    (0x1u<<8)
#define JPEG_HUFFENC_AC1_35_HCODE70     (0xFFu<<0)
#define JPEG_HUFFENC_AC1_35_HCODE70_0   (0x1u<<0)

// HUFFENC_AC1_36 Configuration

