Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_jpeg.h
#define JPEG_HUFFENC_AC1_36_HLEN73      (0xFu<<24)
#define JPEG_HUFFENC_AC1_36_HLEN73_0    (0x1u<<24)
#define JPEG_HUFFENC_AC1_36_HCODE73     (0xFFu<<16)
#define JPEG_HUFFENC_AC1_36_HCODE73_0   (0x1u<<16)
#define JPEG_HUFFENC_AC1_36_HLEN72      (0xFu<<8)
#define JPEG_HUFFENC_AC1_36_HLEN72_0    (0x1u<<8)
#define JPEG_HUFFENC_AC1_36_HCODE72     (0xFFu<<0)
#define JPEG_HUFFENC_AC1_36_HCODE72_0   (0x1u<<0)

// HUFFENC_AC1_37 Configuration

#define JPEG_HUFFENC_AC1_37_HLEN75      (0xFu<<24)
#define JPEG_HUFFENC_AC1_37_HLEN75_0    (0x1u<<24)
#define JPEG_HUFFENC_AC1_37_HCODE75     (0xFFu<<16)
#define JPEG_HUFFENC_AC1_37_HCODE75_0   (0x1u<<16)
#define JPEG_HUFFENC_AC1_37_HLEN74      (0xFu<<8)
#define JPEG_HUFFENC_AC1_37_HLEN74_0    (0x1u<<8)
#define JPEG_HUFFENC_AC1_37_HCODE74     (0xFFu<<0)
#define JPEG_HUFFENC_AC1_37_HCODE74_0   (0x1u<<0)

// HUFFENC_AC1_38 Configuration

#define JPEG_HUFFENC_AC1_38_HLEN77      (0xFu<<24)
#define JPEG_HUFFENC_AC1_38_HLEN77_0    (0x1u<<24)
#define JPEG_HUFFENC_AC1_38_HCODE77     (0xFFu<<16)
#define JPEG_HUFFENC_AC1_38_HCODE77_0   (0x1u<<16)
#define JPEG_HUFFENC_AC1_38_HLEN76      (0xFu<<8)
#define JPEG_HUFFENC_AC1_38_HLEN76_0    (0x1u<<8)
#define JPEG_HUFFENC_AC1_38_HCODE76     (0xFFu<<0)
#define JPEG_HUFFENC_AC1_38_HCODE76_0   (0x1u<<0)

// HUFFENC_AC1_39 Configuration

#define JPEG_HUFFENC_AC1_39_HLEN79      (0xFu<<24)
#define JPEG_HUFFENC_AC1_39_HLEN79_0    (0x1u<<24)
#define JPEG_HUFFENC_AC1_39_HCODE79     (0xFFu<<16)
#define JPEG_HUFFENC_AC1_39_HCODE79_0   (0x1u<<16)
#define JPEG_HUFFENC_AC1_39_HLEN78      (0xFu<<8)
#define JPEG_HUFFENC_AC1_39_HLEN78_0    (0x1u<<8)
#define JPEG_HUFFENC_AC1_39_HCODE78     (0xFFu<<0)
#define JPEG_HUFFENC_AC1_39_HCODE78_0   (0x1u<<0)

// HUFFENC_AC1_40 Configuration

#define JPEG_HUFFENC_AC1_40_HLEN81      (0xFu<<24)
#define JPEG_HUFFENC_AC1_40_HLEN81_0    (0x1u<<24)
#define JPEG_HUFFENC_AC1_40_HCODE81     (0xFFu<<16)
#define JPEG_HUFFENC_AC1_40_HCODE81_0   (0x1u<<16)
#define JPEG_HUFFENC_AC1_40_HLEN80      (0xFu<<8)
#define JPEG_HUFFENC_AC1_40_HLEN80_0    (0x1u<<8)
#define JPEG_HUFFENC_AC1_40_HCODE80     (0xFFu<<0)
#define JPEG_HUFFENC_AC1_40_HCODE80_0   (0x1u<<0)

// HUFFENC_AC1_41 Configuration

#define JPEG_HUFFENC_AC1_41_HLEN83      (0xFu<<24)
#define JPEG_HUFFENC_AC1_41_HLEN83_0    (0x1u<<24)
#define JPEG_HUFFENC_AC1_41_HCODE83     (0xFFu<<16)
#define JPEG_HUFFENC_AC1_41_HCODE83_0   (0x1u<<16)
#define JPEG_HUFFENC_AC1_41_HLEN82      (0xFu<<8)
#define JPEG_HUFFENC_AC1_41_HLEN82_0    (0x1u<<8)
#define JPEG_HUFFENC_AC1_41_HCODE82     (0xFFu<<0)
#define JPEG_HUFFENC_AC1_41_HCODE82_0   (0x1u<<0)

// HUFFENC_AC1_42 Configuration

#define JPEG_HUFFENC_AC1_42_HLEN85      (0xFu<<24)
#define JPEG_HUFFENC_AC1_42_HLEN85_0    (0x1u<<24)
#define JPEG_HUFFENC_AC1_42_HCODE85     (0xFFu<<16)
#define JPEG_HUFFENC_AC1_42_HCODE85_0   (0x1u<<16)
#define JPEG_HUFFENC_AC1_42_HLEN84      (0xFu<<8)
#define JPEG_HUFFENC_AC1_42_HLEN84_0    (0x1u<<8)
#define JPEG_HUFFENC_AC1_42_HCODE84     (0xFFu<<0)
#define JPEG_HUFFENC_AC1_42_HCODE84_0   (0x1u<<0)

// HUFFENC_AC1_43 Configuration

#define JPEG_HUFFENC_AC1_43_HLEN87      (0xFu<<24)
#define JPEG_HUFFENC_AC1_43_HLEN87_0    (0x1u<<24)
#define JPEG_HUFFENC_AC1_43_HCODE87     (0xFFu<<16)
#define JPEG_HUFFENC_AC1_43_HCODE87_0   (0x1u<<16)
#define JPEG_HUFFENC_AC1_43_HLEN86      (0xFu<<8)
#define JPEG_HUFFENC_AC1_43_HLEN86_0    (0x1u<<8)
#define JPEG_HUFFENC_AC1_43_HCODE86     (0xFFu<<0)
#define JPEG_HUFFENC_AC1_43_HCODE86_0   (0x1u<<0)

// HUFFENC_AC1_44 Configuration

#define JPEG_HUFFENC_AC1_44_HLEN89      (0xFu<<24)
#define JPEG_HUFFENC_AC1_44_HLEN89_0    (0x1u<<24)
#define JPEG_HUFFENC_AC1_44_HCODE89     (0xFFu<<16)
#define JPEG_HUFFENC_AC1_44_HCODE89_0   (0x1u<<16)
#define JPEG_HUFFENC_AC1_44_HLEN88      (0xFu<<8)
#define JPEG_HUFFENC_AC1_44_HLEN88_0    (0x1u<<8)
#define JPEG_HUFFENC_AC1_44_HCODE88     (0xFFu<<0)
#define JPEG_HUFFENC_AC1_44_HCODE88_0   (0x1u<<0)

// HUFFENC_AC1_45 Configuration

#define JPEG_HUFFENC_AC1_45_HLEN91      (0xFu<<24)
#define JPEG_HUFFENC_AC1_45_HLEN91_0    (0x1u<<24)
#define JPEG_HUFFENC_AC1_45_HCODE91     (0xFFu<<16)
#define JPEG_HUFFENC_AC1_45_HCODE91_0   (0x1u<<16)
#define JPEG_HUFFENC_AC1_45_HLEN90      (0xFu<<8)
#define JPEG_HUFFENC_AC1_45_HLEN90_0    (0x1u<<8)
#define JPEG_HUFFENC_AC1_45_HCODE90     (0xFFu<<0)
#define JPEG_HUFFENC_AC1_45_HCODE90_0   (0x1u<<0)

// HUFFENC_AC1_46 Configuration

#define JPEG_HUFFENC_AC1_46_HLEN93      (0xFu<<24)
#define JPEG_HUFFENC_AC1_46_HLEN93_0    (0x1u<<24)
#define JPEG_HUFFENC_AC1_46_HCODE93     (0xFFu<<16)
#define JPEG_HUFFENC_AC1_46_HCODE93_0   (0x1u<<16)
#define JPEG_HUFFENC_AC1_46_HLEN92      (0xFu<<8)
#define JPEG_HUFFENC_AC1_46_HLEN92_0    (0x1u<<8)
#define JPEG_HUFFENC_AC1_46_HCODE92     (0xFFu<<0)
#define JPEG_HUFFENC_AC1_46_HCODE92_0   (0x1u<<0)

// HUFFENC_AC1_47 Configuration

#define JPEG_HUFFENC_AC1_47_HLEN95      (0xFu<<24)
#define JPEG_HUFFENC_AC1_47_HLEN95_0    (0x1u<<24)
#define JPEG_HUFFENC_AC1_47_HCODE95     (0xFFu<<16)
#define JPEG_HUFFENC_AC1_47_HCODE95_0   (0x1u<<16)
#define JPEG_HUFFENC_AC1_47_HLEN94      (0xFu<<8)
#define JPEG_HUFFENC_AC1_47_HLEN94_0    (0x1u<<8)
#define JPEG_HUFFENC_AC1_47_HCODE94     (0xFFu<<0)
#define JPEG_HUFFENC_AC1_47_HCODE94_0   (0x1u<<0)

// HUFFENC_AC1_48 Configuration

#define JPEG_HUFFENC_AC1_48_HLEN97      (0xFu<<24)
#define JPEG_HUFFENC_AC1_48_HLEN97_0    (0x1u<<24)
#define JPEG_HUFFENC_AC1_48_HCODE97     (0xFFu<<16)
#define JPEG_HUFFENC_AC1_48_HCODE97_0   (0x1u<<16)
#define JPEG_HUFFENC_AC1_48_HLEN96      (0xFu<<8)
#define JPEG_HUFFENC_AC1_48_HLEN96_0    (0x1u<<8)
#define JPEG_HUFFENC_AC1_48_HCODE96     (0xFFu<<0)
#define JPEG_HUFFENC_AC1_48_HCODE96_0   (0x1u<<0)

// HUFFENC_AC1_49 Configuration

#define JPEG_HUFFENC_AC1_49_HLEN99      (0xFu<<24)
#define JPEG_HUFFENC_AC1_49_HLEN99_0    (0x1u<<24)
#define JPEG_HUFFENC_AC1_49_HCODE99     (0xFFu<<16)
#define JPEG_HUFFENC_AC1_49_HCODE99_0   (0x1u<<16)
#define JPEG_HUFFENC_AC1_49_HLEN98      (0xFu<<8)
#define JPEG_HUFFENC_AC1_49_HLEN98_0    (0x1u<<8)
#define JPEG_HUFFENC_AC1_49_HCODE98     (0xFFu<<0)
#define JPEG_HUFFENC_AC1_49_HCODE98_0   (0x1u<<0)

