Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_jpeg.h
// HUFFENC_AC1_50 Configuration

#define JPEG_HUFFENC_AC1_50_HLEN101     (0xFu<<24)
#define JPEG_HUFFENC_AC1_50_HLEN101_0   (0x1u<<24)
#define JPEG_HUFFENC_AC1_50_HCODE101    (0xFFu<<16)
#define JPEG_HUFFENC_AC1_50_HCODE101_0  (0x1u<<16)
#define JPEG_HUFFENC_AC1_50_HLEN100     (0xFu<<8)
#define JPEG_HUFFENC_AC1_50_HLEN100_0   (0x1u<<8)
#define JPEG_HUFFENC_AC1_50_HCODE100    (0xFFu<<0)
#define JPEG_HUFFENC_AC1_50_HCODE100_0  (0x1u<<0)

// HUFFENC_AC1_51 Configuration

#define JPEG_HUFFENC_AC1_51_HLEN103     (0xFu<<24)
#define JPEG_HUFFENC_AC1_51_HLEN103_0   (0x1u<<24)
#define JPEG_HUFFENC_AC1_51_HCODE103    (0xFFu<<16)
#define JPEG_HUFFENC_AC1_51_HCODE103_0  (0x1u<<16)
#define JPEG_HUFFENC_AC1_51_HLEN102     (0xFu<<8)
#define JPEG_HUFFENC_AC1_51_HLEN102_0   (0x1u<<8)
#define JPEG_HUFFENC_AC1_51_HCODE102    (0xFFu<<0)
#define JPEG_HUFFENC_AC1_51_HCODE102_0  (0x1u<<0)

// HUFFENC_AC1_52 Configuration

#define JPEG_HUFFENC_AC1_52_HLEN105     (0xFu<<24)
#define JPEG_HUFFENC_AC1_52_HLEN105_0   (0x1u<<24)
#define JPEG_HUFFENC_AC1_52_HCODE105    (0xFFu<<16)
#define JPEG_HUFFENC_AC1_52_HCODE105_0  (0x1u<<16)
#define JPEG_HUFFENC_AC1_52_HLEN104     (0xFu<<8)
#define JPEG_HUFFENC_AC1_52_HLEN104_0   (0x1u<<8)
#define JPEG_HUFFENC_AC1_52_HCODE104    (0xFFu<<0)
#define JPEG_HUFFENC_AC1_52_HCODE104_0  (0x1u<<0)

// HUFFENC_AC1_53 Configuration

#define JPEG_HUFFENC_AC1_53_HLEN107     (0xFu<<24)
#define JPEG_HUFFENC_AC1_53_HLEN107_0   (0x1u<<24)
#define JPEG_HUFFENC_AC1_53_HCODE107    (0xFFu<<16)
#define JPEG_HUFFENC_AC1_53_HCODE107_0  (0x1u<<16)
#define JPEG_HUFFENC_AC1_53_HLEN106     (0xFu<<8)
#define JPEG_HUFFENC_AC1_53_HLEN106_0   (0x1u<<8)
#define JPEG_HUFFENC_AC1_53_HCODE106    (0xFFu<<0)
#define JPEG_HUFFENC_AC1_53_HCODE106_0  (0x1u<<0)

// HUFFENC_AC1_54 Configuration

#define JPEG_HUFFENC_AC1_54_HLEN109     (0xFu<<24)
#define JPEG_HUFFENC_AC1_54_HLEN109_0   (0x1u<<24)
#define JPEG_HUFFENC_AC1_54_HCODE109    (0xFFu<<16)
#define JPEG_HUFFENC_AC1_54_HCODE109_0  (0x1u<<16)
#define JPEG_HUFFENC_AC1_54_HLEN108     (0xFu<<8)
#define JPEG_HUFFENC_AC1_54_HLEN108_0   (0x1u<<8)
#define JPEG_HUFFENC_AC1_54_HCODE108    (0xFFu<<0)
#define JPEG_HUFFENC_AC1_54_HCODE108_0  (0x1u<<0)

// HUFFENC_AC1_55 Configuration

#define JPEG_HUFFENC_AC1_55_HLEN111     (0xFu<<24)
#define JPEG_HUFFENC_AC1_55_HLEN111_0   (0x1u<<24)
#define JPEG_HUFFENC_AC1_55_HCODE111    (0xFFu<<16)
#define JPEG_HUFFENC_AC1_55_HCODE111_0  (0x1u<<16)
#define JPEG_HUFFENC_AC1_55_HLEN110     (0xFu<<8)
#define JPEG_HUFFENC_AC1_55_HLEN110_0   (0x1u<<8)
#define JPEG_HUFFENC_AC1_55_HCODE110    (0xFFu<<0)
#define JPEG_HUFFENC_AC1_55_HCODE110_0  (0x1u<<0)

// HUFFENC_AC1_56 Configuration

#define JPEG_HUFFENC_AC1_56_HLEN113     (0xFu<<24)
#define JPEG_HUFFENC_AC1_56_HLEN113_0   (0x1u<<24)
#define JPEG_HUFFENC_AC1_56_HCODE113    (0xFFu<<16)
#define JPEG_HUFFENC_AC1_56_HCODE113_0  (0x1u<<16)
#define JPEG_HUFFENC_AC1_56_HLEN112     (0xFu<<8)
#define JPEG_HUFFENC_AC1_56_HLEN112_0   (0x1u<<8)
#define JPEG_HUFFENC_AC1_56_HCODE112    (0xFFu<<0)
#define JPEG_HUFFENC_AC1_56_HCODE112_0  (0x1u<<0)

// HUFFENC_AC1_57 Configuration

#define JPEG_HUFFENC_AC1_57_HLEN115     (0xFu<<24)
#define JPEG_HUFFENC_AC1_57_HLEN115_0   (0x1u<<24)
#define JPEG_HUFFENC_AC1_57_HCODE115    (0xFFu<<16)
#define JPEG_HUFFENC_AC1_57_HCODE115_0  (0x1u<<16)
#define JPEG_HUFFENC_AC1_57_HLEN114     (0xFu<<8)
#define JPEG_HUFFENC_AC1_57_HLEN114_0   (0x1u<<8)
#define JPEG_HUFFENC_AC1_57_HCODE114    (0xFFu<<0)
#define JPEG_HUFFENC_AC1_57_HCODE114_0  (0x1u<<0)

// HUFFENC_AC1_58 Configuration

#define JPEG_HUFFENC_AC1_58_HLEN117     (0xFu<<24)
#define JPEG_HUFFENC_AC1_58_HLEN117_0   (0x1u<<24)
#define JPEG_HUFFENC_AC1_58_HCODE117    (0xFFu<<16)
#define JPEG_HUFFENC_AC1_58_HCODE117_0  (0x1u<<16)
#define JPEG_HUFFENC_AC1_58_HLEN116     (0xFu<<8)
#define JPEG_HUFFENC_AC1_58_HLEN116_0   (0x1u<<8)
#define JPEG_HUFFENC_AC1_58_HCODE116    (0xFFu<<0)
#define JPEG_HUFFENC_AC1_58_HCODE116_0  (0x1u<<0)

// HUFFENC_AC1_59 Configuration

#define JPEG_HUFFENC_AC1_59_HLEN119     (0xFu<<24)
#define JPEG_HUFFENC_AC1_59_HLEN119_0   (0x1u<<24)
#define JPEG_HUFFENC_AC1_59_HCODE119    (0xFFu<<16)
#define JPEG_HUFFENC_AC1_59_HCODE119_0  (0x1u<<16)
#define JPEG_HUFFENC_AC1_59_HLEN118     (0xFu<<8)
#define JPEG_HUFFENC_AC1_59_HLEN118_0   (0x1u<<8)
#define JPEG_HUFFENC_AC1_59_HCODE118    (0xFFu<<0)
#define JPEG_HUFFENC_AC1_59_HCODE118_0  (0x1u<<0)

// HUFFENC_AC1_60 Configuration

#define JPEG_HUFFENC_AC1_60_HLEN121     (0xFu<<24)
#define JPEG_HUFFENC_AC1_60_HLEN121_0   (0x1u<<24)
#define JPEG_HUFFENC_AC1_60_HCODE121    (0xFFu<<16)
#define JPEG_HUFFENC_AC1_60_HCODE121_0  (0x1u<<16)
#define JPEG_HUFFENC_AC1_60_HLEN120     (0xFu<<8)
#define JPEG_HUFFENC_AC1_60_HLEN120_0   (0x1u<<8)
#define JPEG_HUFFENC_AC1_60_HCODE120    (0xFFu<<0)
#define JPEG_HUFFENC_AC1_60_HCODE120_0  (0x1u<<0)

// HUFFENC_AC1_61 Configuration

#define JPEG_HUFFENC_AC1_61_HLEN123     (0xFu<<24)
#define JPEG_HUFFENC_AC1_61_HLEN123_0   (0x1u<<24)
#define JPEG_HUFFENC_AC1_61_HCODE123    (0xFFu<<16)
#define JPEG_HUFFENC_AC1_61_HCODE123_0  (0x1u<<16)
#define JPEG_HUFFENC_AC1_61_HLEN122     (0xFu<<8)
#define JPEG_HUFFENC_AC1_61_HLEN122_0   (0x1u<<8)
#define JPEG_HUFFENC_AC1_61_HCODE122    (0xFFu<<0)
#define JPEG_HUFFENC_AC1_61_HCODE122_0  (0x1u<<0)

// HUFFENC_AC1_62 Configuration

#define JPEG_HUFFENC_AC1_62_HLEN125     (0xFu<<24)
#define JPEG_HUFFENC_AC1_62_HLEN125_0   (0x1u<<24)
#define JPEG_HUFFENC_AC1_62_HCODE125    (0xFFu<<16)
#define JPEG_HUFFENC_AC1_62_HCODE125_0  (0x1u<<16)
#define JPEG_HUFFENC_AC1_62_HLEN124     (0xFu<<8)
#define JPEG_HUFFENC_AC1_62_HLEN124_0   (0x1u<<8)
#define JPEG_HUFFENC_AC1_62_HCODE124    (0xFFu<<0)
#define JPEG_HUFFENC_AC1_62_HCODE124_0  (0x1u<<0)

// HUFFENC_AC1_63 Configuration

#define JPEG_HUFFENC_AC1_63_HLEN127     (0xFu<<24)
#define JPEG_HUFFENC_AC1_63_HLEN127_0   (0x1u<<24)
#define JPEG_HUFFENC_AC1_63_HCODE127    (0xFFu<<16)
#define JPEG_HUFFENC_AC1_63_HCODE127_0  (0x1u<<16)
#define JPEG_HUFFENC_AC1_63_HLEN126     (0xFu<<8)
#define JPEG_HUFFENC_AC1_63_HLEN126_0   (0x1u<<8)
#define JPEG_HUFFENC_AC1_63_HCODE126    (0xFFu<<0)
#define JPEG_HUFFENC_AC1_63_HCODE126_0  (0x1u<<0)

// HUFFENC_AC1_64 Configuration

