Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_jpeg.h
#define JPEG_HUFFENC_AC1_64_HLEN129     (0xFu<<24)
#define JPEG_HUFFENC_AC1_64_HLEN129_0   (0x1u<<24)
#define JPEG_HUFFENC_AC1_64_HCODE129    (0xFFu<<16)
#define JPEG_HUFFENC_AC1_64_HCODE129_0  (0x1u<<16)
#define JPEG_HUFFENC_AC1_64_HLEN128     (0xFu<<8)
#define JPEG_HUFFENC_AC1_64_HLEN128_0   (0x1u<<8)
#define JPEG_HUFFENC_AC1_64_HCODE128    (0xFFu<<0)
#define JPEG_HUFFENC_AC1_64_HCODE128_0  (0x1u<<0)

// HUFFENC_AC1_65 Configuration

#define JPEG_HUFFENC_AC1_65_HLEN131     (0xFu<<24)
#define JPEG_HUFFENC_AC1_65_HLEN131_0   (0x1u<<24)
#define JPEG_HUFFENC_AC1_65_HCODE131    (0xFFu<<16)
#define JPEG_HUFFENC_AC1_65_HCODE131_0  (0x1u<<16)
#define JPEG_HUFFENC_AC1_65_HLEN130     (0xFu<<8)
#define JPEG_HUFFENC_AC1_65_HLEN130_0   (0x1u<<8)
#define JPEG_HUFFENC_AC1_65_HCODE130    (0xFFu<<0)
#define JPEG_HUFFENC_AC1_65_HCODE130_0  (0x1u<<0)

// HUFFENC_AC1_66 Configuration

#define JPEG_HUFFENC_AC1_66_HLEN133     (0xFu<<24)
#define JPEG_HUFFENC_AC1_66_HLEN133_0   (0x1u<<24)
#define JPEG_HUFFENC_AC1_66_HCODE133    (0xFFu<<16)
#define JPEG_HUFFENC_AC1_66_HCODE133_0  (0x1u<<16)
#define JPEG_HUFFENC_AC1_66_HLEN132     (0xFu<<8)
#define JPEG_HUFFENC_AC1_66_HLEN132_0   (0x1u<<8)
#define JPEG_HUFFENC_AC1_66_HCODE132    (0xFFu<<0)
#define JPEG_HUFFENC_AC1_66_HCODE132_0  (0x1u<<0)

// HUFFENC_AC1_67 Configuration

#define JPEG_HUFFENC_AC1_67_HLEN135     (0xFu<<24)
#define JPEG_HUFFENC_AC1_67_HLEN135_0   (0x1u<<24)
#define JPEG_HUFFENC_AC1_67_HCODE135    (0xFFu<<16)
#define JPEG_HUFFENC_AC1_67_HCODE135_0  (0x1u<<16)
#define JPEG_HUFFENC_AC1_67_HLEN134     (0xFu<<8)
#define JPEG_HUFFENC_AC1_67_HLEN134_0   (0x1u<<8)
#define JPEG_HUFFENC_AC1_67_HCODE134    (0xFFu<<0)
#define JPEG_HUFFENC_AC1_67_HCODE134_0  (0x1u<<0)

// HUFFENC_AC1_68 Configuration

#define JPEG_HUFFENC_AC1_68_HLEN137     (0xFu<<24)
#define JPEG_HUFFENC_AC1_68_HLEN137_0   (0x1u<<24)
#define JPEG_HUFFENC_AC1_68_HCODE137    (0xFFu<<16)
#define JPEG_HUFFENC_AC1_68_HCODE137_0  (0x1u<<16)
#define JPEG_HUFFENC_AC1_68_HLEN136     (0xFu<<8)
#define JPEG_HUFFENC_AC1_68_HLEN136_0   (0x1u<<8)
#define JPEG_HUFFENC_AC1_68_HCODE136    (0xFFu<<0)
#define JPEG_HUFFENC_AC1_68_HCODE136_0  (0x1u<<0)

// HUFFENC_AC1_69 Configuration

#define JPEG_HUFFENC_AC1_69_HLEN139     (0xFu<<24)
#define JPEG_HUFFENC_AC1_69_HLEN139_0   (0x1u<<24)
#define JPEG_HUFFENC_AC1_69_HCODE139    (0xFFu<<16)
#define JPEG_HUFFENC_AC1_69_HCODE139_0  (0x1u<<16)
#define JPEG_HUFFENC_AC1_69_HLEN138     (0xFu<<8)
#define JPEG_HUFFENC_AC1_69_HLEN138_0   (0x1u<<8)
#define JPEG_HUFFENC_AC1_69_HCODE138    (0xFFu<<0)
#define JPEG_HUFFENC_AC1_69_HCODE138_0  (0x1u<<0)

// HUFFENC_AC1_70 Configuration

#define JPEG_HUFFENC_AC1_70_HLEN141     (0xFu<<24)
#define JPEG_HUFFENC_AC1_70_HLEN141_0   (0x1u<<24)
#define JPEG_HUFFENC_AC1_70_HCODE141    (0xFFu<<16)
#define JPEG_HUFFENC_AC1_70_HCODE141_0  (0x1u<<16)
#define JPEG_HUFFENC_AC1_70_HLEN140     (0xFu<<8)
#define JPEG_HUFFENC_AC1_70_HLEN140_0   (0x1u<<8)
#define JPEG_HUFFENC_AC1_70_HCODE140    (0xFFu<<0)
#define JPEG_HUFFENC_AC1_70_HCODE140_0  (0x1u<<0)

// HUFFENC_AC1_71 Configuration

#define JPEG_HUFFENC_AC1_71_HLEN143     (0xFu<<24)
#define JPEG_HUFFENC_AC1_71_HLEN143_0   (0x1u<<24)
#define JPEG_HUFFENC_AC1_71_HCODE143    (0xFFu<<16)
#define JPEG_HUFFENC_AC1_71_HCODE143_0  (0x1u<<16)
#define JPEG_HUFFENC_AC1_71_HLEN142     (0xFu<<8)
#define JPEG_HUFFENC_AC1_71_HLEN142_0   (0x1u<<8)
#define JPEG_HUFFENC_AC1_71_HCODE142    (0xFFu<<0)
#define JPEG_HUFFENC_AC1_71_HCODE142_0  (0x1u<<0)

// HUFFENC_AC1_72 Configuration

#define JPEG_HUFFENC_AC1_72_HLEN145     (0xFu<<24)
#define JPEG_HUFFENC_AC1_72_HLEN145_0   (0x1u<<24)
#define JPEG_HUFFENC_AC1_72_HCODE145    (0xFFu<<16)
#define JPEG_HUFFENC_AC1_72_HCODE145_0  (0x1u<<16)
#define JPEG_HUFFENC_AC1_72_HLEN144     (0xFu<<8)
#define JPEG_HUFFENC_AC1_72_HLEN144_0   (0x1u<<8)
#define JPEG_HUFFENC_AC1_72_HCODE144    (0xFFu<<0)
#define JPEG_HUFFENC_AC1_72_HCODE144_0  (0x1u<<0)

// HUFFENC_AC1_73 Configuration

#define JPEG_HUFFENC_AC1_73_HLEN147     (0xFu<<24)
#define JPEG_HUFFENC_AC1_73_HLEN147_0   (0x1u<<24)
#define JPEG_HUFFENC_AC1_73_HCODE147    (0xFFu<<16)
#define JPEG_HUFFENC_AC1_73_HCODE147_0  (0x1u<<16)
#define JPEG_HUFFENC_AC1_73_HLEN146     (0xFu<<8)
#define JPEG_HUFFENC_AC1_73_HLEN146_0   (0x1u<<8)
#define JPEG_HUFFENC_AC1_73_HCODE146    (0xFFu<<0)
#define JPEG_HUFFENC_AC1_73_HCODE146_0  (0x1u<<0)

// HUFFENC_AC1_74 Configuration

#define JPEG_HUFFENC_AC1_74_HLEN149     (0xFu<<24)
#define JPEG_HUFFENC_AC1_74_HLEN149_0   (0x1u<<24)
#define JPEG_HUFFENC_AC1_74_HCODE149    (0xFFu<<16)
#define JPEG_HUFFENC_AC1_74_HCODE149_0  (0x1u<<16)
#define JPEG_HUFFENC_AC1_74_HLEN148     (0xFu<<8)
#define JPEG_HUFFENC_AC1_74_HLEN148_0   (0x1u<<8)
#define JPEG_HUFFENC_AC1_74_HCODE148    (0xFFu<<0)
#define JPEG_HUFFENC_AC1_74_HCODE148_0  (0x1u<<0)

// HUFFENC_AC1_75 Configuration

#define JPEG_HUFFENC_AC1_75_HLEN151     (0xFu<<24)
#define JPEG_HUFFENC_AC1_75_HLEN151_0   (0x1u<<24)
#define JPEG_HUFFENC_AC1_75_HCODE151    (0xFFu<<16)
#define JPEG_HUFFENC_AC1_75_HCODE151_0  (0x1u<<16)
#define JPEG_HUFFENC_AC1_75_HLEN150     (0xFu<<8)
#define JPEG_HUFFENC_AC1_75_HLEN150_0   (0x1u<<8)
#define JPEG_HUFFENC_AC1_75_HCODE150    (0xFFu<<0)
#define JPEG_HUFFENC_AC1_75_HCODE150_0  (0x1u<<0)

// HUFFENC_AC1_76 Configuration

#define JPEG_HUFFENC_AC1_76_HLEN153     (0xFu<<24)
#define JPEG_HUFFENC_AC1_76_HLEN153_0   (0x1u<<24)
#define JPEG_HUFFENC_AC1_76_HCODE153    (0xFFu<<16)
#define JPEG_HUFFENC_AC1_76_HCODE153_0  (0x1u<<16)
#define JPEG_HUFFENC_AC1_76_HLEN152     (0xFu<<8)
#define JPEG_HUFFENC_AC1_76_HLEN152_0   (0x1u<<8)
#define JPEG_HUFFENC_AC1_76_HCODE152    (0xFFu<<0)
#define JPEG_HUFFENC_AC1_76_HCODE152_0  (0x1u<<0)

// HUFFENC_AC1_77 Configuration

#define JPEG_HUFFENC_AC1_77_HLEN155     (0xFu<<24)
#define JPEG_HUFFENC_AC1_77_HLEN155_0   (0x1u<<24)
#define JPEG_HUFFENC_AC1_77_HCODE155    (0xFFu<<16)
#define JPEG_HUFFENC_AC1_77_HCODE155_0  (0x1u<<16)
#define JPEG_HUFFENC_AC1_77_HLEN154     (0xFu<<8)
#define JPEG_HUFFENC_AC1_77_HLEN154_0   (0x1u<<8)
#define JPEG_HUFFENC_AC1_77_HCODE154    (0xFFu<<0)
#define JPEG_HUFFENC_AC1_77_HCODE154_0  (0x1u<<0)

