Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_jpeg.h
// HUFFENC_DC0_4 Configuration

#define JPEG_HUFFENC_DC0_4_HLEN9        (0xFu<<24)
#define JPEG_HUFFENC_DC0_4_HLEN9_0      (0x1u<<24)
#define JPEG_HUFFENC_DC0_4_HCODE9       (0xFFu<<16)
#define JPEG_HUFFENC_DC0_4_HCODE9_0     (0x1u<<16)
#define JPEG_HUFFENC_DC0_4_HLEN8        (0xFu<<8)
#define JPEG_HUFFENC_DC0_4_HLEN8_0      (0x1u<<8)
#define JPEG_HUFFENC_DC0_4_HCODE8       (0xFFu<<0)
#define JPEG_HUFFENC_DC0_4_HCODE8_0     (0x1u<<0)

// HUFFENC_DC0_5 Configuration

#define JPEG_HUFFENC_DC0_5_HLEN11       (0xFu<<24)
#define JPEG_HUFFENC_DC0_5_HLEN11_0     (0x1u<<24)
#define JPEG_HUFFENC_DC0_5_HCODE11      (0xFFu<<16)
#define JPEG_HUFFENC_DC0_5_HCODE11_0    (0x1u<<16)
#define JPEG_HUFFENC_DC0_5_HLEN10       (0xFu<<8)
#define JPEG_HUFFENC_DC0_5_HLEN10_0     (0x1u<<8)
#define JPEG_HUFFENC_DC0_5_HCODE10      (0xFFu<<0)
#define JPEG_HUFFENC_DC0_5_HCODE10_0    (0x1u<<0)

// HUFFENC_DC0_6 Configuration

#define JPEG_HUFFENC_DC0_6_HLEN13       (0xFu<<24)
#define JPEG_HUFFENC_DC0_6_HLEN13_0     (0x1u<<24)
#define JPEG_HUFFENC_DC0_6_HCODE13      (0xFFu<<16)
#define JPEG_HUFFENC_DC0_6_HCODE13_0    (0x1u<<16)
#define JPEG_HUFFENC_DC0_6_HLEN12       (0xFu<<8)
#define JPEG_HUFFENC_DC0_6_HLEN12_0     (0x1u<<8)
#define JPEG_HUFFENC_DC0_6_HCODE12      (0xFFu<<0)
#define JPEG_HUFFENC_DC0_6_HCODE12_0    (0x1u<<0)

// HUFFENC_DC0_7 Configuration

#define JPEG_HUFFENC_DC0_7_HLEN15       (0xFu<<24)
#define JPEG_HUFFENC_DC0_7_HLEN15_0     (0x1u<<24)
#define JPEG_HUFFENC_DC0_7_HCODE15      (0xFFu<<16)
#define JPEG_HUFFENC_DC0_7_HCODE15_0    (0x1u<<16)
#define JPEG_HUFFENC_DC0_7_HLEN14       (0xFu<<8)
#define JPEG_HUFFENC_DC0_7_HLEN14_0     (0x1u<<8)
#define JPEG_HUFFENC_DC0_7_HCODE14      (0xFFu<<0)
#define JPEG_HUFFENC_DC0_7_HCODE14_0    (0x1u<<0)

// HUFFENC_DC1_0 Configuration

#define JPEG_HUFFENC_DC1_0_HLEN1        (0xFu<<24)
#define JPEG_HUFFENC_DC1_0_HLEN1_0      (0x1u<<24)
#define JPEG_HUFFENC_DC1_0_HCODE1       (0xFFu<<16)
#define JPEG_HUFFENC_DC1_0_HCODE1_0     (0x1u<<16)
#define JPEG_HUFFENC_DC1_0_HLEN0        (0xFu<<8)
#define JPEG_HUFFENC_DC1_0_HLEN0_0      (0x1u<<8)
#define JPEG_HUFFENC_DC1_0_HCODE0       (0xFFu<<0)
#define JPEG_HUFFENC_DC1_0_HCODE0_0     (0x1u<<0)

// HUFFENC_DC1_1 Configuration

#define JPEG_HUFFENC_DC1_1_HLEN3        (0xFu<<24)
#define JPEG_HUFFENC_DC1_1_HLEN3_0      (0x1u<<24)
#define JPEG_HUFFENC_DC1_1_HCODE3       (0xFFu<<16)
#define JPEG_HUFFENC_DC1_1_HCODE3_0     (0x1u<<16)
#define JPEG_HUFFENC_DC1_1_HLEN2        (0xFu<<8)
#define JPEG_HUFFENC_DC1_1_HLEN2_0      (0x1u<<8)
#define JPEG_HUFFENC_DC1_1_HCODE2       (0xFFu<<0)
#define JPEG_HUFFENC_DC1_1_HCODE2_0     (0x1u<<0)

// HUFFENC_DC1_2 Configuration

#define JPEG_HUFFENC_DC1_2_HLEN5        (0xFu<<24)
#define JPEG_HUFFENC_DC1_2_HLEN5_0      (0x1u<<24)
#define JPEG_HUFFENC_DC1_2_HCODE5       (0xFFu<<16)
#define JPEG_HUFFENC_DC1_2_HCODE5_0     (0x1u<<16)
#define JPEG_HUFFENC_DC1_2_HLEN4        (0xFu<<8)
#define JPEG_HUFFENC_DC1_2_HLEN4_0      (0x1u<<8)
#define JPEG_HUFFENC_DC1_2_HCODE4       (0xFFu<<0)
#define JPEG_HUFFENC_DC1_2_HCODE4_0     (0x1u<<0)

// HUFFENC_DC1_3 Configuration

#define JPEG_HUFFENC_DC1_3_HLEN7        (0xFu<<24)
#define JPEG_HUFFENC_DC1_3_HLEN7_0      (0x1u<<24)
#define JPEG_HUFFENC_DC1_3_HCODE7       (0xFFu<<16)
#define JPEG_HUFFENC_DC1_3_HCODE7_0     (0x1u<<16)
#define JPEG_HUFFENC_DC1_3_HLEN6        (0xFu<<8)
#define JPEG_HUFFENC_DC1_3_HLEN6_0      (0x1u<<8)
#define JPEG_HUFFENC_DC1_3_HCODE6       (0xFFu<<0)
#define JPEG_HUFFENC_DC1_3_HCODE6_0     (0x1u<<0)

// HUFFENC_DC1_4 Configuration

#define JPEG_HUFFENC_DC1_4_HLEN9        (0xFu<<24)
#define JPEG_HUFFENC_DC1_4_HLEN9_0      (0x1u<<24)
#define JPEG_HUFFENC_DC1_4_HCODE9       (0xFFu<<16)
#define JPEG_HUFFENC_DC1_4_HCODE9_0     (0x1u<<16)
#define JPEG_HUFFENC_DC1_4_HLEN8        (0xFu<<8)
#define JPEG_HUFFENC_DC1_4_HLEN8_0      (0x1u<<8)
#define JPEG_HUFFENC_DC1_4_HCODE8       (0xFFu<<0)
#define JPEG_HUFFENC_DC1_4_HCODE8_0     (0x1u<<0)

// HUFFENC_DC1_5 Configuration

#define JPEG_HUFFENC_DC1_5_HLEN11       (0xFu<<24)
#define JPEG_HUFFENC_DC1_5_HLEN11_0     (0x1u<<24)
#define JPEG_HUFFENC_DC1_5_HCODE11      (0xFFu<<16)
#define JPEG_HUFFENC_DC1_5_HCODE11_0    (0x1u<<16)
#define JPEG_HUFFENC_DC1_5_HLEN10       (0xFu<<8)
#define JPEG_HUFFENC_DC1_5_HLEN10_0     (0x1u<<8)
#define JPEG_HUFFENC_DC1_5_HCODE10      (0xFFu<<0)
#define JPEG_HUFFENC_DC1_5_HCODE10_0    (0x1u<<0)

// HUFFENC_DC1_6 Configuration

#define JPEG_HUFFENC_DC1_6_HLEN13       (0xFu<<24)
#define JPEG_HUFFENC_DC1_6_HLEN13_0     (0x1u<<24)
#define JPEG_HUFFENC_DC1_6_HCODE13      (0xFFu<<16)
#define JPEG_HUFFENC_DC1_6_HCODE13_0    (0x1u<<16)
#define JPEG_HUFFENC_DC1_6_HLEN12       (0xFu<<8)
#define JPEG_HUFFENC_DC1_6_HLEN12_0     (0x1u<<8)
#define JPEG_HUFFENC_DC1_6_HCODE12      (0xFFu<<0)
#define JPEG_HUFFENC_DC1_6_HCODE12_0    (0x1u<<0)

// HUFFENC_DC1_7 Configuration

#define JPEG_HUFFENC_DC1_7_HLEN15       (0xFu<<24)
#define JPEG_HUFFENC_DC1_7_HLEN15_0     (0x1u<<24)
#define JPEG_HUFFENC_DC1_7_HCODE15      (0xFFu<<16)
#define JPEG_HUFFENC_DC1_7_HCODE15_0    (0x1u<<16)
#define JPEG_HUFFENC_DC1_7_HLEN14       (0xFu<<8)
#define JPEG_HUFFENC_DC1_7_HLEN14_0     (0x1u<<8)
#define JPEG_HUFFENC_DC1_7_HCODE14      (0xFFu<<0)
#define JPEG_HUFFENC_DC1_7_HCODE14_0    (0x1u<<0)
